[
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_2_Q3",
      "serial_no": "3",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**3. The Indian party system is passing through a phase of transition which looks to be full of contradictions and paradoxes.” Discuss. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "The Indian party system, over more than six decades after Independence, provides a contrasting picture of partial success, serious shortcomings and huge challenges. The contradictions and paradoxes in the present phase of transition can be described as follows:\n\n* **Personality Cult in Politics —** Votes are sought in the name of the leader of a party rather than ideology of the party or pertinent issues. Eg. The last general elections of 2014 swept by the ‘Modi Wave’.\n* Increasing influence of **dynastic politics** in the absence of inner party democracy—This unlike other countries, say the US, where party members vote for candidates to run for presidency.\n* **Sharp erosion in the ideological orientation** of political parties - Party dynamics in India has resulted in emergence of valueless politics—with caste, religion, money and muscle power playing huge roles.\n* End of single-party dominance and **increase in influence of regional parties –** This resulted in nationalization of regional issues. Also, unprincipled alliances were formed between political parties that do not have common ideology, resulting in ‘politics of convenience’ to form coalition governments. Example- Current BJP-PDP alliance in J&K.\n* **Multi-Party System —** In contrast to other countries where there are two major parties, there are 7 recognised national parties in India, in addition to dozens of regional parties.\n\nThe party system can be said to be moving from social cohesion to fragmentation and from a stable pattern to fluidity.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_2_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**19. \"Increasing cross-border terrorist attacks in India and growing interference in the internal affairs of several member-states by Pakistan are not conducive for the future of SAARC (South Asian Association for Regional Cooperation).\" Explain with suitable examples. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "In the 31 years since the organization’s founding in 1985, SAARC’s efficacy in the region has been limited by tensions and disagreements between India and Pakistan. SAARC has largely been defunct for the last few years because of India-Pakistan friction and could soon become non-functional.\n\nThis was highlighted in the aftermath of an attack by militants that crossed the Line of Control into India-administered Kashmir to strike at an Indian Army camp in Uri. Since the attack, the Indian government has strongly condemned Pakistan and looked to isolate Islamabad on the world stage. This was followed by India pulling out of the 19th SAARC Summit in Islamabad in November 2016. Afghanistan, Bhutan and Bangladesh also followed suit.\n\nBy pulling out of the SAARC summit in Islamabad, India tried to achieve two ends: sending a tough message in the wake of the Uri attack but also that it is going ahead with its plan for ‘SAARC minus Pakistan’ instead. Some believe that SAARC minus one can better address South Asian challenges because the civil-military dissonance on Pakistan's policy towards India is making it difficult for Pakistan to relate to other states of the South Asian region. Also, Pakistan has been singularly stalling the process of economic integration through its policy of disallowing connectivity through its territory. Two most recent examples have been the talks on trade liberalisation and cross-border trade in energy during the last years where Islamabad pulled back just when the agreements were ready for signature. Pakistan also walked away from agreements on road connectivity which resulted in a ‘sub-regional cooperation’ called BBIN framework between Bangladesh, Bhutan, India and Nepal. Further, India is looking at the BIMSTEC (the Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation) as an alternative to SAARC as was witnessed with the BIMSTEC summit on the sidelines of the BRICS Summit.\n\nAll of the above limit the ability of SAARC to prosper as a regional organization. However, without effectively engaging Pakistan, the multiple challenges faced by SAARC countries on the economic and security fronts cannot be met satisfactorily. Much of the security challenges emanate from Pakistan because it uses terrorism as an instrument of its state policy. It stands between South Asia and Central Asia and holds the key to intra as well as inter-regional trade and commerce. Therefore, it is difficult to address the aforesaid challenges without roping in Pakistan into the SAARC framework for regional cooperation.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**17. The terms ‘Hot Pursuit’ and ‘Surgical Strikes’ are often used in connection with armed action against terrorist attacks. Discuss the strategic impact of such actions. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "With the Indian forces carrying out “surgical strikes” across the Line of Control, India seems to have abandoned the self-proclaimed policy of “strategic restraint” adopted in the face of earlier provocations by terrorists believed to be backed by Pakistan. This may not be the first time India has undertaken quick cross-LoC operations, but it has never before chosen to share information so publicly.\n\nStrategic impact of this action can be following.\n\n* This surgical strike indicates that India’s technical capabilities **(Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance — C4ISR)** have improved a great deal.\n* The terms “surgical strike” and “pre-emptive strike” used by India were intended to make it clear to the enemy that there will be repercussions and crossing the border does not guarantee immunity\n* The strikes proved to be an important element for maintaining the morale of the people of India and the armed forces.\n* The strike reinforced the credibility of the government and displayed its resolve, even as justified restraint and maturity was on display. This act would also counter India’s image of being a soft state.\n* Russia has also backed India, saying Pakistan should take effective steps in order to stop activities of terrorist groups in its territory. India seems to have played its cards well by seeking international and regional isolation of Pakistan before striking infiltrator targets across the LOC.\n\nThere are also several negative impacts of these types of acts as it may escalate the conflict especially in case of Pakistan, Security forces can be trapped in enemy territory. It could be a cause of international censure for violating other country’s border.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**19. Border management is a complex task due to difficult terrain and hostile relations with some countries. Elucidate the challenges and strategies for effective border management. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "India has a very large and complex border covering around 15106.7km, which it shares with Bangladesh, China, Pakistan, Nepal, Myanmar, Bhutan as well as small portion with Afghanistan. Challenges in the effective border management particular to some neighbours are:\n\n* Varied Terrain: India-China Border as comprising of difficult Himalayan terrain that is reason for difficulty in border management.\n* Climatic Condition: Due to Himalayan polar condition, it is tough to guard border due to adverse climatic conditions. Ex: China, Pakistan\n* Bitter relations with some of the neighbouring countries. Ex: Pakistan\n* Porous nature of border with some countries that provides safe route to human traffickers, illegal arms dealers, drug smugglers etc. Ex: Myanmar\n\nOwing to such peculiarities, having infrastructure and technology does not alone suffice for effective border management. Following strategies can be adopted for effective border management.\n\n* Co-ordination among various agencies such as customs, immigration, armed forces, border security and intelligence agencies is required that will strengthen the border guarding and management.\n* Smart border management to identify and implement controls which aim to improve border security by enabling effective communication and coordination.\n* Use of Drone, Night vision cameras, sensors to check the illegal migration, terrorist movement can help in effective border management.\n* Border fencing along the border such as with Bangladesh, Myanmar, Nepal can help in better border management.\n* Coordination among neighbouring countries would also strengthen the measures taken for border management.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**20. Use of internet and social media by non-state actors for subversive activities is a major security concern. How have these been misused in the recent past? Suggest effective guidelines to curb the above threat. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "The use of internet and social media has become a powerful tool in the hand of non-state actors such as terrorist organizations.\n\nUse of Internet, by terrorist organization such as **ISIS in recruiting youth** all around the world has become a reality. Cyber warfare is gaining importance due to increasing density of internet. The **Stuxnet** virus affected half of the world targeting Iran nuclear facilities.\n\nCyber espionage is also a great threat that exposes the vulnerability of any organization, or country. The recent theft of data of lakhs of ATMs cards in India is recent example of misuse of internet by non-state actors.\n\nSocial media is also been used by the like-minded individuals as a tool for radicalization. Muzaffarnagar riots in Uttar Pradesh got intensified because of misuse of social media by non-state actors.\n\nIn these circumstances effective strategies should be adopted to curb the threat posed by internet and social media. Following are some of the guidelines that can be very useful.\n\n* India recently appointed first Chief Information Security Officer (CISO). It will help India in developing the vision and policy to fight cyber crime and manage cyber security more effectively.\n* Creation of National Cyber Security Agency (NCSA) would improve India’s resilience and defense system.\n* Monitoring of content on internet by intelligence agencies such as Intelligence Bureau, RAW can prevent any attempt to radicalize youths.\n* National Cyber Security Policy 2013 aims at protection of information infrastructure in cyber space, reduce vulnerabilities. A National and sectoral 24×7 mechanism has been envisaged to deal with cyber threats through National Critical Information Infrastructure Protection Centre (NCIIPC)\n* Computer Emergency Response Team (CERT-In) has been designated to act as Nodal agency for coordination of crisis management efforts.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**10. The North-Eastern region of India has been infested with insurgency for a very long time. Analyze the major reasons for the survival of armed insurgency in this region. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "Due to its distinct socio-cultural background and particular historical evolution, the North-East region of India holds several fault lines around which many insurgent groups have been thriving for a very long time. The major reasons behind the evolution and survival of armed insurgency in this region are-\n\n* This region has been one of the most neglected regions in terms of developments and is the main cause behind the resentment of the people living in this area. The insurgent groups take advantage of resentment of people and get support base.\n* Alienation of population from mainstream political process, where the insurgent group continue to boycott the dialogue and electoral process. (Ex – NSCN-Khaplang group)\n* Hilly terrain, dense forest and porous borders give strategic advantages for the insurgent Guerilla groups and at the same time it creates big hurdle for the counter insurgency operations.\n* Racial clashes are very common here due to diverse racial profile of the region. In a fractured society the insurgent groups penetrate easily.\n* Active and covert foreign support to these insurgent groups, through training, logistic and moral support has also been a big hurdle to eradicate these groups.\n\nThe twin approach of development and counter insurgency operations coupled with honest political dialogue process may provide the best answer to the long infested insurgency in the North-East.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_2_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**15. Assess the importance of the Panchayat system in India as a part of local government. Apart from government grants, what sources the Panchayats can look out for financing development projects? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "Local self-governance means a system of governance where the local people or village people take decisions for their own governance and development through their representatives or direct participation. Realising the importance that the all-round development of the country is possible only through the development of rural India, Panchayati Raj Institutions (PRIs) were constitutionalized under the 73rd Amendment Act of the Constitution of India in 1992.\n\nPlan documents of both the central and state governments and various committees have emphasized the importance of these bodies in the polity. Five-year plans have also laid special emphasis on the role of Panchayats in rural developments.\n\nRural Development includes measures to strengthen the democratic structure of society through the PRIs. PRIs have been used to improve the rural infrastructure, income of rural households and delivery systems pertaining to education, health and safety mechanisms. These institutions are to be galvanized to become effective instruments of social and economic change at the local level.\n\n**Sources of Money**\n\nApart from the tax sharing and grants-in-aid from the state and the centre, the PRIs enjoy powers to levy various kinds of taxes and duties in rural areas.\n\nMajor tax powers include land tax; house building tax; vehicle tax; water, drainage and sanitation taxes; tax on profession, trade; tax on fairs and other entertainments; octroi on animals or goods or both brought for sale; tax for construction and public works; street cleaning fee; and pilgrimage fee. Fees for the use of panchayat shelter; user charges for hospitals and schools; fee for use of common resources like grazing land etc.; fee on markets and weekly bazaars are also the source of income. New powers recommended by SFCs (State Finance Commissions) include house tax; tax on pumps and tractors; tax on highway services; tax on village produce sold in regulated markets; tax on telephones and cable T.V.\n\nHowever, the decisions as to which taxes, duties, tolls and fees should be assigned to local governments and which should be shared by the State with them, continue to be with the state legislatures. Therefore, more devolution of financial powers to the PRIs is the need of the hour to make them as viable institutions to effect change in the socio-economic development of the rural India.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**10. Left Wing Extremism (LWE) is showing a downward trend, but still affects many parts of the country. Briefly explain the Government of India’s approach to counter the challenges posed by LWE. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "The Government’s approach is to deal with Left Wing Extremism in a holistic manner, in the areas of security, development, improvement in governance and public perception management. Recently, Government has come out with operational strategy ‘SAMADHAN’ to fight Left Wing Extremism in the country.\n\n**Government’s Approach:**\n\n* **Governance and Development:** The foremost focus of Government is to strengthen the connectivity in these areas so as to improve its engagement with the rest of the country. Infrastructural enhancements like road, railways and airport construction, instalment of mobile towers are taking place. For example- National Policy and Action Plan.\n* Smart Leadership and better coordination with the State governments is being encouraged by the Government to expand its reach in the LWE affected areas.\n* An aggressive strategy is being followed to modernise and strengthen the capacity of armed forces.\n* Special emphasis is being laid on the implementation of Forest Rights Act and ensuring entitlement of local communities over Minor Forest Produce.\n* **No Access to Financing:** To stop the maintenance and sustained survival of Left Wing Extremism, the Government is attempting to block Left Wing Extremist outfits’ access to financing.\n* **Rehabilitation and Surrender:** Surrender-cum-Rehabilitation Scheme is being implemented to ensure militants’ rehabilitation and return to the mainstream.\n* **Public Perception Management:** To counter the ideological effect of Left Wing Extremism on people, gaps between Security Forces and local people are being bridged through close interactions, Tribal Youth Exchange programmes, radio jingles, documentaries, pamphlets etc.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**20. India’s proximity to the two of the world’s biggest illicit opium growing states has enhanced her internal security concerns. Explain the linkages between drug trafficking and other illicit activities such as gunrunning, money laundering and human trafficking. What counter measures should be taken to prevent the same? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "Geographically, India is placed between the two largest opium growing areas in the world. To the west is the Golden Crescent (Afghanistan) and to the east is the Golden Triangle (Myanmar). This makes India vulnerable to drug trafficking through its borders and other illicit activities, and has enhanced her internal security concerns.\n\nThere exist linkages between drug trafficking and other illicit activities such as gunrunning, money laundering and human trafficking, which are as follows:\n\n* An increasing interoperability has been witnessed between drug cartels and other criminal groups. In Afghanistan around 85% of the opium growing area falls under Taliban. Taliban uses the funds from drug trade in many different ways like weapons smuggling, human trafficking, and proliferation of terrorism etc.\n* Drug trafficking groups also get attracted to human trafficking activities as there is some overlap between the routes used and there are advantages to be gained by sharing established logistical infrastructure, which includes transportation and storage facilities.\n* Similarly, gunrunning and money laundering require logistics supports which are shared by these organizations. At times these activities seem to sustain each other such as smuggling drugs by hiding it in human body parts. The revenue generated from drug trade is laundered to create assets such as casinos, bars, hotels etc. which again became breeding grounds for other crimes. Nexus between drug lords and armed groups gives rise to thriving weapons business.\n\n**Following counter-measures can be opted against these crimes:**\n\n* As these crimes are trans-national in character, countering them requires cooperation among all countries.\n* Making the border management more robust and plugging the gaps by bringing in force the recommendations of Madhukar Gupta Committee on border protection. The committee has given broad recommendations on the issues of Threats and Border Protection, assessment of force level, deployment on the border, infrastructure and technology issues for protection of border and administrative issues\n* Making the police and the concerned authorities acquainted to dark web and other modes of operation.\n* Sensitizing the public against negative fallouts of drugs and starting rehabilitation programmes.\n\nThis drug problem is a serious menace giving impetus to various other crimes, so strong political will and hard measures if required should be opted to tackle this challenge. Technical solutions are also necessary to augment and complement the traditional methods of border guarding. Working on both the front can probably address the existing problems of internal security.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_2_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**9. The time has come for India and Japan to build a strong contemporary relationship, one involving global and strategic partnership that will have a great significance for Asia and the world as a whole. Comment.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "The India-Japan partnership, described as one of the most rapidly advancing relationships in Asia, has emerged as a significant factor contributing to the stability and security of the Indo-Pacific region. Deviating from the traditional policy of focusing on economic engagements, the partnership has significantly diversified to include a wide range of interests—including regional cooperation, maritime security, global climate, and UN reforms.\n\nThe strategic consequences of a rising China in the Indo-Pacific is providing greater momentum to the India-Japan partnership. Both Japan and India through strategic convergence seeks to re-calibrate Asia’s balance of power. It can be reflected in flowing initiatives:\n\n* **Cooperation in Indo-Pacific region:**\n  + It is a confluence between India’s Act East policy and Japan’s Free and Open Indo-Pacific strategy.\n  + It will strengthen the rule of law and freedom of navigation, which is threatened by China’s muscle flexing in the South China sea.\n  + It will enhance cooperation with Japan and ASEAN countries.\n* **Asia Africa Growth Corridor (AAGC):**\n  + Japan looks to invest nearly $200 billion in Asia Africa region, that will turn the 21st century from an Asian century to Asian-African century.\n  + Japan will provide the state of the art technology and India will bring its expertise of working in Africa.\n  + AAGC seeks to counter China’s influence, that it is establishing through Belt and Road Initiative.\n* Japan, US, India(JAI) and Australia combinedly called Quad, is seen as an informal organisation that seeks to counter China.\n* Japan is taking the North-East Road Network Connectivity improvement project, this will be a crucial link in India’s Act East policy.\n* India and Japan are negotiating cross-service agreements that will give access to each other’s military facilities and could foster much closer military to military relations.\n\nApart from this, there are several engagements between India and Japan which are independent of China.\n\n* Economic engagement: Japan has made investment in India’s infrastructure. For example: Delhi-Mumbai economic corridor, Bullet train, Delhi metro etc.\n* India along with Japan, Brazil and Germany forms the grouping called G4 countries, that seeks UNSC reforms.\n* India is the first(non-signatory of the Non-Proliferation Treaty or NPT,) country with whom Japan has signed a civil nuclear deal.\n  + This will establish India’s credibility as a responsible nuclear power.\n  + It will boost India’ make in India initiative.\n  + It will augment India’s INDC commitment at Paris climate deal.\n\nJapan can prove to be a development multiplier in India. Therefore, India should develop an independent relation with Japan which is not to be seen in the context of China, US or any other country.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_3_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**9. The banning of ‘Jamaat-e-islaami’ in Jammu and Kashmir brought into focus the role of over-ground workers (OGWs) in assisting terrorist organizations. Examine the role played by OGWs in assisting terrorist** **organizations in insurgency affected areas. Discuss measures to neutralize the influence of OGWs.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "Terrorism instils an innate sense of fear in the citizen and dilutes the perceived control of the state over law and order. This state of lawlessness creates conditions which help the terrorist group achieve its political aims. Overground workers(OGWs) provide a support system to terrorist groups and networks in carrying out their activities in insurgency affected areas.\n\n### The role played by OGWs\n\n* **Food and Logistics support:** OGWs assist terror networks to meet their basic needs.\n* **Propaganda and radical narrative:** This provide the ideological background to the terror outfits.\n* **Finding new recruits:** Pool of Disgruntled youth provide a fertile ground for OGWs to propagate radicalisation and hire new recruits.\n* **Coordination with other stakeholders:** OGWs coordinate with secessionist leaders, and Organised crime Networks to meet their political objectives.\n* **Conduit for Illegal Money:** This is done through illegal trade, counterfeit currency, Tax evasion and Hawala transactions. These funds are also used to instigate anti-state protest like stone-pelting.\n* **Assist in the planning and execution of terror plans:** They provide operational planning, intelligence information, safety routes, maps and other inputs that are needed for terror operations.\n\n### Measures to neutralize the influence of OGWs\n\n* **Address the root cause of alienation among affected communities:** This is done by addressing genuine concerns and through awareness campaigns that dispel false propaganda.\n* **Rehabilitating orphans and women:** This would fulfil the state’s duty to ensure Social welfare. Also, It would counter the influence of OGWs to find new recruits.\n* **Intelligence Infrastructure:** To keep track of radicalisation attempts by OGWs and recruitment agents in order to stop this process at its inception.\n* **Human and Electronic Surveillance:** This is used to tap into existing networks to pre-empt terror attempts.\n* **International cooperation:** To facilitates follow up on suspects and terror networks.\n* **Fast track courts:** Laws like Public Safety acts for the speedy conviction of terrorists and OGWs through fast track special courts.\n\nHowever, Misuse of the legal provision in the random booking of youth on mere suspicion should be avoided. The best defence against terrorism is to ensure that the people do not have the incentive to pick up arms against the country by providing them equitable political, social and economic opportunities.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_3_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**20. Cross-border movement of insurgents is only one of the several security challenges facing the policing of the border in North-East India. Examine the various challenges currently emanating across the India-Myanmar border. Also, discuss the steps to counter the challenges. (250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "India and Myanmar share a long 1,643 km geographical land border and maritime boundary in the Bay of Bengal, which act as India’s gateway to South-East Asia.\n\nIndia-Myanmar border is highly porous, poorly guarded and located along a remote, underdeveloped, insurgency-prone region and proximate to opium producing area.\n\n### Various challenges across the India-Myanmar border\n\n* **Cross-Border Terrorism:** Indo-Myanmar border area have become a safe haven for dozens of insurgent groups. These insurgent groups performs offensive action in India and brings instability to the area by promoting separatist tendencies and take an easy hide in Myanmar.\n  + These groups also take advantage of loopholes in free movement regime across border to supply arms and drugs in India.\n* **Connectivity:** Several connectivity projects like Kaladan Multi-Modal project and IMT Trilateral Highway project are underway, but the ground level progress is quite unfortunate.\n* **Free Movement Regime:** It permits tribals to travel 16 km across the borders without any visa restrictions and allowed them to carry heavy loads. This loophole is well utilized by insurgents for trafficking of arms and drugs and to find safe havens in Myanmar.\n* **Boundary Agreement 1967:** Though the agreement has delineated the borders between the two countries but not much has been crystallised on ground level.\n* **Tribal Linkages:** The Indo-Myanmar border is densely populated with tribals, and these tribal communities have strong social-cultural linkages across borders and they refuse to accept the artificial border lines.\n* **Security Forces:** Assam Rifles had a responsibility of guarding the Indo-Myanmar border, but most of it battalions are engaged in counter-insurgency operations. Therefore, it functions like counter-insurgency force rather than border-guarding force.\n* **Infrastructural Facility at Border Check-Points:** The infrastructure facilities at border check-points is not sufficient to meet the required challenge. **Moreh-Zokhawater** point has been declared as **Integrated Check-Point (ICP)** but nothing much have materialised on the ground.\n* **Difficult Terrain Across Border:** The geographical terrain around border areas is highly inaccessible, so it becomes quite difficult to develop communication and connectivity.\n* **Trafficking:** Proximity to **‘golden triangle’** has made Indo-Myanmar border highly vulnerable to drug trafficking and the border has become a gateway for trafficking of women and small children to South Asian Nations.\n* **Rohingya Issue:** Influx of marginalised muslim minority rohingya community has raised a serious **sociocultural confrontations** in the areas due to increased burden on local resources.\n\n### Steps to Counter the Challenges\n\nThe vulnerability of the India-Myanmar border is posing a serious challenge to the internal security of the country. The Government of India should pay immediate attention to effectively manage this border.\n\n* It should strengthen the security of the border by either giving the Assam Rifles the single mandate of guarding the border or deploying another border guarding force such as the Border Security Force (BSF).\n* It should initiate a revision of the FMR and reduce the permitted distance of unrestricted travel.\n* The construction of the ICP along with other infrastructure should be expedited.\n* **The Comprehensive Integrated Border Management System (CIBMS)** which is touted as a robust and integrated system, is capable of addressing the gaps in the present system of border security by seamlessly integrating human resources, weapons, and high-tech surveillance equipment, should be proactively deployed.\n* Sustained community interaction programmes so that the border tribal communities can be sensitised to participate in the nation building on both sides of the border.\n\nIndia should endeavour to meaningfully engage with Myanmar and solicit its cooperation in resolving all outstanding issues and better manage their mutual border.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_2_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**8. “The emergence of the Fourth Industrial Revolution (Digital Revolution) hasinitiated e-Governance as an integral part of government”. Discuss.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "The Fourth Industrial Revolution is a way of describing the blurring of boundaries between the physical, digital, and biological worlds. It’s a fusion of advances in Artificial Intelligence (AI), robotics, the Internet of Things (IoT), quantum computing, and other technologies. It is about more than just technology-driven change; it is an opportunity to help everyone, including government, policy-makers and people to harness converging technologies in order to create an inclusive, human-centred future.\n\nThe recent technological changes have fundamentally altered the way states govern and people respond. The growth of computers, digital technologies and telecommunications has drastically changed the way the state conducts its functions.\n\nElectronic governance or e-governance is one of them. E-governance is about a process of reform in the way governments work, share information and deliver services. Specifically, e-government harnesses information and communication technologies (ICT) to deliver information and services to citizens and businesses.\n\nSome positive examples of the e-governance that have promoted effectiveness of government at the national level include:\n\n* **Digital India:** Itstrivesto bring inclusive growth and bridge the digital divide by leveraging technology solutions that are low cost, developmental, transformative and designed to empower ordinary Indians.\n* **BharatNet:** One of the largest digital infrastructures of the world was conceived to connect all the 250,000 gram panchayats by a high-speed optical fibre network.\n* India isseeing a dramatic growth in the number of online transactionsinvolving citizens and the government. It proves that citizens are quick to adopt these technologies. The onus lies on the government to provide the relevant infrastructure and policies to enable effective digitization of the economy.\n* **Umang:** It is a platform that enables access to services offered by the Government, such as EPF, Ayushman Bharat, on mobile phone.\n* **Direct Benefit Transfer (DBT):** Under this inititative subsidies and scholarsips are directly credited in the bank account of the beneficiary. It has immensly helped in targeted delivery of benefits and reducing corruption.\n\nIndustrial Revolution 4.0 brings with it immense potential to improve governance. Its right use will result in improving accountability, access to services, and strengthening of democracy.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_3_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**10. For effective border area management, discuss the steps required to be taken to deny local support to militants and also suggest ways to manage favourable perception among locals.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "India shares its border with seven countries, and it occupies a major strategic position in Southern Asia, therefore, it is necessary to manage the borders properly. Governments make a huge investment and provide good support for border security. Still, border management poses major challenges around the world.\n\n**Steps required to be taken**\n------------------------------\n\n* **Employment opportunities**: Provide employment opportunities to the youth so that they can do away with the militancy and therefore instead of supporting the militants, they will oppose them.\n* **Grassroot Democracy**: Conducting local body elections in re-establishing the grassroot level democracy which results into the extended support from community in development processes.\n* **Media Facilitation Centers**: Setting up of Media Facilitation centers to reduce the trust deficit since these centers provide internet services to the reporters and freelancers.\n* **Intelligence Grid**: Strengthening the technical intelligence grid to track any terror suspect and prevent terrorist attacks with real time data. It will also enhance human intelligence networking.\n\n**Way Forward**\n---------------\n\n* Without the development process, there will be no organic end of the causes of discontent and unrest.\n* Social empowerment by means of skills, education, employment opportunities, human rights, rule of law have enough potential in tackling the unfavorable perception among the locals.\n* Also, controlling the misinterpretation of culture, hate speeches and ignorance will enhance the process of persuasion and cognitive change.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_3_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**20. Analyze internal security threats and transborder crimes along Myanmar, Bangladesh and Pakistan borders including Line of Control (LoC). Also discuss the role played by various security forces in this regard.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "India has a large and complex border covering around 15106.7 km, which it shares with Bangladesh, China, Pakistan, Nepal, Myanmar, Bhutan as well as a small portion with Afghanistan.\n\n**Challenges in the effective border management particularly to Myanmar, Bangladesh and Pakistan:**\n\n* **India-Myanmar Border**: The northeastern states of Arunachal Pradesh, Nagaland, Manipur, and Mizoram share the border with Myanmar. Some of the insurgent groups like the National Socialist Council of Nagaland (NSCN) and the United Liberation Front of Asom (ULFA) operate from Myanmar, which threatens the security of India as well as Myanmar. Porous nature of the border provides safe route to human traffickers, illegal arms dealers, drug smugglers etc.\n* **India-Bangladesh Border**: The Indo-Bangladesh Border (4,096 km) passes through West Bengal, Assam, Meghalaya, Tripura, and Mizoram. The entire stretch consists of plains, riverine belts, hills and forests which make illegal migration easy. Illegal migration across this border poses serious security threats and acts as a fertile ground for organizations like the Inter-Services Intelligence of Pakistan to penetrate and expand their activities. Also, the poor law and order situation at the border has led to smuggling of arms and drugs. Supply of arms help in sustaining any conflict.\n* **India-Pakistan Border**: Indo-Pakistan Border (3,323 km) runs along the states of Gujarat, Rajasthan, Punjab and Jammu & Kashmir. Direct accessibility of the borders and some technological developments enabling quick passage of information and transfer of funds has changed the focus and tenor of border security. Cross-border terrorism from Pakistan has exacerbated due to non-recognition of boundaries by its terrorist groups and their success in acquiring legitimacy due to religious or ethnic identity.\n\n**Role played by various security forces in this regard**\n\n* **Assam Rifles**: This force significantly contributed to opening the region to administration and commerce and over time they came to be known as the right arm of the civil and left arm of the military.\n* **Border Security Force**: The BSF has air wing, marine wing, an artillery regiment, and commando units. It currently stands as the world’s largest border guarding force. BSF has been termed as the First Line of Defence of Indian Territories. It is India’s primary border guarding organization on its border with Pakistan and Bangladesh.\n* **Sashastra Seema Bal**: The sole objective of this force is achieving ‘total security preparedness’ in the remote border areas for performing a ‘stay-behind’ role in the event of a war. SSB is now spread along the International Border across Uttarakhand, UP, Bihar, West Bengal, Sikkim, Assam, and Arunachal Pradesh.\n\nIndia should endeavor to meaningfully engage with Myanmar, Bangladesh and Pakistan and solicit their cooperation in resolving all outstanding issues and better manage their mutual border.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_3_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**9. Discuss how emerging technologies and globalisation contribute to money laundering. Elaborate measures to tackle the problem of money laundering both at national and international levels.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "Money laundering is defined as the process that disguises illegal profits without compromising the criminals who wish to benefit from the proceeds.\n\n**Emerging technologies contribute to money laundering in following ways:**\n\n* Structuring deposits, involvement of a lot of channels popularly called as smurfs, to hide from the anti-money laundering reporting.\n* Use of cryptocurrencies and alternate finance that are unregulated by governments.\n* Large volume of digital transactions at online market places is used to disguise the structured chunks of layered money.\n\n**Globalisation contributes to money laundering in following ways:**\n\n* Placement of money in global financial system creates problems of coordination between multiple jurisdictions.\n* Shell companies lie within the sovereign border without active business operations in the guise of legitimate transactions through fake invoices and balance sheets wherein they channel the laundered money into illegitimate businesses.\n* Tax haven countries like Cayman Island, Panama etc. have structured their economies around assistance in tax evasion.\n\n**Measures at national level:**\n\n* Prevention of Money Laundering Act (PMLA), 2002 criminalises money laundering as a cognisable, non-bailable offence.\n* Financial Intelligence Unit – India (FIU-IND) coordinates efforts of national and international intelligence, investigation and enforcement agencies against money laundering.\n* The Black money (undisclosed foreign income and assets) and Imposition of Tax Act, 2015 deals with the menace of the black money existing in the form of undisclosed foreign income and assets.\n\n**Measures at international level:**\n\n* The Vienna Convention makes it obligatory for signatory states to criminalise the laundering of money from drug trafficking.\n* The Financial Action Task Force (FATF) sets standards and promotes effective implementation of legal, regulatory and operational measures against money laundering and terror financing.\n* The OECD forum has adopted convention against money laundering. It supports appropriate safeguards, access to tax administration in suspicious transaction based on information received from FIUs.\n* The International Organisation of Securities Commissions (IOSCO) takes necessary steps to combat money laundering in securities and futures markets.\n\nMoney Laundering is a global menace which require global effort to curb it. Both international and national stakeholders need to come together by strengthening data sharing mechanisms and adopting a multilateral approach to effectively eliminate the problem of money laundering.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_3_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**10. Keeping in view of India’s internal security, analyse the impact of cross-border cyber-attacks. Also, discuss defensive measures against these sophisticated attacks.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "A cyber-attack is a type of attack that targets computer systems, infrastructures, networks, or personal computer devices using various methods at hands. Depending on the context, cyberattacks can be part of cyberwarfare or cyberterrorism. A cyber-attack can be employed by sovereign states, individuals, groups, society, or organisations, and it may originate from an anonymous source.\n\n**The term ‘cross-border’ implies a movement or an activity across a border between the two countries. Impact of cross-border cyber-attacks include:**\n\n* Debilitating impact on Critical Information Infrastructure (power plants, nuclear plants, telecommunications etc.).\n* It can be used as spyware to get sensitive information.\n* Terrorists may use social media to plan and execute terror attacks and for virulent propaganda to incite hatred and violence.\n\n**The defensive measures undertaken to counter cross-border cyber-attacks are:**\n\n* Coordination with different agencies at the national level.\n* The government needs to issue alerts and advisories regarding the latest cyber threats and countermeasures on a regular basis.\n* The Information Technology Act, 2000 has deterrent provisions to deal with cyber-attacks.\n* National Critical Information Infrastructure Protection Centre (NCIIPC) has been established to deal with cyber security issues.\n* The National Cyber Coordination Centre (NCCC) has been set up for timely sharing of information with individual entities.\n* Cyber Swachhta Kendra (Botnet Cleaning and Malware Analysis Centre) has been launched for detection of malicious programs and provide free tools to remove the same.\n* The Technology Development Board and Data Security Council of India (DSCI) have jointly decided to promote cyber security start-ups in India.\n\nThe need of the hour is to produce a futuristic National Cyber-Security Policy which allocates adequate resources and addresses the concerns of the stakeholders.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_3_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**19. Analyse the multidimensional challenges posed by external state and non-state actors, to the internal security of India. Also discuss measures required to be taken to combat these threats.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "Internal security has assumed core importance for India. As India now aspires and rises to taking the high seat in the comity of nations, the security challenges become more compounded and complex. India faces multifold threats from external states and non-state actors on the internal security front. State actors include the foreign government representative and their agencies. Non-state actors may include NGOs, multinational companies, terrorist and religious groups, hackers, etc.\n\n**Challenge posed by external state actors:**\n\n* A few of India’s bordering countries support the insurgent groups through funding, training, or coordination. For example, China is alleged to support insurgents in the North-East.\n* There have been instances where state actors have been responsible for carrying out cyber warfare through hacking and other espionage.\n* State actors also fund their proxies in and out of India to spread instability within the country and tarnish its stature at the global platforms.\n\n**Challenges posed by non-state actors:**\n\n* Multi-national Companies (MNCs) have the potential to threaten national security, especially in the data security and cyberspace domains, and by influencing the policies of their respective governments. It is the reason several Chinese apps were blocked in India recently.\n* Non-state organisations with anarchic and fundamentalist ideologies repugnant to the secularist credentials of India are potential threats to the peaceful internal security environment of the nation.\n* Propagandas are run and funded by enemy countries and other non-state actors (NGOs and civil society organisations) to destabilise India by damaging the socio-religious fabric and ensure riots.\n\n**Following measures shall be undertaken to combat the internal security challenges:**\n\n* There must be effective communication and coordination between intelligence agencies and law enforcement agencies.\n* Sound cyber security measures must be in place to prevent any attempt of cyber attacks.\n* Collaboration should be there between the government, media and the public to ensure quick and efficient sharing of information about suspicious activities to the law enforcement agencies.\n\nWe need to understand national security in a comprehensive sense and not in narrow military terms only. While it is imperative to guard our borders and strengthen our diplomacy, we also need to check the various non-state actors who come in hidden forms. There is a need for a national internal security doctrine to deal with various challenges.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_3_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**20. Analyse the complexity and intensity of terrorism, its causes, linkages and obnoxious nexus. Also suggest measures required to be taken to eradicate the menace of terrorism.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "Terrorism can be defined as the calculated use of violence or the threat of violence to inculcate fear; intended to coerce or to intimidate governments or societies in the pursuit of goals that are generally political, religious, or ideological.\n\n**Causes of terrorism:**\n\n* Lack of political legitimacy and continuity, as well as a lack of integration for the political fringes, encourages ideological terrorism.\n* Perceptions of deprivation and inequality, especially amongst culturally defined groups. This can lead to civil violence, of which terrorism may be a part.\n* Terrorist tactics are used not out of a random desire to fire rockets at civilians but to leverage violence to gain specific concessions.\n* Socio-economic explanations of terrorism suggest that various forms of deprivation drive people to terrorism, or that they are more susceptible to recruitment by organisations using terrorist tactics. Poverty, lack of education or lack of political freedom are a few examples.\n* Extreme ideologies may sometime result in hatred towards other sections of society and may lead to terrorism. Examples of terrorist groups motivated by ideology include the Irish Republican Army (IRA) and the Liberation Tigers of Tamal Eelam (LTTE).\n\n**The linkages and obnoxious nexus of terrorism include:**\n\n* Terrorism and organised crime aid each other to thrive and survive. The financial proceeds of organised crime such as extortion/kidnapping are made legal through money laundering and then used to fund terrorist activities.\n* Terrorist groups levy taxes on drug traffickers to provide security to criminals in their controlled area.\n* Terrorist groups act as proxies of enemy governments which in turn provide them funding and shelter.\n\n**The measures undertaken to combat terrorism are:**\n\n* Adoption of a Comprehensive Convention on International Terrorism.\n* Strengthening national coordination mechanisms to promote inter-agency participation and information exchange, facilitating joint monitoring, threat assessment.\n* Updating national legislation to ensure that terrorist and organised crime offences are precisely defined.\n* Awareness generation and deradicalization of the youth to wean them away from the clutches of their influencers.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**14. Comment on the resource potentials of the long coastline of India and highlight the status of natural hazard preparedness in these areas.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "India's long coastline, stretching over 7,500 kilometers along the Arabian Sea and the Bay of Bengal, presents a wealth of resource potentials as well as significant challenges related to natural hazard preparedness.\n\n* **Resource Potentials of India's Coastline:**\n  + **Fisheries:** India's coastline is abundant in marine life, making it a crucial hub for fisheries. It supports a thriving fishing industry, contributing significantly to the country's food security.\n  + **Ports and Shipping:** The coastline hosts several major ports, such as Mumbai, Chennai, and Kolkata, facilitating trade and commerce.\n  + **Tourism:** Coastal regions, including Goa, Kerala, and Andaman and Nicobar Islands, are popular tourist destinations due to their scenic beauty and cultural attractions.\n  + **Mineral Resources:** Coastal areas are often rich in mineral resources, including sand, salt, and minerals like ilmenite, garnet, and monazite.\n  + **Renewable Energy:** India's coastline has immense potential for renewable energy generation, particularly through offshore wind and tidal energy projects.\n* **Status of Natural Hazard Preparedness:**\n  + While India's coastline offers significant opportunities, it is also highly vulnerable to natural hazards, including cyclones, tsunamis, and sea-level rise:\n    - India has been actively monitoring **sea-level changes, bolstering coastal infrastructure resilience, conserving mangroves**, and engaging in urban planning.\n    - This includes establishing the **National Disaster Management Authority (NDMA) and State Disaster Management Authorities (SDMAs)** to coordinate disaster response and preparedness at national and state levels.\n    - **Early warning systems**, particularly for **cyclones,** have been improved, saving countless lives.\n    - **India** has established an advanced **Indian Tsunami Early Warning Centre (ITEWC),** which is operated by the **Indian National Centre** for **Ocean Information Services (INCOIS).**\n    - The **INCOIS** and **National Institute of Ocean Technology (NIOT)** are key agencies for monitoring and understanding trends and variations in sea levels.\n\nIndia's vulnerable coastal regions require ongoing efforts in disaster preparedness, infrastructure development, and climate adaptation for sustainable growth.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**9. Winning ‘Hearts and Minds’ in terrorism affected areas is an essential step in restoring the trust of the population. Discuss the measures adopted by the Government in this respect as part of the conflict resolution in Jammu and Kashmir.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "Winning of ‘Hearts and Minds’ refers to the government backed people-centric approach to win support of the local people to restore their trust in the system in conflict ridden regions like Kashmir where goal is to counteract the influence of terrorism.\n\n**Measures adopted by the government with respect to Kashmir**\n\n* **Abrogation of Article 370:** For greater integration of Jammu and Kashmir with rest of India and bringing youth into mainstream, special status of Jammu & Kashmir has been abrogated.\n* **Youth participation:**\n  + Under project *Sadhbhavana*, Army Goodwill Schools (AGS), hostels and vocational courses were launched; teenagers and the elderly were taken on a ‘Bharat Darshan’ and cricket tournaments were organized for youth in the Valley.\n  + **Project Himayat** was launched for capacity building and **Project Umeed** for empowering J&K women.\n* **Infrastructure Developments:** Emphasis has been laid on creating infrastructure in transportation, health etc. For example, PM’s development package for J&K, Khelo India centers in J&K.\n* **Development of Tourism, Arts and Crafts Sectors:** The new Wool Processing, Handicrafts and Handloom Policy, 2020 has been adopted for promotion and development of handicrafts and handloom sector.\n* **Anti-Radicalisation Drives:** To make people of Kashmir feel less alienated and more incorporated towards Indian cause, anti-radicalisation drives were launched.\n* **Political Engagements:** Engagement with young breed of political leaders for encouraging political dialogues and promoting regional youth participation in local politics is being promoted.\n\nThough the government approach is to restore peace, stability, and development in the region, the situation in Kashmir remains complex. It is high time that government implements more such policies for complete integration of the state's people with the rest of India.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**10. The use of unmanned aerial vehicles (UAVs) by our adversaries across the borders to ferry arms/ammunitions, drugs, etc., is a serious threat to the internal security. Comment on the measures being taken to tackle this threat.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "An Unmanned Aerial Vehicle (UAV) is a “remotely piloted or self-piloted aircraft that can carry cameras, sensors, communications equipment or other payloads like arms/ammunitions, drugs. It can be used by our adversaries across the border and can be a serious threat to internal security.\n\n**Cause of concern**\n\n* They can fly at high altitudes and low speeds making it difficult for border security forces to detect and intercept them.\n* They can be remotely controlled and flown from a safe distance, reducing the risk to human operatives engaging in infiltration attempts.\n* Drones can also be used for espionage purposes, allowing unauthorized individuals to gather sensitive information about military installations, critical infrastructure, and other key targets.\n\n**Measures taken by Indian government to tackle threats**\n\n* **Technological Upgradation:** Deployment of anti-drone weapons, detection systems like radars, jammers, e.g., anti-drone systems like the SkyWall 100 and the DroneGun Tactical CHIMERA anti-drone system, developed using French technology.\n* **Military Intelligence**: The BSF conducts round-the-clock surveillance through patrolling, checkpoints, and observation posts, erected a border fence and installed floodlights.\n* **Institutional:** MHA has established Anti Rogue Drone Technology Committee (ARDTC) to evaluate the technology available to counter rogue drones.\n* **Governmental Collaboration:** Active collaboration with countries like Israel for high end drones.\n* **DRDO Nishant:** Primarily designed for intelligence-gathering over enemy territory, it is also used for reconnaissance, training, surveillance, target designation, artillery fire correction, and damage assessment.\n* **Counter-Unmanned Aircraft Systems (C-UAS) strategy:** It includes blocking communication lines and bringing down unwanted drones.\n\nWith the emergence of technology comes the threat to internal security. Therefore, a comprehensive drone strategy that includes private participation for developing high end drones is the need of an hour.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_3_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**Q9. Explain how nacro- terrorism has emerged as a serious threat across the country. Suggest suitable measures to counter narco-terrorisam. (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "### Approach\n\n* Write a brief introduction about Narco-terrorism.\n* Explain emergence of narco-terrersm as a threat across the country.\n* Mention measures to counter Narco-tererrism.\n* Write a holistic conclusion.\n\n### Introduction\n\n**Narco-terrorism** is the use of **organized terror** by **states, insurgents,** or **criminal networks** to achieve **political, economic,** or **social objectives** through **drug trafficking. Narco-terrorism** is increasingly linked to the **narcotics-producing** regions of the **Golden Crescent** and the **Golden Triangle.**\n\n### Body\n\n* **Narco-terrerism as Threat:**\n  + It creates a dual **threat of violence** and **organized crime, destabilizing nations, corrupting institutions**, and **fostering insecurity by financing insurgencies, cartels, and extremist networks** globally.\n  + **Northeast states of India, Punjab** and **Jammu & Kashmir** are the major Indian states which are suffering with narco-terrerism.\n  + In India, drug trafficking networks exploit **porous borders, particularly** with **Afghanistan and Myanmar,** to finance terrorism.\n* **Measures to Counter Narco-Terrorism**\n  + **Enhanced Border Surveillance:** Strengthen border security using advanced technologies like **drones, satellite imagery, and AI-based surveillance systems** to curb drug smuggling.\n  + **Financial Monitoring**: Implement robust financial intelligence mechanisms to trace and disrupt narcotic-linked terrorist funding.\n  + **International Cooperation:** Bolster transnational partnerships through organizations like the UNODC and Interpol to dismantle global narco-terror networks.\n  + **Public Awareness and Rehabilitation:** Conduct **anti-drug awareness campaigns** and establish **de-addiction programs** to weaken the consumer base.\n  + **Legal Reforms:** Strengthen laws for stricter punishment against drug traffickers and terror financiers.\n\n### Conclusion:\n\nA Multi-faceted approach is essential to counter narco-terrorism. Strengthening border security, enhancing international cooperation, and implementing stringent anti-money laundering measures such as Prevention of Money Laundering Act, 2002 are crucial. Additionally, addressing socio-economic issues, promoting alternative livelihoods, and investing in education can help reduce the appeal of drug trafficking and terrorism, fostering long-term stability.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_3_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**Q19. India has a long and troubled border with China and Pakistan fraught with contentious issues. Examine the conflicting issues and security challenges along the border. Also give out the development being undertaken in these areas under the border Area Development Programme (BADP) and Border Infrastructure and Management (BIM) Scheme. (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "### Approach\n\n* Briefly introduce the historical and geopolitical significance of India’s borders with China and Pakistan.\n* Examine the conflicting issues, security challenges along the border, and development initiatives under BADP and BIM.\n* Conclude with the significance of combining security measures with development efforts.\n\n### Introduction\n\nIndia’s borders with **China** and **Pakistan** are marked by historical disputes and ongoing security challenges.\n\n### Body\n\n* **India’s Border with China and Pakistan:**\n  + The **India-China border,** known as the **Line of Actual Control (LAC),** spans approximately **3,440 km.** On the western front, the **India-Pakistan border** known as **Line of Control (LOC)** spread about **740 km.**\n* **Conflicting Issues and Security Challenges:**\n  + **Chinese Front:**\n    - The primary issue with China is the **ill-defined boundary**, leading to **frequent face-offs** and **skirmishes.** Notable incidents include the **Galwan Valley clash, 2020, Doklam military standoff, 2017.** The competition to build infrastructure along the LAC further exacerbates tensions.\n    - Significant smuggling of **Chinese electronics** and other consumer goods occurs through these **India-China border points.**\n  + **Pakistan Front:**\n    - The issue with Pakistan is frequent violation of **LoC,** with **cross-border shelling** and **infiltration attempts** by militants. The **Pulwama attack** of **2019** and subsequent **Balakot airstrike** are recent examples of the volatile situation.\n    - Pakistan asserts that the entire **Sir Creek**, including its eastern bank marked by a **\"green line\"** on a **1914** map, belongs to them.\n* **Border Area Development Programme (BADP):**\n  + **BADP** aims to develop infrastructure and improve the living conditions of people in border areas.\n  + Projects include building **roads, schools**, and **healthcare facilities,** enhancing both security and socio-economic conditions.\n  + **Developed Karcham-Chitkul Road 40 km** road stretch via **Sangla** in the Kinnaur district of **Himachal Pradesh,** which shares a border with China.\n* **Border Infrastructure and Management (BIM) Scheme:**\n  + It helps in the creation of infrastructure such as **border fence, border flood lights, technological solutions, border roads and Border OutPosts (BOPs)** and company operating bases to secure India's borders with **Pakistan, Bangladesh, China, Nepal, Bhutan and Myanmar.**\n  + India plans to build **383** composite border outposts along the **India-Bangladesh border,** and **126** along the **India-Pakistan border.**\n\n### Conclusion\n\nThrough initiatives like BADP and BIM, India is not only enhancing border security but also fostering development in these critical regions, aiming for a balanced approach to border management.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_3_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**Q.20 Social media and encrypting messaging services pose a serious security challenge. What measures have been adopted at various levels to address the security implications of social media? Also suggest any other remedies to address the problem. (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SecurityIssues"
    },
    "solution": {
      "explanation": "### Approach:\n\n* Introduce the answer by highlighting the proliferation of social media\n* Highlight security challenges of social media and encrypted messaging services\n* Give current measures to address social media security challenges\n* Suggest other remedies to address the problem\n* Conclude suitably.\n\n### Introduction:\n\nThe **proliferation of social media and encrypted messaging services** has revolutionised communication in India.\n\n* These platforms have become powerful tools for **information sharing and connectivity,** but they also present complex risks to **national security, public safety, and social harmony.**\n* From the spread of misinformation to facilitating criminal activities, these digital spaces have emerged **as a new frontier for security concerns.**\n\n### Body:\n\n**Security Challenges of Social Media and Encrypted Messaging Services:**\n\n* **Misinformation:** Social media spreads false info, fueling unrest. (Manipulated content flooding platforms in **2022 Russia Ukraine War).**\n* **Radicalization:** Extremists recruit via encrypted apps. (**ISIS** on Telegram).\n* **Cybercrime:** Platforms enable scams, identity theft. (**2023 deep fake scams** with celebrity faces).\n* **Data Privacy:** Misuse of user data raises concerns. **(2018 Cambridge Analytica scandal)**\n* **Digital Warfare**: Platforms used for disinformation and state interest. **(2020 U.S. election manipulation by Russia)**\n\n**Measures to Address Social Media Security Challenges:**\n\n* **IT Act 2000:** Governs online communication; **Section 69A** enables blocking content for security, and **Section 79(1)** grants intermediaries conditional immunity. **(India banned 59 Chinese apps in 2020)**\n* **IT Rules 2021**: Mandates content moderation and user privacy notifications. **(Twitter faced compliance issues in 2021)**\n* **Grievance Officers:** Platforms must appoint officers to handle complaints. (Meta appointed **Spoorthi Priya** in 2022)\n* **Fact-Checking:** Platforms must remove false content flagged by the government. **(2023 rule under Supreme Court review)**\n\n**Other Remedies:**\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_3_Q20_IMG_1.png)\n\n### Conclusion:\n\nBy combining technological solutions, digital literacy initiatives, and collaborative efforts between stakeholders, India can create a more secure online environment. Ultimately, the goal is to strike a **delicate balance between national security interests and individual privacy rights,** ensuring a safe and vibrant digital ecosystem for all citizens.",
      "explanation_format": "markdown"
    }
  }
]