[
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_1_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**2. Krishnadeva Raya, the King of Vijayanagar, was not only an accomplished scholar himself but was also a great patron of learning and literature. Discuss. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Krishnadeva Raya who ruled the kingdom of Vijayanagara was one of the greatest statesmen which medieval South India had produced. Called variously as ‘Kannadaraya’, ‘Sri Karnata Mahisa’ and ‘Kannada Rajya Ramaramana’, his rule saw all round prosperity of South India, culturally and materialistically.\n\nKrishnadeva Raya was a great patron of literature and was known as Abhinava Bhoja. Himself being a scholar, he wrote the Telugu work *Amuktamalyada* and a Sanskrit play, *Jambavati Kalyana*.\n\n* He had eight great scholars called Ashtadiggajas in his court. They included Allasani Peddana often described as the Andhra-kavitapitamaha. His famous work was *Manucharitamu;* another famous poet was Nandi Thimmanna, the author of *Parijathapaharanamu*.\n* Other eminent literary luminaries were Tenali Ramakrishna, Kumara Dhurjati and Rama Raja Bhushana.\n* He asked the Kannada poet Thimmanna to complete the Kannada Mahabharatha started by Kumara Vyasa.\n* Telugu poet Peddanna was personally honoured by him for his proficiency in Telugu and Sanskrit and Krishnadevaraya himself gave a helping hand to lift the palanquin in which the poets book *'Manucharitamu'* was placd and taken in a procession.\n\nIt is said whenever Krishna-devaraya met the poet while riding on his elephant, he gave him a lift. According to Nidatavolu Venkata Rao, the reign of Krishnadevaraya is a glorious chapter in the South Indian literary history. The imperial court had representatives of Sanskrit, Telugu, Kannada and Tamil poets, who contributed largely to their respective literatures.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_1_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**5. Highlight the difference in the approach of Subhash Chandra Bose and Mahatma Gandhi in the struggle for freedom. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Mahatma Gandhi and Subhash Chandra Bose were both legendary personalities, gigantic in their political moral and ethical stature. Both played crucial roles in the freedom movement. They were both internationalists and humanists as well as secular in their approach and anti-social in their outlook. In spite of their common thought process, there were glaring differences in their approach. They are as follows:\n\n* Subhash Chandra Bose was a radical socialist meaning that he wanted to change the existing socio-economic situation whereas Gandhi was a conservative.\n* The young members, of INC including Bose demanded complete self-rule without any compromise while the senior members were okay with dominion status for India within British rule.\n* Bose had a strong revolutionary urge to achieve freedom while Gandhi believed in passive resistance.\n* Bose proposed the idea of complete Independence from the British rule. He wanted Swaraj based on all out struggle. Gandhi on the other hand believed in the concept of Struggle-Truce-Struggle. Gandhi was in favour of trusteeship theory and aspired village to be self-sustained economy.\n* Bose was a strong supporter of Fascism which was obvious in his strong belief that India needed a political system which was a mix of fascism and communism. Gandhi on the other hand was an anti fascist who did not propagate any such extreme political system.\n* Bose was open to the idea of taking foreign assistance to achieve freedom as seen in the formation of Indian national Association while Gandhi was completely against any such idea.\n\nDespite their ideological defferences both Gandhi and Bose spoke highly of each other. There were occasions when Bose praised Gandhi for his success in involvement of women in freedom struggle. Even Gandhi while differing from Bose’s extreme methods had utmost admiration for his unique effort for India’s freedom, mainly his struggle for freedom from outside India. Cue must be taken from these two great leaders’ tolerance and respect towards each other even after serious difference of opinion.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**8. What is allelopathy? Discuss its role in major cropping systems of irrigated agriculture. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Allelopathy is a biological phenomenon in which plants release chemical poisons to destroy neighbouring plants in their bid for more space and sunlight. The poison released are deadly, they change the very genetic structure of the victim plants preventing its growth and ultimately leading to its death.\n\n* **In sustainable wild management:** Allelopathic applications such as Straw mulching provide sustainable weed management. It also helps in reducing negative impact of environment on agriculture. Straw mulch can improve the organic matter in the soil and increase its fertility. Allelo chemicals are called ‘Natural herbicides’.\n* **In reduction of Nitrogen leaching and Environment pollution:** Nitrogen leaching is a severe ecological problem due to water pollution. In recent years studies have proven that Nitrification Inhibiting Substance (NIS) produced by plants can reduce the emission of N2O, improve the utilization rate of nitrogen fertilizer and reduce pollution to the environment.\n* **Plant-animal/insect interactions:** Allelo chemicals may variously act as feeding attractants or repellents, have hormonal effects on the insects or provide the insects with a useful defense mechanism against predation.\n* Many border plants are used in this manner around fields and gardens to keep undesired animals away.\n\nStudies on allelopathy in crops and weeds have been developed in the past few decades and the use of allelopathic crops in crop rotation, cover crops, green manure, inter cropping etc has become a reality.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**2. Clarify how mid-eighteenth century India was beset with the spectre of a fragmented polity? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The first half of the eighteenth century witnessed decline and disintegration of the mighty Mughal Empire and rise of virtually independent regional powers. Lack of strong central authority and emergence of regional power weakened the political structure that led to rise of foreign power.\n\nFactors that could be considered to play potent role in fragmented polity were–\n\n* The Mughal court saw a host of weak emperors in succession, emperors who were incapable to command the glorious empire and would rather indulge in wasteful extravagance of pomp and show. Courtrooms became kingmaker’s ground for treachery and war of succession became recurrent.\n* A number of powerful kingdoms such as Bengal, Avadh, Hyderabad and Mysore arose and became virtually independent from the Mughal Empire.\n* The weakened Mughal Empire was challenged by Marathas time and again. Marathas captured vast swathes of territory in northern and central India.\n* The remaining illusion of continued domination of Mughal power was shattered by Nadir Shah’s (Shah of Persia) invasion of India in 1739.\n* Afghan ruler Ahmad Shah Abdali also made frequent inroads into Punjab and finally took over Delhi in 1756-57. Marathas, who were considered as only contender to fill the power vacuum in Delhi, were defeated by Abdali's forces in the Third Battle of Panipat (1761). The war didn’t decide who will rule India but who would not.\n\nAfter these series of events, the Mughal Empire ceased to exist as an all-India empire in practice. The British took advantage of the entire situation. They defeated the forces of Bengal in Battle of Plassey and finally combined forces of Bengal, Awadh and Mughal were crushed in Battle of Buxar.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q3",
      "serial_no": "3",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**3. Why did the ‘Moderates’ fail to carry conviction with the nation about their proclaimed ideology and political goals by the end of the nineteenth century? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The moderates were not against the British rule per se and had strong belief in sense of justice and goodness of the British rule. They pursued the policy of gradualism and constitutionalism. Constitutional reforms, administrative re-organisation and protection of civil rights were high on agenda and methods of prayers, petition and protest were followed.\n\nModerates met limited success in later stages due to various reasons–\n\n* The political jargons used by the moderates were alien to uneducated masses. There was also lack of political faith in the masses. Thus people largely remained aloof.\n* It was gradually realised that the British didn’t concede to any of the major demands of the moderates.\n* Indian Council Act 1892 was criticised. Moves such as further amplification of repressive laws under IPC and reduction in number of members in Calcutta Corporation didn’t go down well with progressive elements in INC.\n* Political ideologies of the moderates were blamed to be inefficient. Methods followed by moderates were described as political mendicancy. The result was emergence of a more militant school of thought.\n\nHowever, the role of moderates can also not be negated. They were first to create national awakening among Indians and prepared a solid ground for mass oriented national movement at later stages that followed.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**9. In the context of the diversity of India, can it be said that the regions form cultural units rather than the States? Give reasons with examples for your view point****. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "India has been a country of multiple diversities like linguistic, religious, and cultural diversities since ancient times. After independence, various demands of reorganization of states on the basis of various aspirations comprising of cultural similarity, linguistic identity and others emerged from different parts of India. Though the government reorganized various states and also formed new states but cultural units have been intact in India till this day.\n\n* Recently Chhath parv has been celebrated in Purvanchal region, which comprises the eastern end of Uttar Pradesh and western end of Bihar, where Hindi-Urdu and its dialects Awadhi and Bhojpuri are the predominant language.\n* Population living in green revolution area that comprises Punjab, Haryana and west Uttar Pradesh practices nearly same traditions and represents a single cultural unit.\n* Influence of Dravidian culture can be seen across all South Indian states, food habit of people living in these states is similar, wedding rituals are same.\n* North eastern region comprising 8 states represents as a single cultural unit in terms of their traditions.\n* Rice fish culture has also been practiced across all coastal regions in different states.\n\nIt shows that cultural units in India are not necessarily concurrent with states and beyond the boundaries of formal division of states.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q13",
      "serial_no": "13",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**13. Highlight the importance of new objective that got added to the vision of Indian independence since the twenties of the last century. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The ‘twenties of the last century’ was the watershed moment for the Indian national movement. With emergence of new scenarios and actors the movement became a true mass movement.\n\nThis decade started on the backdrop of Russian Revolution and emergence of communism as an alternative to Imperialism which presented a new ray of hope for the colonies undergoing struggle for independence. With the rise of socialists and communists in India, the issues of peasants and workers became an important objective of Indian independence.\n\nMahatma Gandhi returned to India in 1915 and with some initial experiments on limited scale in Champaran, Kheda and Ahmedabad, finally in the early twenties he was all set to take the leadership of Indian National Movement and this changed the vision of Indian independence.\n\n* Starting with Non Cooperation Movement in the early twenties, he led Civil Disobedience Movement in early thirties and finally Quit India in early forties. In these years, Indian national movement transformed from the movement of few middle class elites, to a mass movement.\n* The objectives of Independence became Swaraj and Sarvodaya where the fruit of independence was to be tasted by the last man standing in the row and not mere the transfer of power from one set of white elites to another Indian elites.\n* After twenties the goal of political independence was gradually broadened by the constructive programmes where the issues of untouchability and Hindu- Muslim unity were also considered as important goals.\n* Fundamental Rights and Economic Policy was shaped during Karachi resolution of 1931.\n\nHence the vision of Indian independence was broadened in scale and scope after the twenties of last century.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q1",
      "serial_no": "1",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**1. Safeguarding the Indian art heritage is the need of the moment. Discuss. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "India has a vast basket of diverse art and cultural heritage which need institutional support and encouragement to address areas critical for their survival and preservation.\n\nWe need to preserve our art heritage because of the following reasons.\n\n* Presently, many Indian art forms are on the verge of extinction such as Manjusha painting of Bihar, traditional art of Puppetry, Parsi embroidery, Naga craft, Dhokra handicraft, etc., which need protection and preservation.\n* India has a unique identity in the world for its art and culture which represents Indian civilization on world platform and if it vanishes the uniqueness of India will get affected.\n* For many tribal communities, art and craft is the source of income.\n* This is also the source of attraction for tourism which contributes to economic development of the country.\n* Art heritage also represents “unity in diversity” of India and builds a bridge between people living abroad to get connected with their native country.\n* Art and culture is also a part of soft power in world politics.\n\nGovernment has started many initiatives to preserve the rich art heritage of the country, such as, Scheme for Conservation of Wall Painting (1996-97), Ek Bharat Shresth Bharat programe, Tribal haats, GI tag to the local products, e-haat, etc. Apart from strict implementation of such programmes, Government should provide financial assistance to strengthen regional and local museums, preserve art heritage through virtual media, and promote local paintings on products like wallet, mobile cover, pillow cover, etc.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**2. Assess the importance of the accounts of the Chinese and Arab travellers in the reconstruction of the history of India. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Reconstruction of Indian history of the ancient and medieval era is a daunting task owing to lack of chronological records, and subjectivity in the interpretation of archaeological and literary sources.\n\nIn this context, accounts of foreign travellers, who were eye witnesses to the events that occurred at that time, become an important source to corroborate other sources of history.\n\n**Chinese Accounts**\n\nAccounts of Fa-hien, Hsuan Tsang, and I-tsing have proved to be a valuable source of information on the Gupta period and the years following the end of Gupta rule. They provided vital information about:\n\n* **Socio-economic conditions in India -** For example, Fa-hien mentions about the Chandalas (untouchables) living outside the village. This shows that untouchablility was prevalent in the society as early as 5th Century AD.\n* **Existing political conditions -** For example, Hsuan Tsang’s account shows that during Harsha’s reign (7th Century AD), Pataliputra was in a state of decline and on the other hand, Prayag and Kannauj in the doab had emerged important.\n* **Nature of Buddhist doctrines, rituals, and monastic institutions in India -** For example - Hsuan Tsang and I-tsing provided vivid accounts of Nalanda.\n\n**Arab Accounts**\n\n* Arab travellers such as the merchants - Sulayman, Abu Zaid, etc. provided vivid accounts on Indian culture and science, which are valuable sources for the study of early medieval Indian history.\n* Abu Zaid noted that most Indian princes while holding court, allowed their women to be seen unveiled – highlighting that there was no system of purdah (veiling) in upper class women in early medieval India.\n* Arab travellers also provide information about the socio-economic condition through their description of trade contacts and the wealth which was exclusively derived from the trade with India.\n* Arab travellers of the period like Al-Beruni and Ibn Battuta had direct personal contacts with the people of Indian subcontinent which enabled them to give detailed first hand information in their accounts about the economic, social and other activities of the people.\n\nThough there are issues associated with the reliability of the accounts provided by these travellers owing to their personal biases, still they are key sources for finding out the missing links in the reconstruction of Indian history.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q3",
      "serial_no": "3",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**3. Throw light on the significance of thoughts of Mahatma Gandhi in the present times. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Gandhian thoughts underline the most humane way to resolve many of the problems that plague our times, as can be ascertained from the list given below:\n\n|  |  |\n| --- | --- |\n| **Gandhian Thoughts** | **Significance** |\n| Non-violence | The ideal of non-violence needs to guide the approach of individuals as well as nations and world-organizations, as violence initiates a vicious circle of repression and injustice. |\n| Satyagraha | The moral framework of resistance which marked satyagraha is especially pertinent in the times when to be quiet or to collaborative seem to be the only dominant choice in face of any injustice. |\n| Swaraj | In the age of markets laden with products based on generating and gratifying instinct of social approval and when public-imagination is becoming increasingly vulnerable to demagogues, the idea of Swaraj which had economic, social, spiritual and political connotations continues to be significant. |\n| Eliminating Untouchability | Caste disrimination has still not ceased to be a feature of Indian-public life. Gandhian ideal of social consciousness to eliminate it needs to be taken forward. |\n| Women Emancipation | With glass-ceiling still far from being shattered in the public sphere, the Gandhian thought of women emancipation continues to hold relevance. |\n\nGandhian thoughts about compassion, punctuality and sanitation are the other ideals that continue to hold value in our times marked by strife, procrastination in public and private lives and casual attitude towards hygiene.\n\nUltimately, all ideals and thoughts of the Mahatma were reached by him via a process of life long experimentation with truths and this makes Gandhian thoughts most significant in what is also being called by a few as post-truth era.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**11. The Bhakti movement received a remarkable re-orientation with the advent of Sri Chaitanya Mahaprabhu. Discuss. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Indian social set-up during the medieval period was based on Brahmanism characterized by rigid caste division, rituals and methods of prayer. Bhakti Movement was a reformative movement characterized by intense devotion or love for God. The movement focused to reform Indian society which was shadowed by Brahmanical dominance.\n\nBhakti Movement started from South India in the form of Vaishnavite and Shaivaite sect, commonly known as Alvars and Nayanars respectively. Early 16th century was marked by rise of Bhakti Saint Sri Chaitanya Mahaprabhu in Eastern India. He was a Vaishanavit Saint and an ardent follower of Lord Krishna. According to his followers, he was an incarnation of Lord Krishna.\n\nChaitnaya Mahaprabhu preached love, compassion, and non-violence. Though he was a Brahmin, he condemned caste system and emphasized on equality for all. According to him true worship lay in love and devotion. Bhakti Movement is known to transcend the practice of strict rituals and religious practices. Chaitanya Mahaprabhu is known to have revolutionized and re-oriented Bhakti Movement, giving it impetus through simplicity in teachings, propagating Bhakti ideas through his disciples, instructing them to write books, and overall making it a mass movement\n\nThe very first mandate by Sri Chaitanya Mahaprabhu to his disciples was to go to each house and ask people to chant ‘Hari Bol’. By this, he propagated amongst people the practice of ‘Nama Simaran’ as a mode of devotion and love for God. Further, he propagated his message of ‘Hari Bol’ through ‘Sankirtan Mandali’. In these Mandalies, devotees used to chant, sing and dance. Through Sankirtan, chanting of Hari Bol and combined dance and chant, Mahaprabhu brought people from different caste, creed, religion and sex together.\n\nThe message of Chaitanya Mahaprabhu or Gaudiya School of thought is now propagated through ISKCON Movement across the world. It has participation of devotees from around the world. In other words it can be said that Sri Chaitanya Mahaprabhu not only revolutionized Bhakti movement but also universalized it.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q13",
      "serial_no": "13",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**13. Why indentured labour was taken by British from India to other colonies? Have they been able to preserve their cultural identity over there? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Indentured labour was a system of bonded labour that was instituted following the abolition of slavery throughout British Empire in 1833 as newly free men and women refused to work for low wages on sugar, tea plantations and rail construction projects in British colonies of West Indies, Fiji, Mauritius and Ceylon.\n\n* In 19th century people were recruited as indentured labor from regions like Eastern Uttar Pradesh, Bihar, Central India and dry districts of Tamil Nadu as these regions experienced many changes such as -\n* Decline of cottage industries, rising land rents and clearing of land for mines and plantations.\n* All this affected lives of poor as they failed to pay their rents and became deeply indebted – forcing them to migrate in search of work to escape poverty and famine.\n* India’s large population provided the British Empire with a steady source of work force. Thus, British exploited both the vulnerability and readily available large population.\n\nOnce placed in British colonies, festivals such as Muharram, Holi served as a placental link to preserve their cultural Identity.\n\n* In Trinidad, the annual Muharram procession was transformed in to carnival ‘Hosay’ for Imam Hossain drawing a large crowd.\n* The protest religion of RASTAFARIANISM popularized by Bob Marley reflects social and cultural links with Indian migrants to Carribean.\n* Chutney music became popular in Trinidad.\n* Bollywood kept alive the cultural identity among indentured labor.\n* A rigid caste system of Indian society melted as indentured people identified more with ‘Indianness’, promoting fraternal feeling.\n* Initiatives such as ’Know India Programme’ are conscious efforts by Government of India to ensure a continuum of new generations with Indian ethos.\n\nHowever, the Sri Lankan 13th Amendment to constitution is reminder that the quest to preserve their culture continues in some places. By and large, indentured labour have been able to retain their cultural heritage and renew their links with India both as potent act of resistance and a powerful affirmation of their distinctness.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_4_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**6. (b) “Anger and intolerance are the enemies of correct understanding.” – Mahatma Gandhi. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Anger and intolerance are antithetical to reasons and correct understanding. They cloud our judgment and affect peace of mind. It is not possible to think clearly and make the right decisions if one is angry or intolerant.\n\nAnger makes a person lose calmness and forces them to take hasty decisions which may not be correct. Anger makes a person to lose patience which drives him towards intolerance. Angry person is a constantly stressed person; such a person cannot think with clarity.\n\nBalanced decision making, social progress and development is made possible through leaders who have a cool head on their shoulders and not by people who are easily irritated or who are not tolerant of others, conflicting viewpoints, ways of living and thinking or world views.\n\nToday, it is common to find people and leaders losing steadiness of mind when faced with stress. Angry and intolerant people are often bad decision makers. The World Wars and other wars in history were often fomented by people who easily grew angry and intolerant (such as Hitler who is responsible for millions of murders).\n\nCorrect understanding of a situation requires mental composure and equanimity. Angry and intolerant people cannot differentiate between correct and incorrect understanding.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_4_Q13",
      "serial_no": "13",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**6. (c) “Falsehood takes the place of truth when it results in unblemished common good.” – Tirukkural (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Tirukkural, the classic Tamil text deals with everyday virtues of an individual. This couplet implies that lie could be classed with truth if it blesses someone with good.\n\nEven falsehood has the nature of truth, if it confers a benefit that is free from fault. In other words, a falsehood such as a lie, has the same respect as a truth if it has benign goals resulting in unblemished common good.\n\nIn the present context, it could mean that some actions may appear bad manifestly but they could be latently good if they are fully beneficial for the public.\n\nIt could be analyzed in the light of heroes in films or everyday life breaking some rule to get the right done for some social good. Such a falsehood or illegality is equal to truth because it brings flawless (unblemished) common good. A help given to exploited labourers may appear illegal given that they are legally tied to the zamindar or the money lender but such an action is actually truthful because it brings untarnished common good.\n\nA ‘free from fault’ or ‘free from blemish’ action gives even a falsehood the nature of truth because it actually results in blessings. The overriding goal is the common good.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**2. The 1857 Uprising was the culmination of the recurrent big and small local rebellions that had occurred in the preceding hundred years of British Rule. Elucidate.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "### Introduction\n\n* “The Indian Rebellion was not one movement, … it was many.” **C.A. Bayly** brings to our notice what **Eric Stokes** has written in his book ‘The peasant armed: the Indian Revolt of 1857’.\n* During the first century of British rule, there were a series of uprisings which **Kathleen Gough** has called **“restorative rebellions’’** as they were started by disaffected local rulers, Mughal officials or dispossessed zamindars.\n* The century before 1857 witnessed more than 40 major rebellions apart from hundreds of minor ones. However, these were local in character and effects & isolated from each other because each rebellion had a different motive.\n\n### Peasant Uprisings\n\n* **The Faqir and Sanyasi Rebellions, Bengal & Bihar (1770-1820s):** These were widely recurrent confrontations with almost 50,000 participants involved at the height of insurgency.\n* **The Revolt of Raja Chait Singh, Awadh (1778-81):** Primary goal was to restore the existing agrarian relations and it kept recurring till 1830s.\n* **Polygar Rebellions, Andhra Pradesh (1799-1805):** Polygars (feudal lords appointed as military chiefs) were joined by peasants against Company’s tactics and the rebellion reached a big scale before it was oppressed.\n* **Paika Rebellion, Odisha (1817):** An armed rebellion under the leadership of Bakshi Jagabandhu against the Company’s rule.\n* **Fairazi Movement, Eastern Bengal (1838-1848):** First ever no-tax campaign led by Shariatullah Khan and Dadu Mian. It was local in nature and kept on recurring till 1870s.\n\n### Tribal Uprisings\n\n* **Bhil Uprisings, Khandesh (present day Maharashtra & Gujarat), (1818-31):** Bhils rebelled against the British occupation of Khandesh but were crushed in 1819 but the situation remained unsettled till 1831.\n* **Kol Uprising, Chhota Nagpur & Singhbhum region, Bihar & Orissa (1831-32):** Plunder and arson were the chief mode with negligible killings but had a major impact in the region.\n* **Santhal Uprising, Eastern India (1855-56):** The most effective tribal movement which spread rapidly covering areas of Bihar, Orissa and Bengal against British infiltrating policies.\n\n### Conclusion\n\nThe century long economic exploitation, political subjugation, discriminatory policies, religious interference and suppression of uprisings finally culminated in the revolt of 1857 giving a platform to the discontented leaders of the earlier rebellions to raise voices against the Company.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**8. What makes the Indian society unique in sustaining its culture? Discuss.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The notion of *accommodation and assimilation* has been the key feature of Indian society. Since ancient times, India has accommodated different elements of society without letting them lose their separate identityas Jawahar Lal Nehru writes in *The Discovery of India-*Indian Society and Culture “*is like some ancient palimpsest on which layer upon layer of thought and reverie* had been inscribed, and yet no succeeding layer had completely hidden or erased what had been written previously”.\n\n* In course of time, India has evolved its own culture which is *eclectic,externally receptive and heterogeneous*.\n* The essence of Indian society lies in harbouring diverse and distinct identities, ethnicities, languages, religions and culinary preferences. History stands witness to the fact that the societies that have struggled to hold differences were shattered in such an attempt.\n\n**However, Indian society succeeded and is unique because of its various peculiarities:**\n\n* **A Cosmic Vision:** The framework of Indian culture places human beings in the centre of the universe, as a divine creation-which celebrates Individuality and differences of opinion in the society.\n* **Sense of Harmony:** Indian philosophy and culture tries to achieve an innate harmony and order in the society.\n* **Tolerance:** In India, tolerance and liberalism is found for all religions, castes, communities, etc. Indian society accepted and respected Shaka, Huna, Scythians , Muslim, Christian,jews and Zoroastrians. Rulers like Ashoka, Akbar have patronized various religions and ensured that there is peaceful co-existence of religions.\n* **Continuity and Stability:**The light of ancient Indian culture life is yet glowing. Many invasions occurred, many rulers changed, many laws were passed but even today, the traditional institutions, religion, epics, literature, philosophy, traditions, etc. are alive.\n* **Adaptability:** Adaptability is the process of changing according to time, place and period. Indian society has shown fluidity and has adjusted itself with changing times.\n* **Caste System and Hierarchy:** Indian Society has evolved systems of social stratification, which in the past helped in accommodating outsiders,but concomitantly it has also been the reason for descrimination and prejudice.\n* **Unity in diversity:** Despite inherent difference Indian society celebrates unity in diversity which reflects in modern India’s founding principles and constitutional ideals.\n\nIn recent times,Indian society has seen surge on multiple divisive issues like communalism,casteism,economic disparity and ethnic violence,which pose a serious challenge to the time- tested ethos of our society.\n\nDespite this,India remains a diverse country, a bewildering mosaic of communities of all kinds; our peculiar societal genius is to fashion a form of coexistence where diversity can flourish and find its place. Principle of Sarva Dharma Sambhava (equal respect for all religions) is rooted in India’s tradition and culture.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**18. Do we have cultural pockets of small India all over the nation? Elaborate with examples.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "India has a lot of diversity to offer to the people of this world and to her own people as well. The oldest civilisation has had ample time and experiences to accumulate the cultural practises of everyone who came here with their respective motives whether it was tourism, education, plunder, exploitation or to rule.\n\n* Vast resources attracted people and foreign rulers in our past and they keep attracting people in the present as well. People from smaller cities migrate to urban centres and metropolitan areas in search of employment, education etc and they eventually settle down there. When such diversity of people pools in together at a relatively smaller place, it becomes a cultural pocket.\n* **The basic idea is that within a bigger, overarching culture, another smaller and different culture is developed and sustained.** The **metropolitan areas** like National Capital Region of Delhi, Mumbai, Kolkata, Chennai, Bengaluru or **coastal industrial hubs** like Surat, Kochi, Visakhapatnam or **religious centres** like Ajmer, Amarnath, Chardhams etc can be taken as examples of hubs of such cultural pockets within India.\n* **Metropolitan areas** represent a culture of their own which is entirely different from each other and can be seen in the banter between Delhi and Mumbai. But they are well diverse within themselves as well depending upon the time and place. The **Ganpati Utsav** and those who celebrate it, form a cultural pocket within Mumbai for ten days. It applies to other places as well. In Delhi, a cultural pocket is formed by the political, defence personnel and the patriotic citizens around the **Independence Day** celebrations.\n* **Multi Storey housing societies** in urban areas are also an example of cultural pockets. Diverse people live in the same building exchanging food habits, traditions, indegenous culture and they celebrate all festivals together as if they are a big joint family. Same applies to **multinational organisations and corporate offices** as well where workers represent the diversity of India.\n* **Higher educational institutes like universities and colleges** provide us with the same scenario. Students from every corner of the nation irrespective of their hometowns, race, caste, class or any other differences sit and study in the same classroom and take part in extracurricular activities and college festivals together.\n* It is very clear to us that India has uncountable cultural pockets all over the nation with different set of values and outlooks towards life enriching Indian cultural heritage and validating the fact that **India is indeed one of the Cultural Superpowers** of the world.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_3_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**5. How was India benefited from the contributions of Sir M.Visvesvaraya and Dr. M. S. Swaminathan in the fields of water engineering and agricultural science respectively?**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The British rule in India neglected modernisation of Indian agriculture and little was done to improve irrigation system. After independence, India did not have enough to feed its burgeoning population and it was forced to subsist on *\"ship to mouth\"* existence.\n\nAt these junctures,two personalities-Sir M Visvesvaraya and MS Swaminathan- emerged who revolutionised their respective fields of knowledge, contributing enormously to India’s development.\n\n### Sir M. Visvesvaraya’s contribution in the field of water engineering\n\n* He is remembered as India’s most prolific civil engineer, dam builder, economist, statesman, and can be counted among the last century’s foremost nation-builders.\n* He played an instrumental role in the construction of the Krishna Raja Sagara Lake and dam in 1924. This dam not only became the main source of water for irrigation for the nearby areas, but is also the main source of drinking water for several cities.\n* Visvesvaraya was, among other things, responsible for the building and consolidation of dams across the country. He invented the Block System -automated doors that close in the conditions of overflow, and also designed Hyderabad’s flood management system.\n* He is recognised for his brilliance and creativity in harnessing water resources, designing and constructing dams and bridges, and revolutionising the irrigation system in India.\n* Due to his outstanding contribution to the society, Government of India conferred ‘Bharat Ratna’ on this legend in the year 1955.\n\n### Dr. M.S. Swaminathan’s contribution to agriculture science\n\n* A plant geneticist by training, Professor Swaminathan’s contributions to the agricultural renaissance of India have led to his being widely referred to as the scientific leader of the green revolution movement.\n* Recognized worldwide for his basic and applied research in genetics, cytogenetics, radiation and chemical mutagenesis, food and biodiversity conservation, he conceptualized *ever-green revolution* movement in agriculture.\n* Swaminathan is the visionary who took India from the bondage of ‘Ship to Mouth’ existence to the freedom of *‘Right to Food’* through home grown food.\n* Apart from serving as head of various national and international institutions, he headed the **National Commission on Farmers (NCF)** constituted in 2004 to address the nationwide calamity of farmer suicides in India.\n\nIndia needs to adhere to the visions of these two men, especially when our agrarian challenges are mounting due to erratic rainfall, cycles of floods and droughts, unsustainable practices and other endemic issues.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_3_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**15. How is the Government of India protecting traditional knowledge of medicine from patenting by pharmaceutical companies?**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Traditional medicine comprises medical aspects of Traditional Knowledge (TKs) that developed over generations within various societies before the era of modern medicine. India has diverse set of traditional practices arising out of Ayurveda, Siddha, and diverse Tribal Practices that have developed over generations.\n\n### Issues involved in the protection of Traditional Knowledge\n\n* **Non-codification of TKs:** Non-codified traditional knowledge are vulnerable to lose their relevance with the influences of modern medical practices.\n* **Patenting of TKs by Biotechnology companies:** Various cases of Bio-piracy were raised in India where Biotech companies used the Traditional Knowledge to develop products and issued patents. E.g. Jeevani sports drug was derived from traditional knowledge of Kani tribe.\n* **Access and Benefit Sharing from TKs:** Traditional knowledge is also often held collectively by communities, rather than by individual owners. This makes the benefit sharing difficult.\n* **Inadequate International Regimes for protection of TKs:** Due to the community nature of traditional knowledge, it is not recognized in international laws explicitly.\n\n### Steps of Government To Protect TKs\n\n* **Legal Steps:**\n  + **Biological Diversity Act:** It contains the provision for fair and equitable sharing of the benefits arising out of the utilization of genetic resources.\n  + **Forest Rights Act 2006:** It provides for community rights over forest resources. It can help in the protection of traditionally owned knowledge and practices. It also protects and promotes the livelihood of tribal community which is often based on their knowledge system and forest produce.\n  + **The Geographical Indication of Goods (Registration and Protection) Act, 1999:** It provides a collective right to the holders of the traditional knowledge associated with a particular geographical area.\n* **Institutional Steps:**\n  + **AYUSH Ministry:** To cultivate education and research in Ayurveda, Yoga, Naturopathy, Unani, Siddha, Homoeopathy, Sowa-Rigpa (Traditional Tibetan medicine), and other indigenous medicine systems.\n\n### Policy Measures, Initiatives and Projects\n\n* **Traditional Knowledge Digital Library (TKDL):** It is a repository of traditional knowledge, especially of medicinal plants and formulations used in Indian system of medicine.\n* **National Ayush Mission:** It promotes AYUSH medical practices, quality enhancement and mainstreaming these practices to our healthcare system. It also promotes the education and awareness of AYUSH medicine system.\n* **Research Centres and National Institutes** have been created across India in the fields of Ayurveda, Unani, Homoeopathy, Siddha.\n* **India has also signed agreements** with the United Kingdom Intellectual Property Office and other countries’ patent office like USA etc to prevent the grant of invalid patents by giving patent examiners at International Patent Offices access to the TKDL database for patent search and examination.\n\nThe interest in traditional medicines is growing rapidly due to the increased side effects, adverse drug reactions, and cost factor of modern medicines. So, awareness and development of various traditional knowledge practices should be done along with a focus on their mainstreaming so as to reap its potential of great livelihood support particularly for the tribals. Also, a sui-generis system should be developed that can recognize the diverse nature of Traditional Knowledge and provide them with adequate legal and commercial protection.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_4_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**6. (b). “A man is but the product of his thoughts. What he thinks he becomes.” — M.K. Gandhi**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Actions of a person are largely determined by her thought process. One’s thoughts are the first engagement points with the society. Thoughts impact behaviour as well as the attitude, while moulding the actions. It therefore, becomes very important for the thoughts to be fixated to a compass of morality and conscience. Ethical behaviour and regulation of actions emerge from ethical thought process.\n\nThoughts or reflections on experiences open up possibilities for the choices of action to be taken. An understanding and awareness of one’s thoughts and feelings, or emotional intelligence can help in regulating her actions accordingly. For example, while thoughts of kindness and compassion can create more empathetic individuals, thoughts of violence and anger can contribute to the making of criminals in society.\n\nTechnological advancements like Artificial Intelligence and Big data invoke new questions around ethics in the present day society. Individuals’ thinking has become more self centred under the impact of increasing individualism and consumerism, this has further led to the individuals’ detachment from the community and society. There has also been an increased desire from the market and the state for the control over people’s thoughts, behaviours and actions. This is not only in violation of a person’s right to speech and expression but also reduces the individual’s tendency to question and to think critically.\n\nIt is in these times that people’s ability to think freely in a society should be nurtured. Societies need to emphasise more on the education as inculcation of critical ethical thinking can produce individuals who act ethically, thereby impacting society, nation and the world at large.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_4_Q13",
      "serial_no": "13",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**6. (c). “Where there is righteousness in the heart, there is beauty in the character. When there is beauty in the character, there is harmony in the home. When there is harmony in the home, there is order in the nation. When there is order in the nation, there is peace in the world.” — A. P. J. Abdul Kalam**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "**A.P.J Abdul Kalam** had highlighted the importance of quality of righteousness through this quote and had given a beautiful connectivity between heart, character, nation and the world.\n\n* **Righteousness** is the quality of being **morally right** and **justifiable** which forms the basis for any peaceful and prosperous society. Every religion focuses on the quality of righteousness as a **means to an end**.\n  + **For example:** In Hindu mythologies and texts, **the path of righteousness i.e dharma** is regarded as the ideal path or ultimate duty of every human being.\n* By the above quote, he lays down the **path for enabling peace** in a society. By focusing on individual **rejuvenation** as the locus of all activity, he aims to reform and integrate the whole society.\n  + **For example:** In the 3rd century BC, **Ashoka** promoted the **code of Dhamma** in his empire, which was the set **ideal social behaviour** for promoting peace and enabling prosperity in the kingdom.\n* The contemporary society has been seen digressing from the path of righteous behaviour and has shown more inclination toward the materialistic way of life, which has led to the eruption of several social and societal problems.\n* If individuals follow the righteous path, they are more likely to spread happiness to others and succeed in their personal endeavours and will contribute to the upliftment of their household status, which indirectly will contribute to the happiness and upliftment of whole society, and then many social problems like crime, corruption, mob lynching etc can be eliminated from the society.\n* Similarly, the more prosperous society will contribute to a more prosperous nation.\n  + **For example:** Terrorism has beacame a severe menace in many West Asian countries and threatening the safety and security of whole world. Focus on enabling the order of righteous path in these nations will contribute to maintaining peace in the whole world.\n\nRighteousness in multiple dimensions in the society with the indomitable spirit is essential for realizing the vision of **\"Vasudhaiva Kutumbakam\"**.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q1",
      "serial_no": "1",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**1. The rock-cut architecture represents one of the most importantsources of our knowledge of early Indian art and history. Discuss.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Rock-cut architecture is the art of moulding a structure by chiselling it out of solid natural rock. Some conspicuous rock-cut structures of ancient India include Chaityas, Viharas, temples, etc.\n\n### Rock-cut architectures: Emblem of Indian art\n\n* The Mesolithic period saw the first use and modifications. The overhanging rocks of natural caves were embellished with petroglyphs or rock-cut designs. Example: Bhimbetka.\n* In the 3rd century BCE, rock-cut caves were constructed by the Mauryans for the Avijika and Jain ascetics in the Barabar and Nagarjuni hills of Bihar. The caves are known for the bow-shaped arches.\n* The Gupta and Vakataka period (3rd century CE - 6th century CE) was perhaps the golden age for rock-cut architecture. During this period, the designs of rock-cut architectures became more elaborate and aesthetics more pronounced. A profuse variety of decorative sculpture, intricately carved columns and carved reliefs mark the rock-cut architecture of the period. Example: Ajanta Caves.\n* The Pallava architects started the carving of rock for the creation of monolithic copies of structural temples. Example: Panch Ratha of Mamallapuram, the five structures shaped as rathas or chariots chiselled out of a large block of stone of granite dates back to the 7th century.\n* The Kailash temple, constructed by Rashtrakutas at Ellora, provides a singular example, excavated from the top down rather than by the usual practice of carving into the scarp of a hillside.\n\n### Historical significance\n\n* The rock-cut architectures are mostly religious but also reflect an important connection between religion, commerce, and society. The stories represented on the cave walls or through sculptures are valuable sources of historical information.\n* Buddhist monks created their cave hermitages near trade routes. The Buddhist missionaries employed the caves as shrines and shelters conforming to the religious concepts of asceticism. Traders often travelled the trade routes in the company of the Buddhist missionaries.\n* The architecture also reflects the changing realities of the subcontinent. The themes of rock-cut architectures changed as Buddhism weakened in the face of a renewed Hinduism during the 6th-8th century CE.\n* The Buddhiststories were replaced by Hindu Gods and mythologies. Many cave temples, developed under the patronisation of southern Indian Hindu kings were dedicated to Hindu gods and goddesses.\n\nRock-cut architectures occupy a very important place in Indian history. Their significance has been rightly underlined as many rock-cutstructures have been incorporated in the UNESCO world heritage list. Example: Ajanta caves, Group of Monuments at Mahabalipuram, etc.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**11. Indian philosophy and tradition played a significantrole in conceiving and shaping the monuments and their art in India. Discuss.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Indian philosophy refers to philosophical traditions which developed in the Indian subcontinent. It generally includes Hindu, Buddhist and Jain Philosophy, among others.\n\nArt is one of the cultural activities of man through which he reaches his ideas, values, feelings, aspirations and reactions to life. Hence the influence of philosophy on monuments and their art is inextricable.\n\nThe Monuments and their arts, from Asoka’s Pillars to Chola’s Brihadeshwara temple have been influenced by the contemporary and prominent philosophy and traditions. The early monuments have been dominated by Buddhism and Jainism while Hinduism began to influence from the Gupta period.\n\n* The Asokan Pillar, the Stupas have been influenced by the Buddhist philosophies depicting teachings, stories, symbols associated with Buddhism. The Chakra of Sarnath’s pillar symbolises Dharmachakrapravartana and the Chattra of stupas embodies the Three Jewels of Buddhism.\n* The ascetics belonging to Ajivika, Jainism, Buddhism required places for meditation. Rock-cut caves like Lomas Rishi, Ajanta or Ellora were carved out to provide a place of solitude for the monks and sages.\n* Engravings, paintings, or sculptures of theses caves depict the teachings of these philosophies. For example, the ceilings of Ajanta caves have paintings showing the life cycles of Buddha, Ellora caves contain images of 24 Jinas.\n* The works at the Jain temples include, in addition to the Jinas, carvings of gods and goddesses, yaksa, yakshi and human devotees. The cells of Jain viharas are small and plain, designed to observe rigorous asceticism by Jain monks.\n* From the Gupta period onwards, Hindu temple architecture began to evolve. Constructed mainly in three distinctive styles, Nagara, Vesara, and Dravida, the architecture and walls of Hindu temples are influenced and embellished with sculptures influenced from Hindu epics and mythologies.\n* The Khajuraho temple’s territory is laid out in three triangles that converge to form a pentagon to reflects the Hindu symbolism for three realms or trilokinatha, and five cosmic substances or panchbhuteshvara.\n* The Monolithic temples like Kailasha (8th century CE) at Ellora or Group of monuments at Mamallapuram (7th–8th century CE) have beep influenced by Hindu religion and mythology, telling stories from Shivapurana, Mahabharata, etc.\n\nThe Indian philosophy and traditions have been a predominant factorinfluencing the architecture and interiors of the monuments. But, the monuments were not solely shaped by philosophies and they have incorporated activities such as trade or cultural interaction.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**12. Persian literary sources of medieval India reflect the spirit of the age. Comment.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "With the arrival of Mughals, Turks and Afghans,the Islamic and Indian culture interacted and influenced each other. During the medieval period, Persian was the most popular language and it replaced Sanskrit in those parts where the Muslims ruled.\n\n**Persian littérateurs and literary sources reflecting the spirit of the age:**\n\n* **Amir Khusrau** is credited with prominent workslike **Panch Ganj, Matla-ul-Anwar, Shirin wa Khuarav, Laila wa Majnun, Aina-i-Sikandari and Hasht Bihisht.**\n  + He, for the first time, made use of Hindi words and idioms and wrote on Indian themes.\n  + In his ghazals, he employed alternate hem-stitches in Persian and Hindi.\n* **Shams Siraj Afif** wrote **Takih-Firoz Shahi** which is of immense value to understand the reign of Firoz Shah Tughlaq (14th century).\n  + Afif has given a detailed account of the policies of Firoz.\n  + The book talks about irrigation tax (1/10 of produce) paid by the cultivators who used waters from canals constructed by Firoz Shah Tughlaq.\n  + Firoz had a great liking forthe laying out of gardens, which he took great painsto decorate. He formed 1,200 gardens in the vicinity of Dehli.\n* **Khawaja Najm-ud-Din Hasan** wrote **Fawaid-ul-Faud** which records a conversation with the great saint Nizamud-Din Aulia.\n  + This work is considered a valuable document on Sufi philosophy because it containsthe discourses of Nizamud-Din Aulia in chronological order.\n* **Abu’l Fazl** is credited with writing **Akbarnama** and **Ain-i-Akbari**, the masterpieces depicting the Mughal era.\n  + Akbarnama is embedded with miniature paintings. Itis an importantsource to study Mughalstyle paintings. For example: “Emperor Akbar on Elephant Hunt” and “Ran Bagha crossing the River Jumna”. Paintings are also a source to understand the prevalent dress and fashion style.\n  + Akbarnama and Ain-i-Akbari provide a holistic picture of the policies adopted by Akbar for religious and social tolerance. For example, Akbar, with his Sulh-e Kul, wastrying to calm down the tension and drive the society into peace and harmony.\n  + Ain-i-Akbari also describesthe administrative system of the Empire as well as containsthe famous “Account of the Hindu Sciences”. It also deals with Akbar’s household, army, the revenues and the geography of the empire.\n* **Dara Shikoh,** son of Mughal Emperor Shahjahan, has been credited with translating many Hindu scriptures from Sanskrit to Persian.\n  + **Sirr-i-Akbar** is the Persian translation of Upanishads which he completed in 1657.\n  + Dara tried to find commonalities between Hindu and Islamic traditions. He also translated Bhagavad Gita into the Persian language.\n\nWith the coming of the Muslimsto the subcontinent, Persian, an Aryan tongue and sister language of Sanskrit, came to India, which isthe confluence of diverse faiths, languages and cultures and which has a tradition of adopting and blending and then producing a composite cultural unity in diversity.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q1",
      "serial_no": "1",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**1. Evaluate the nature of Bhakti Literature and its contribution to Indian culture.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Originally began in South India in the 9th century with Shankaracharya, the Bhakti Literature spread over all parts of India and by the 16th century and became a great spiritual force to reckon with, especially after the great wave made by Kabir, Nanak and Shri Chaitanya.\n\n**Nature of Bhakti Literature:**\n\n* Bhakti and Sufi supported each other. Various recitation of sufi saints found place in Sikhs’ religious canons.\n* Spread of Bhakti cult due to adoption of vernacular languages which was easy to be understood by masses.\n* It preached for removal of sectarianism and casteism. The Bhakti literature called for inclusion of castes and out-castes.\n\n**Contribution of Bhakti Literature:**\n\n* The Bhakti literature promoted the growth of vernacular language in different parts of the country.\n  + Bengali was used by Chaitanya and by the poet Chandidas, who wrote extensively on the theme of the love of Radha and Krishna.\n  + Shankaradeva popularised the use of the Assamese in the Brahmaputra valley in the 15th He used an entirely new medium to spread his ideas.\n  + Marathi reached its apogee at the hands of saints like Eknath and Tukaram.\n  + Other prominent saints like Kabir, Nanak, and Tulsidas contributed enormously to regional literature and language with their captivating verses and spiritual exposition.\n* Emergence of a new cultural tradition with the influence of Bhakti and sufism. Also emergence of new sects like Sikhism, Kabir panth etc.\n* Post-Vedanta ideas were explored by Madhvacharya through his Dvaitadvaita, by Ramanujacharya in his Vishishta Advaita etc.\n* As a literary movement, it liberated poetry from singing the praises of kings and introduced spiritual themes. From a style point of view, it introduced simple and accessible styles like vachanas (in Kannada), saakhis, dohas and other forms in various languages and ended the hegemony of Sanskrit metrical forms.\n\nThe ideas of Bhakti Movement continued to permeate the cultural ethos of the society through the enormous body of literature left by them. The congruence in their ideas not only saved us from the likely internecine conflicts but also built the spirit of tolerance.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**2. Trace the rise and growth of socio-religious reform movements with special reference to Young Bengal and Brahmo Samaj.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "When the British came to India, they introduced the English language as well as certain Western ideas. This led to the development of new Indian middle-class intelligentsia, where people like Raja Ram Mohan Roy, Ishwar Chand Vidyasagar, Dayanand Saraswati, etc. spread the ideals of liberty, social and economic equality, democracy and justice.\n\n**Brahmo Samaj and Raja Ram Mohan Roy:**\n\n* Raja Ram Mohan Roy is known as the father of Modern India’s Renaissance and a tireless social reformer who inaugurated the age of enlightenment and liberal reformist modernisation in India.\n* He founded Brahmo Sabha in 1828, whose main aim was the worship of the eternal God. However, it was against priesthood, rituals and sacrifices.\n* The greatest achievement in the field of social reform was the abolition of Sati in 1829.\n* He advocated the abolition of polygamy and wanted women to be educated and given the right to inherit property.\n* This led to the emergence of rationalism and enlightenment in India which indirectly contributed to the nationalist movement.\n* It was the forerunner of all social, religious and political movements of modern India.\n\n**Young Bengal and Henry Lui Vivian Derozio:**\n\n* Derozio joined the Hindu College of Calcutta as a teacher.\n* He promoted radical ideas through his teaching and by organising an association for debate and discussions on literature, philosophy, history and science.\n* He inspired his followers and students to question all authority.\n* Derozio and his famous followers, known as Young Bengal, were fiery patriots.\n* They cherished the ideals of the French Revolution (1789) and the liberal thinking of Britain.\n\nApart from attacking social evils like bigotry, superstition, untouchability, purdah system, sati, child marriage, social inequalities and illiteracy, the social and religious reform movements also helped in dealing with the racism perpetuated by the colonial rule. This eventually led to the development of nationalism against the British Government.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**9. Examine the uniqueness of tribal knowledge systems when compared with mainstream knowledge and cultural systems**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Indigenous people around the world have preserved distinctive understandings of their cultural experience that helps them in their survival. These understandings are called the tribal knowledge or aboriginal knowledge.\n\nTribal knowledge systems represent inter-generational wisdom passed on to the present times through centuries of experience and learnings. While similar characteristics can be seen in evolution of mainstream knowledge and culture, tribal knowledge systems are unique as:\n\n* **Proximity to Nature**: Tribal societies have contemporary knowledge of nature due to continued closeness to forests, flora and fauna. Mainstream societies have moved on to agricultural basis of society.\n* **Source of Knowledge**: Mainstream knowledge systems are based on questioning of ideas, science, rationality and evolution process. On the other hand**,** tribal methods are based on conservation of knowledge.\n* **Transfer of Knowledge:** Tribal knowledge is transmitted between generations through stories, songs, dances, carvings, paintings and performances, while mainstream knowledge is preserved in books and recordings.\n* **Type of Learning:** Tribal knowledge systems promote integrated learning for the community. Therefore, they believe in producing generalists. But in the mainstream society, knowledge and learning has been disintegrated into specialised subjects and these societies mainly focus on producing specialists.\n* **Equality**: Tribal knowledge systems are non-exclusionary and marked by equity. Mainstreams knowledge systems are full of barriers like cost of education, patent protections, social exclusion etc.\n\nNevertheless, tribal and mainstream societies are not mutually exclusive systems. Constant interaction and mutual dependence have enriched both.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**12. Bring out the constructive programmes of Mahatma Gandhi during Non-Cooperation Movement and Civil Disobedience Movement.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Gandhi’s comprehensive plan of national regeneration, which he named the constructive programme, aimed at establishing social order, based on truth and non-violence. Gandhi believed that foreign domination in India lived and prospered because of our negligence towards fundamental duties as a nation. Collective fulfilment of these duties can be referred to as the constructive programme.\n\n**Constructive programme during Non-Cooperation Movement and Civil Disobedience Movement:**\n\n* **Communal Unity:** According to Gandhi, communal unity does not merely mean political unity but should be an unbreakable unity of hearts. This was achieved during the Lucknow Pact 1916, whereby both the Indian National Congress and Muslim League joined hands against British rule.\n* **Removal of Untouchability:** Gandhi held that untouchability was a blot and curse upon Indian society. Gandhi endeavoured to abolish this evil. He founded ‘Harijan Sevak Sangh’ for the abolition of untouchability in 1932 after his Poona Pact.\n* **Khadi Making:** Gandhi presented Khadi as a symbol of nationalism, economic freedom, equality and self-reliance. Khadi takes the central place in the upliftment of the village economy, which eventually lead to the attainment of Gram Swaraj.\n* **New or Basic Education:** Gandhi’s concept of new education implies that nature, society and crafts are huge mediums of education. According to him, true education is that which draws out and stimulates the spiritual, intellectual and physical faculties of the children. This education ought to be for them, a kind of insurance against unemployment.\n* **Upliftment of Women:** In his mission of Swaraj, Gandhi needed the cooperation of women, kisans, labourers and students. It was only due to Gandhi’s efforts that women came out of their houses for the first time in history and participated in the Indian political struggle.\n\nIntegration of Indian society was perhaps more difficult than the achievement of freedom because, in this process, there existed a possibility of conflict between groups and classes of our own people. In this scenario, the Gandhian constructive role played a key role in nation building.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**20. How does Indian society maintain continuity in traditional social values? Enumerate the changes taking place in it.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The essence of Indian society lies in harbouring diverse and distinct identities, ethnicities, languages, religions, and culinary preferences. History stands witness to the fact that the societies that have struggled to hold differences were shattered in such an attempt.\n\n**The supreme social-cultural traditional values of Indian life have been the values of:**\n\n* **A Cosmic Vision: T**he framework of Indian culture places human beings in the centre of the universe, as a divine creation-which celebrates individuality and differences of opinion in society.\n* **Tolerance:** In India, tolerance and liberalism are found for all religions, castes, communities, etc. Indian society accepted and respected various religions and ensured that there is a peaceful co-existence of religions.\n* **Sense of Harmony:** Indian philosophy and culture try to achieve innate harmony and order in society.\n* **Continuity and Stability:** The light of ancient Indian culture life is yet glowing. Many invasions occurred, many rulers changed, many laws were passed but even today, the traditional institutions, religion, epics, literature, philosophy, traditions, etc. are alive.\n* **Adaptability:** It is the process of changing according to time, place, and period. Indian society has shown fluidity and has adjusted itself with changing times.\n* **Caste System and Hierarchy:** Indian Society has evolved systems of social stratification, which in the past helped in accommodating outsiders, but concomitantly it has also been the reason for discrimination and prejudice.\n* **Unity in Diversity:** Despite inherent differences, Indian society celebrates unity in diversity which reflects in modern India’s founding principles and constitutional ideals.\n\n**In recent times, Indian society has seen a surge in multiple divisive issues like:**\n\n* **Casteism:** Caste-based discrimination leads society to divide into artificial groups which sometimes even led to violence.\n* **Communalism:** The aggressive attitude of one community towards the other creates tension and clashes between the two. It poses a great challenge to democracy and the unity of our country.\n* **Nuclear Families:** The new trend of nuclear families with one or a maximum of two children has emerged in India. Due to this children are not able to get the presence of the elderly who plays a major role in instilling values among the younger ones.\n* **Gender Discrimination:** There is a need for India to closely examine the norms that allow violence and a broader pattern of gender discrimination to continue. A society that does not value women as much as men fail to reach its full potential.\n\nDespite all these reasons, India remains a diverse country, a bewildering mosaic of communities of all kinds. Our peculiar societal genius is to fashion a form of coexistence where diversity can flourish and find its place. The principle of “*Sarva Dharma Sambhava*” (equal respect for all religions) is rooted in India’s tradition and culture.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_2_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**10. “The USA is facing an existential threat in the form of China, that is much more challenging than the erstwhile Soviet Union.” Explain.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The last few decades have seen an exponential rise of China as a competitor of the US on the global stage. In the present scenario, the experts are debating on the cold war conditions prevailing between the two biggest economies of the world (US-China).\n\nAfter the Second World War, the US faced a challenge from the erstwhile USSR. While today the US is facing the same threat from China, it is not same as the erstwhile USSR:\n\n* In the last few decades China has become the manufacturing hub of the world. Its economy has grown at a rapid pace and forms a special knot in the global supply chain. This is opposed to the USSR, which had a crippled economy and could not compete with the US over the period.\n* The Soviet Union and the United States were hardly interdependent either economically or politically. Although there are divergences and disputes, China and the United States are the two largest economies in the world and share a wide range of interests, especially in the economic sphere. To illustrate, the US and China have a trade of over 500 billion with each other.\n* Today’s global economy is more integrated as compared to the cold war era. Even after two countries are not on good terms with each other, they are still dependent on each other.\n* In the face of internal and external problems, the Soviet Union often repelled, but China has constantly reformed. China outpaced the USSR in governance models and is now challenging the US as a global power.\n\nGiven the high degree of interdependence and the prevalence of globalisation, the so called cold war situation between the US and China may not result in a full-fledged war. Nevertheless, both the countries, in particular, and the global community, in general, must strive to keep the conflicts at minimum and avoid any situation that may precipitate into violent clashes.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q1",
      "serial_no": "1",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**1. How will you explain that Medieval Indian temple sculptures represent the social life of those days?**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "A **sculpture** is not only ornamental. To depict the **politics, culture, history, religion, rituals,** and **memorial homages** of the area, sculpture is utilized in a variety of circumstances. The work changes across time and space since it is a tactile creative form that exists in the same space as its audience. Sculptural forms, whether bronze busts, spectacular statues, or sophisticated stone carvings, represent accurate images and ideas from ancient cultures.\n\n* One of the most prevalent messages is that a sculpture communicates about a civilization’s belief in certain forms of religion.\n* During the early phase of **Buddhism**, Buddha is depicted symbolically through **footprints, stupas, lotus throne, chakra** etc. This indicates either **simple worship or paying respect** or at times depicts historicizations of life events.\n  + The Jataka stories also became equally important for sculptural decorations.\n  + The motif of the chakra becomes significant as a representation of the **Dhammachakra** in the entire Buddhist art.\n  + The wheel represents the Dharma, the teachings of the Buddha. In the center of the wheel are three swirls that represent the three jewels of Buddhism, which are the **Buddha (or the teacher), the Dharma (teachings of Buddha)**, and the sangha (the community).\n  + The **Dharmachakra** takes the **form of a wheel** to represent the **completeness of the Dharma.**\n* **The sculptures, carved panels,** and **open pavilion style temples of Gurjara-Pratihara** are well-known.\n* The most significant advancement in their **temple-building style** occurred at **Khajuraho**, which is now a **UNESCO World Heritage Site.**\n  + The design, structure, and placement of the building's components are symbolic and represent the **core Hindu values.**\n* The most important places in **Rajasthan** where sculptural activity continued to be in progress were **Vasantgarh, Devangarh, Palta, Osian, Dilwara, Chittor, Mandor etc.**\n* **The Gurjara Pratiharas** had a vast kingdom that embraced the territory of **Gujarat, Rajasthan, Uttar Pradesh.** Their rule in the 8th, 9th and 10th centuries saw a great cultural renaissance.\n  + **Mahishasuramardini in relief, Girigovardhana panel, Arjuna's penance or the Descent of the Ganga, Trivikrama Vishnu, Gajalakshmi and Anatasayanam** are the few prominent sculptures which represent the faith and belief of the society.\n* The **sculptural tradition** in **Gandhara** had the confluence of **Bactria, Parthia** and the **local Gandhara tradition** which reveals the structure and tradition of the society.\n* The **local sculptural tradition at Mathura** became so strong that the tradition spread to other parts of **northern India.**\n  + The best example in this regard is the **stupa sculptures** found at **Sanghol** in the **Punjab.**\n* Images of **Vaishnava** (mainly **Vishnu** and his various forms) and **Shaiva** (mainly the **lingas** and **mukhalingas**) faiths are also found at Mathura. It represents the religious belief of society.\n* The **Chola sculptures** started bronze casting sometime about the middle of the **tenth century A.D.** of the numerous bronze images, the **Nataraja image** in its various forms holds the first place.\n\nTypical life scenarios are shown in sculpture. Nearly all of the sculptures and paintings are motivated by the activities taking place in the immediate vicinity. All works of art, including sculptures, eventually aim to convey a message. Sculptures are created by artists to convey ideas, religious views, historical figures, and even heroic mythical tales.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**2. Why did the armies of the British East India Company – mostly comprising of Indian Soldiers – win consistently against the more numerous and better equipped armies of the then Indian rulers? Give reasons.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Indians were recruited for the British East India Company's army because they were familiar with the conditions in India. Indians were prepared to take lower wages. As a result, the East India Company's overall expenditures were cheaper than those of contracted British army men. Because of the immense distance that separated Britain from India, the British people were not willing to move India. The English had enforced every available means of war and administrative procedures in order to consolidate their own authority over India.\n\n**Superior military and armaments strategy:**\n\n* The British had cannon and assault rifles that were more advanced in terms of their range and shooting speed than Indian weapons.\n* Many Indian rulers brought European weapons, but they were unable to develop war strategy like British authorities.\n\n**Armed regulation, dedication, and consistent remuneration:**\n\n* The British were very careful about a regular income and a rigid code of conduct that guaranteed the loyalty of the commanders and soldiers.\n* The rulers of India lacked the resources necessary to make regular salary payments.\n* Some of the kings were dependent on their own personal guards of unruly and disloyal mercenaries.\n\n**Effective leadership:**\n\n* Robert Clive, Warren Hastings, Elphinstone, Munro, and others demonstrated exceptional leadership traits.\n* The British also profited from second-line commanders like Sir Eyre Coote, Lord Lake, Arthur Wellesley, and others who stand up for their nation's interests and honor.\n* While the Indian side had excellent commanders like Haider Ali, Tipu Sultan, Madhu Rao, Sindhia, and Jaswant Rao Holkar, they needed a second line of leadership.\n\n**A solid financial foundation:**\n\n* A great deal of wealth was contributed to England by British trade, which led to government assistance in the form of money, materials, and other resources.\n\n**Absence of national pride and unification:**\n\n* Indian rulers lacked a cohesive political nationalism, which the British skillfully exploited to incite civil war among them.\n\nThe East India Company had a private army. The corporation utilized its armed power to impose terrible taxes, carry out officially approved plundering, subjugate Indian governments and principalities with which it had previously entered into commercial deals, and defend its economic exploitation of both skilled and unskilled Indian workers.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q3",
      "serial_no": "3",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**3. Why was there a sudden spurt in famines in colonial India since the mid-eighteenth century? Give reasons.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The term \"famine\" is derived from the Latin word \"Fames,\" which means \"hunger.\" Famine is defined as \"a state of intense hunger experienced by a region's population as a result of a lack of regular food supply.\"\n\n* The **1769-70** famine in **Bengal** followed two years of erratic rainfall but was worsened by a **smallpox epidemic.** The **1783-84** famine again followed a **crop failure** over a wide area.\n\n**Reasons**\n\n* **Drought:**\n  + The excessive rainfall in 1770 did not relieve the people from the sufferings of drought of the year before; on the contrary, it caused overflowing of rivers and damaged standing crops.\n  + The proximate cause of famines, without exception, was a sharp rise in food prices, which in turn reduced real wages and caused starvation, malnutrition and epidemic, mainly among agricultural laborer groups.\n* **Rural Indebtedness:**\n  + Debt has always been a major component of India's rural economy. Due to exorbitant rents and illegitimate taxation imposed by the British Government, peasants were heavily indebted, this indebtedness was exacerbated by the onset of severe drought-like circumstances which culminated in the onset of famines.\n* **British Policy:**\n  + The main cause of the devastating famines during the colonial rule was the British policy of exploitation, repression and oppression inflicted upon the Indian people.\n  + Mass export of agricultural produce to the England by the Britishers led to shortage of the food supply in India which ultimately culminated into the severe famine.\n  + Cornwallis introduced the permanent settlement in 1793. The peasants were dispossessed of their ownership of land by this strategy, which for the first time in India's agricultural history made the zamindars and talukdars the true landowners.\n\nFamines that occurred during the colonial era had a tremendous influence on the economy and even the culture. Famines unquestionably had a negative impact on population growth and slowed down economic development.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**11. The political and administrative reorganization of states and territories has heen a continuous ongoing process since the mid-nineteenth century. Discuss with examples.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Early on in the company's rule, the East India Company began reorganising the territories in the states they captured, starting with Bengal, Bombay, and Madras Presidency. Since then, reorganisation and consolidation of states has been a constant process.\n\n#### **Phase-1 1850’s to 1947:**\n\n* After the revolt of 1857, the British government accelerated the process of continuous political and administrative reorganisation.\n  + New presidencies were created (Central Province)\n  + Several independent states became part of the Chief Administration provinces (Assam, Awadh)\n* North-West Frontier Province, was created in 1901 from the north-western districts of the Punjab Province.\n* Bengal was partitioned in 1905 on the basis of religion and language.\n\n#### **Phase 2: 1947- 2022:**\n\n* In 1950, the Indian Constitution contained a four-fold classification of the states of the Indian Union- Part A, Part B, Part C and Part D States on a political and administrative basis.\n* In 1953, the States Reorganisation Commission (SRC) under Fazal Ali was constituted to recommend the reorganisation of state boundaries.\n  + Subsequently, the 7th Constitutional Amendment Act was passed which laid out two classifications of units:States and Union Territories.\n  + Andhra Pradesh became the first state to be formed on a linguistic basis.\n* Several territories acquired from the Portuguese (Goa, Daman, Diu, Dadra Nagar Haveli, and Puducherry) were incorporated into the Union Territories (Goa was given statehood later).\n* The creation of Chhattisgarh, Jharkhand and Uttarakhand was made possible by disintegrating regional boundaries and political territories from within the existing States of Madhya Pradesh, Bihar and Uttar Pradesh, respectively.\n* In 2014, Andhra Pradesh Reorganisation Act 2014 was passed that carved Telangana State out of Andhra Pradesh.\n  + The demand for separate statehood for Telangana has rested on factors such as the scale of inter-regional inequalities causing socio-economic backwardness of the region, inadequate industrial infrastructure, lack of educational and employment opportunities, diversion of water and natural resources of Telangana to the coastal region of Andhra, the hegemonic control of the coastal capitalist class over the Telangana region, etc.\n* Most recently, in 2019 the State of Jammu and Kashmir was reorganised for administrative and security purposes.\n\nAs our Indian Constitution is a living document, which allows reorganisation of states and union territories (Article-3), reorganisation of states may remain a continuous process with regard to the evolving nature of political and administrative dynamics.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**12. Discuss the main contributions of Gupta period and Chola period to Indian heritage and culture.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The Golden Period in Indian history, was established by Chandragupta I as the Gupta Dynasty in the 3rd Century AD.\n\nChola dynasty was established as one of the longest ruling dynasties in the southern regions of India by Vijayalaya in 9th century.\n\nBoth Gupta and Chola Rulers have contributed to Indian Culture & Heritage in the following ways:\n\n|  |  |  |\n| --- | --- | --- |\n| **Category** | **Gupta Period (300-600 AD)** | **Chola Period (900-1300 AD)** |\n| **Temple** | * Brick temples were started to be made during the Gupta period. * **Dashavatara temple in Deogarh** has the presence of a **curvilinear tall rekha-deol (or rekha-prasada) type shikhara** (Nagara Style). * **Square temples** emerged in Gupta Period such as **Vishnu and Varaha temples** at Eran in Vidisha. | * Chola rulers **continued temple construction on the lines of Pallava architecture** with variations, which came to be known as **Dravidian architecture.** * **Brihadisvara temple** at Thanjavur in Tamil Nadu and **Gangaikondacholapuram** temple are such examples. |\n| **Sculpture** | * A new school called **Sarnath** School emerged. Cream colored sandstone was used in it.   + At Sarnath, Buddha is shown **standing, seated and in other positions as well.** * **Goddess Ganga** from Besnagar and **Apsaras** from Gwalior were also found. | * **Bronze Nataraja** of Chola period indicates **sound of creation, destruction, benediction and path of salvation etc.** * Sculpture of **Sembiyan Mahadevi**, a 10th century AD chola queen was found. * 9th century AD **Kalyanasundara** murti represents the **Panigrahana (ceremony of marriage).** |\n| **Cave Architecture** | * **Junagrah caves:** They have a citadel called **‘uparakot’** apart from a lower prayer hall. * **Nashik Caves:** Primarily **Hinyana** Buddhist caves and Buddha is shown in form of **symbols**, there are 23 such caves and are termed as **‘Pandav Leni’.** * **Ajanta Cave:** These are **29 Rock-cut cave** belonging to Hinayana and Mahayana period. * **Other examples:** Udaigiri Caves, Bagh Caves, Ellora Caves etc. | **No significant cave development** took place during chola’s rule. |\n| **Paintings** | * **Ajanta Paintings:** It depicts **events from Buddha’s life** in the form of Jataka tales.   + They are **drawn in continuity without** using separate frames and they are essentially two dimensional.   + **Dying Princess** is one the most prominent examples. * **Ellora Cave Paintings:** It has **influences from three religions** – Jaina, Buddhism and Hinduism. | * **Brihadeshwara temple** houses paintings of Hindu deities that were made during Chola period. * The paintings show **narrations** and **aspects related to Lord Shiva, Shiva in Kailash, Shiva as Tripurantaka etc.** |\n\nThe significant contribution by both of the dynasties have shaped India’s culture and heritage into a rich and prosperous shape with Gupta’s cave being in a good shape even after 1500 years and Nataraja sculpture by Chola’s being worshiped at various temples of modern India.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q13",
      "serial_no": "13",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**13. Discuss the significance of the lion and bull figures in Indian mythology, art and architecture.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Since the advent of humans, animals have also been a complimentary companion on earth. The traces of human animal relationship traces back to the paintings of the upper paleolithic period, around 12,000 year ago.\n\nTwo amongst the important animals who have been a significant part of human life are “Lion” & “Bull”. From the stone age period to Modern India, traces have been found of their presence in various aspects, which could be understood in an elaborate way, as stated below.\n\n#### **Mythology**\n\n* **Vehicle of Goddess Durga:**\n  + Lion is the 'vahana' or vehicle of Maa Durga. The animal also represents the power of Maa Durga.\n* **Nandi Bull of Shiva:**\n  + Nandi, which means **“giving delight”** or **“giving joy”** is the sacred bull of the Hindu god Shiva.\n\n#### **Art**\n\n* **Sculpture:**\n  + **National Emblem of India:**\n    - It is an adoption of Sarnath Lion Capital of Ashoka.\n    - There are **four lions**, standing back to back, an **elephant**, a **galloping horse,** a **bull** and a **lion** separated by intervening wheels over a bell-shaped lotus.\n      * **The Bull** depicts the Zodiac sign of Taurus.\n      * **The Lion** shows the attainment of enlightenment.\n  + **Indus Valley Bronze Bull:**\n    - The bronze bull of Indus Valley Civilisation signifies the presence of Bronze in the Indus Valley Civilization i.e. Bronze Age Civilization.\n  + **Bull in Tamil Nadu Rockart:**\n    - Rock art discoveries in Tamil Nadu have depicted prehistoric men capturing bulls and attempting to tame them.\n\n#### **Architecture**\n\n* **Mauryan Pillar:**\n  + The top portion of the pillar was carved with capital figures like the bull, the lion, the elephant, etc.\n  + The Mauryan symbolism of the lions indicate “the power of a universal emperor (chakravarti) who dedicated all his resources to the victory of dharma”.\n* **Sanchi Stupa:**\n  + Sanchi Stupa in Madhya Pradesh is the most famous of the Ashokan stupas.\n  + Rock engraving of Lion with wings and Bull has been found in the torana of the stupa.\n\nFrom traces in ancient India to significance in the national symbol of the country, lion and bull have been a witness of the phases of development and changes of the land of India.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_2_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**9. ‘India is an age-old friend of Sri Lanka.’ Discuss India's role in the recent crisis in Sri Lanka in the light of the preceding statement.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Sri Lanka is one of the neighboring countries of India. Both countries have been in a cordial relationship since the rule of Mauryan Emperor Ashoka. Both countries have a legacy of intellectual, cultural, religious and linguistic interaction.\n\nCurrently, Sri Lanka is under the grip of an unprecedented economic turmoil, the worst in seven decades, leaving millions struggling to buy food, medicine, fuel and other essentials.\n\n**Reasons Behind the Sri Lankan Crisis**\n\n* **Easter Bomb Blasts, 2019** have impacted the tourism industry in Sri Lanka, which has lead to decline in forex reserves.\n* The new Government in 2019 promised **lower tax rates.**\n* **Covid-19 Pandemic** has impacted the exports of **tea, rubber, spices and garments.**\n* High Government expenditure led to **fiscal deficit more than 10%** in 2020-21.\n* In 2021, overnight shift to organic farming impacted food production.\n\n**India’s Support to Sri Lanka in the Recent Crisis**\n\n* **Food, health and energy security package** as well as **foreign reserves** support amounting to more than **USD 3.5 billion.**\n* A **concessional loan** of US$ 1 billion.\n* A **Line of Credit (LOC) of USD 500 million** for financing purchase of **petroleum product** such as diesel, petrol and aviation fuel.\n* A consignment of **40,000 MT of fuel** supplied by Indian Oil Corporation outside the LOC facility.\n* A **currency swap facility** of USD 400 million under the **SAARC Currency Swap Framework** 2019-22.\n* A large consignment of **drugs and medical supplies** was gifted to various hospitals in Sri Lanka.\n* **A dollar credit line** amounting **to USD 55 million** for the procurement of 65000 MT **Urea fertiliser** from India for the Yala season cultivation.\n\nThe Sri Lankan crisis is not just a domestic problem, but it has a spill-over effect on other South Asian countries also. India’s assistance to Sri Lanka is in line with its policy of neighborhood first and vision for Security and Growth for All (SAGAR). These twin principles underline India’s emphasis on emerging as a first respondent to meet the requirements of neighboring countries in the region.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_4_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**7. Prabhat was working as Vice President (Marketing) at Sterling Electric Ltd., a reputed multinational company. But presently the company was passing through the difficult times as the sales were continuously showing downward trend in the last two quarters. His division, which hitherto had been a major revenue contributor to the company's financial health, was now desperately trying to procure some big government order for them. But their best efforts did not yield any positive success or breakthrough. His was a professional company and his local bosses were under pressure from their London-based HO to show some positive results. In the last performance review meeting taken by the Executive Director (India Head), he was reprimanded for his poor performance. He assured them that his division is working on a special contract from the Ministry of Defence for a secret installation near Gwalior and tender is being submitted shortly.**  \n**He was under extreme pressure and he was deeply perturbed. What aggravated the situation further was a warning from the top that if the deal is not clinched in favour of the company, his division might have to be closed and he may have to quit his lucrative job. There was another dimension which was causing him deep mental torture a and agony. This pertained to his personal precarious financial health. He was a single earner in the family with two school-college going children and his old ailing mother. The heavy expenditure on education and medical was causing a big strain to his monthly pay packet. Regular EMI for housing loan taken from bank was unavoidable and any default would render him liable for severe legal action. In the above backdrop, he was hoping for some miracle to happen. There was sudden turn of events. His secretary informed that a gentleman-SubhashVerma wanted to see him as he was interested in the position of Manager which was to be filled in by him in the company. He further brought to his notice that his CV has been received through the office of the Minister of Defence. During interview of the candidate-Subhash Verma, he found him technically sound, resourceful and experienced marketeer. He seemed to be well-conversant with tendering procedures and having knack of follow-up and liaising in this regard. Prabhat felt that he was better choice than the rest of the candidates who were recently interviewed by him in the last few days. Subhash Verma also indicated that he was in possession of the copies of the bid documents that the Unique Electronics Ltd. would be submitting the next day to the Defence Ministry for their tender. He offered to hand over those documents subject to his employment in the company on suitable terms and conditions. He made it clear that in the process, the Sterling Electric Ltd. could outbid their rival company and get the bid and hefty Defence Ministry order. He indicated that it will be win-win situation for both-him and the company. Prabhat was absolutely stunned. It was a mixed feeling of shock and thrill. He was uncomfortable and perspiring. If accepted, all his problems would vanish instantly and he may be rewarded for securing the much awaited tender and thereby boosting company's sales and financial health. He was in a fix as to the future course of action. He was wonder-struck at the guts of Subhash Verma in having surreptitiously removing his own company papers and offering to the rival company for a job. Being an experienced person,he was examining the pros and cons of the proposal/situation and he asked him to come the next day.**  \n**(a) Discuss the ethical issues involved in the case.**  \n**(b) Critically examine the options available to Prabhat in the above situation.**  \n**(c) Which of the above would be the most appropriate for Prabhat and why?**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "**Various possible stakeholders in the above discussed case study-**\n\n* Prabhat as a vice president (Marketing) at Sterling Electric Ltd.\n* Interest of Sterling Electric Ltd.\n* Subhas Verma vs unique electronics ltd.\n* Prabhat and his serious family responsibility.\n* Ministry of Defence and its contract (National security).\n\n**(A) -Ethical Issues involved in this case-**\n\n* **Professional ethics vs personal ethics**-Professional ethics demands to stick over the rules of professionalism. Subhas Verma's offer of handing over secret document is violation of professional ethics as well as personal integrity. If Prabhat accepts the offer, then it will also be considered as violation of professional ethics and personal ethics.\n* **Integrity and trust issue with Subhas Verma-**if Subhas Verma can cheat with his current company for the gain of managerial post, then what is guarantee that he will not cheat this company for further higher gains?\n* **Issues of corporate ethics violation-** if Prabhat accepts the Subhas's secret documents and offer him as Manager post. Then this will be the case of serious violation of corporate ethics. This violation is entitled to legal battle if these things disclosed in public.\n* **Issue of conflict of conscience with Prabhat-** Responsibility of two school going children and old ailing mother are prime concerns of Prabhat. Pressure of Job insecurity and serious family responsibility creates a conflict situation in his conscience.\n* **End vs Means –**if Prabhat accepts subhas Verma's secret documents then it will be the clear case of achieving the end goal by using wrong means.\n* **Self- Interest vs Morality-** Subhas Verma's offer of handing over the secret document to Prabhat for gaining managerial post is an act of selfishness at the cost of public morality.\n\n**B) Options available to Prabhat-**\n\n**1.Prabhat can appoint Subhas Verma as Manager and submit tender bid with the help of Subhas's secret documents**\n\n**Merits-**\n\n* Prabhat's company can be awarded much awaited tender.\n* Sales and financial health of Prabhat's company can be improved.\n* Prabhat’s lucrative job would be safe and secure. He can get further promotions.\n* There will be no hardness in the life of Prabhat's old ailing mother and his two school going children.\n* Subhas Verma can get a managerial job.\n\n**Demerits-**\n\n* There are integrity and probity issues with Subhas Verma. Prabhat's trust in Subhas Verma can create potential future risk to company.\n* If the activity leakage of secret documents disclosed anyhow then legal case can be imposed on Prabhat along with his company and Subhas Verma.\n* The reputation and image of Prabhat’s company can be damaged if exchange of documents things disclosed in public.\n* This is critical defence project, so any wrongdoing and document fraud in tender can entitled to serious national security risk.\n\n**2. Prabhat can reject Subhas Verma's application and submit bid with outmost probity and wait for result. He should appoint a quick response team to search new opportunities to boost up company’s financial health as a plan B.**\n\n**Merits-**\n\n* Prabhat can save himself and his company from future potential risk.\n* Prabhat and his company can be safe and secure from possible legal issues.\n* Prabhat would set an example of excellent corporate ethics and outmost probity.\n* Prabhat can save nation from potential national security risk by rejecting Subhas Verma's offer.\n\n**Demerits**\n\n* Prabhat’s company can fail to secure much awaited tender.\n* Prabhat’s could lose his lucrative job, so his school going children and old ailing mother can face some hardships due to job loss.\n* Sales and the financial health of his company could be poorer.\n\n**3. Prabhat can apply for leave**\n\n**Merits-**\n\nIf leave granted, then\n\n* He can save himself from conflict of conscience.\n* His accountability and answerability can be shifted.\n\n**Demerits**\n\n* If tender fails, then his department can be closed and he can lose his job.\n* His company’s financial health and sales can be poorer.\n* His family can face hardships.\n\n**4. Prabhat can search for new job options**\n\n**Merits-**\n\nIf get instant job offer, then\n\n* He can work with outmost probity and without any job insecurity pressure.\n* Citing trust issues, he can softly reject the Subhas Verma’s offer.\n* He can set an excellent example of upholding the corporate ethics standards and personal integrity.\n* He can save his family from facing any hardship in future.\n\n**Demerits-**\n\n* It will pose question about his loyalty towards company in needy time.\n* It can be the case that he might not get as lucrative job as he is in now.\n* Company can stay his saving and other emoluments which are held under company's possessions.\n\n**c) Most appropriate option for Prabhat-**\n\nPrabhat can reject Subhas Verma's application and submit bid outmost probity and wait for result and He should appoint a quick response team to search new opportunities to boost up company’s financial health as a plan B.\n\nCiting some trust and integrity issue with Subhas Verma, Prabhat should reject the offer of Subhas Verma and his candidature as a managerial post. He should send a strict warning to subhas Verma and tell him about possible course of legal action can be taken against him.\n\nPrabhat should work very hard to get tender, because tender bid is in very nascent phase so he should not reach any conclusion. He should do all possible research and work harder to submit his tender with all sets of professionalism. Then wait for result. As plan B he can appoint a quick response team to swiftly search some new opportunities to boost up financial health of his company. He should convey this plan and strategy to his higher officials. If tender results do not come in favour, then he can introduce plan B.\n\nIt will help in many ways-\n\n* He can set an example of outmost professionalism and personal integrity.\n* He can save nation from possible potential national security risk.\n* He can stick to the wisdom of right means for right Goal.\n* Morality will win over self-interest.\n\nAlthough Prabhat is single earner in his family of two school going children and old ailing mother along with serious economic concerns in life but he should choose integrity, probity, morality and national interest over greed, wrong means and self-interest.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_4_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**11. Rakesh was working as Joint Commissioner in Transport Department of a city. As a Part of his Job profile, among others, he was entrusted with the task of overseeing the control and functioning of City Transport Department. A case of strike by the drivers' union of City Transport Department over the issue of Compensation to a driver who died on duty while driving the bus came up before him for decision in the matter.**  \n**He gathered that the driver (deceased) was plying Bus No. 528 which Passed through busy and congested roads of the city. It so happened that near an intersection on the way, there was an accident involving the bus and a car driver by a middle-aged man. It was found that there was altercation between the driver and the car driver. Heated arguments between them led to fight and the driver gave him a blow. Lot of passerbys had gathered and tried to intervene but without success. Eventually, both of them were badly injured and profusely bleeding and were taken to the nearby hospital. The driver succumbed to the injuries and could not be saved. The middle-aged driver's condition was also critical but after a day, he recovered and was discharged. Police had immediately come at the spot of accident and FIR was registered. Police investigation revealed that the quarrel in question was started by the bus driver and he had resorted to physical violence. There was exchange of blows between them. The City Transport Department management is considering of not giving any extra compensation to the driver's (deceased) family. The family is very aggrieved, depressed and agitated against the discriminatory and non-sympathetic approach of the City Transport Department management. The bus driver (deceased) was 52 years of age, was survived by his wife and two school-college going daughters. He was the sole earner of the family. The City Transport Department workers' union took up this case and when found no favorable response from the management, decided to go on strike. The union's demand was two-fold. First was full extra compensation as given to other drivers who died on duty and secondly employment to onefamily member. The strike has continued for 10 days and the deadlock remains.**  \n**(a) What are the options available to Rakesh to meet the above situation?**  \n**(b) Critically examine each of the options identified by Rakesh.**  \n**(c) What are the ethical dilemmas being faced by Rakesh?**  \n**(d) What course of action would Rakesh adopt to diffuse the above situation**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Various possible stakeholders in the above discussed case study-\n\n* Rakesh as a joint commissioner in transport department of a city.\n* Union of city transport department.\n* Deceased driver.\n* Deceased driver and his two school- college going daughters.\n* Survived car driver.\n* Police and its duty.\n\n**A) Possible options available to Rakesh to meet the above situations-**\n\n* Rakesh can accept both demands of transport union.\n* Rakesh can reject the both demand of transport union.\n* Rakesh can accept one of demand of department comfort and can reject another.\n* Rakesh can appoint a departmental enquiry team which include half members from union and half from department.\n* Rakesh can send strict warning to those who are involve in strike and can use police force to resolve the dialogue.\n* Rakesh can seek advice from commissioner.\n\n**B) Critically examining each of options identified by Rakesh**\n\n**1.Rakesh can accept both demands of transport union-**\n\n**Merits-**\n\n* Deadlock can resolve soon and transport department can start working in full capacity.\n* Deceased driver’s family would get instant justice.\n* After resolving deadlock, Rakesh can use his time and energy on departmental work. This can enhance the productivity of department.\n\n**Demerits**\n\n* This activity can override police investigation report which cites that quarrel started by bus driver.\n* It can send wrong message to other bus drivers.\n* It can become the case of departmental jurisprudence.\n\n**2. Rakesh can reject the both demands of transport union-**\n\n**Merits-**\n\n* Department’s exchequer can be saved.\n* Department management’s decision would prevail.\n\n**Demerits-**\n\n* Deadlock can be continued for long.\n* Productivity and efficiency of department can be reduced.\n* Deceased driver’s family can face serious economic and livelihood concerns.\n\n**3. Rakesh can accept one of demand of department comfort and can reject another-**\n\n**Merit**\n\n* Deadlock can reach to a conclusion.\n* It can be half relief to deceased driver’s family.\n* Productivity and efficiency of the department can be restored.\n\n**Demerits-**\n\n* It can be the act of overriding police investigation reports.\n* Deadlock can be continued because transport union is stick to its both demands.\n\n**4. Rakesh can appoint a departmental enquiry committee which includes equal members from union and equal from department and some from police department. Union should resume work and wait for committee decision. Till committee conclusion come out, he can organise departmental funding to help family in buffer time.**\n\n**Merits**\n\n* It can be the win- win situation for department management, transport union and police department.\n* It can result in all aggregable resolution points.\n* It can set an example of all party integrated dispute resolution system.\n* Police department can provide the solution of appropriate proportionate legal angle which can motivate department management to be more sympathetic and kinder towards deceased driver’s family.\n\n**Demerits-**\n\n* Because of all parties involve so It can take time to reach a conclusion.\n* Wastage of energy, time, resources if it ended in no conclusive state.\n\n**5.Rakesh can send strict warning to those who are involve in strike and can use police force to resolve the dialogue-**\n\n**Merits-**\n\n* It is possible that by introducing element of warning and fear of police force, most of union worker can resume their work.\n\n**Demerits-**\n\n* This action can make the situation violent.\n* It can introduce the elements of trust deficit and bitterness among the union workers and department management.\n* Productivity of department can be poorer.\n\n**6.Rakesh can seek advice from commissioner-**\n\n**Merits-**\n\n* As a more experienced person commissioner can give appropriate advice to deal with this situation.\n* By consulting commissioner, He can take commissioner in confidence for future decisions.\n\n**Demerits-**\n\n* Commissioner have choice to diplomatically refuse to help him out.\n* Commission can question the crisis dealing capacity of Rakesh.\n\n**C) Possible ethical dilemmas being faced by Rakesh-**\n\n**1. Principal of natural justice vs Due process of Law-**\n\n* Principal of natural justice appeals that deceased’s family should get extra compensation and job to his family but due process of law hinders the department management to do so.\n\n**2. Right vs Duty-**\n\n* He is facing dilemma of public duty as a joint commissioner vs extra compensation and job rights of deceased family.\n\n**3. Public accountability vs Personal accountability-**\n\n* As a public servant, he is accountable to public service and activity delivered by him. On other hand, on compassionate and empathetic ground he is accountable to his personal conscience.\n\n**4. Code of conduct vs Code of ethics-**\n\n* Code of conduct demands what conduct rules and regulation say. Code of ethics demands the way of ‘what ought to do’ under the domain of morality.\n\n**5. Morality vs Law-**\n\n* Morality is what ought to do under principal of natural justice. While law follow the statutory rules and regulations under the domain of procedure establish by law or due course of law.\n\n**6. Conflict of Conscience-** He is facing the dilemma of crisis of conscience as public servant being vs personal being.\n\n**D) Possible course of action by virtue which Rakesh can diffuse the above situation-**\n\nRakesh has many courses of action to implement, but the best one is that-\n\nRakesh can appoint a **‘Departmental enquiry committee’** which includes equal members from **Transport Union** and equal from **Department management** and some from **Police Department**. Union should resume work and wait for committee decision. Since, committee decision process is time taking so he can organise departmental funding or personal funding to help out deceased family in this buffer time.\n\n**Merits -**\n\n* It can be the win- win situation for department management, transport union and police department.\n* It can result in all aggregable resolution points.\n* Transport union can resume functioning for time being.\n* It can set an example of all party integrated dispute resolution system.\n* Police department can provide the solution of appropriate proportionate legal angle which can motivate department management to be more sympathetic and kind towards deceased driver’s family.\n\nAlthough, it can be a time taking process due to involvement of various parties but the final conclusion of this committee can be more comprehensive, majority agreeable, inclusive. Hence, Rakesh should use this **integrated and all participative** course of action to diffuse the above situation.\n\nIf any extreme case, committee decision is not in favour of deceased family then Rakesh as an empathetic and compassionate public servant, should organise departmental crowdfunding to help out driver’s family. As a joint commissioner, he should also provide some ad hock job to elder daughter of family.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**2. What was the difference between Mahatma Gandhi and Rabindranath Tagore in their approach towards education and nationalism?**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Gandhi and Tagore, key figures in India's independence, had distinct approaches to education and nationalism, despite a common goal of freedom from British rule.\n\n**Differences between Mahatma Gandhi and Tagore:**\n\n* **Education:**\n  + **Gandhi:** Gandhi believed in the concept of 'Nai Talim' or **'Basic Education.**\n    - He advocated for a holistic education that nurtured practical, intellectual, and moral skills.\n    - He promoted **practical education to bridge the elite-mass divide.**\n  + **Tagore:** Tagore advocated a more liberal and cosmopolitan education.\n    - He **founded Shantiniketan** to promote arts, creativity, and cultural integration.\n    - His philosophy sought to cultivate well-rounded individuals who could value and enrich the world's diverse cultures.\n\n**Nationalism:**\n\n* **Gandhi:** His nationalism was characterized by non-violence and 'Satyagraha'.\n  + Gandhi's nationalism was deeply rooted in the idea of self-reliance, self-sufficiency, and Swaraj.\n  + He promoted the idea of boycotting British goods and institutions as a way to weaken British rule.\n* **Tagore:** Tagore's approach was **more cosmopolitan and less confrontational.**\n  + He envisioned a **nationalism beyond borders,** focusing on cultural unity and harmony.\n  + He saw India's heritage as a bridge between East and West and believed nationalism should unite, not isolate, India within global civilization.\n\nWhile Gandhi focused on practical education and non-violence, shaping his nationalism. On the other hand, Tagore, with a liberal approach, had a universalistic view of nationalism.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**6. How are the fjords formed? Why do they constitute some of the most picturesque areas of the world?**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "Fjords are long, narrow, and deep inlets of the sea that are surrounded by steep cliffs or mountains. They are formed by the erosion of glacial ice, and are found in regions where the sea level has risen after the ice age.\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2023_PAPER_1_Q6_IMG_1.png)\n\nSome countries that have fjords are Norway, Chile, New Zealand, and the U.S. state of Alaska.\n\nFjords are some of the most picturesque areas because of their unique and dramatic landscape features. Some of the reasons are:\n\n* The contrast between the calm, blue water and the rugged, snow-capped mountains.\n* The reflection of the mountains and the sky on the water surface.\n* The interplay of light and shadow on the water and the cliffs.\n* The biodiversity of the fjords supports a variety of marine and terrestrial life forms, such as seals, penguins, dolphins, whales, seabirds, and plants.\n* Fjord culture embodies centuries of history, with farms, villages, churches, and monuments harmonizing with the stunning natural surroundings.\n* The recreational opportunities of the fjords attract tourists. Some of the activities include hiking, kayaking, fishing, skiing, and cruising.\n\nTherefore, fjords are remarkable examples of how nature and culture can create some of the most picturesque areas of the world.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**12. What were the major technological changes introduced during the Sultanate period? How did those technological changes influence Indian society?**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The **Delhi Sultanate, a 320-year Islamic empire in Delhi (1206-1526),** reached its zenith under **Muhammad bin Tughluq**, expanding its rule across most of the Indian subcontinent. This period **witnessed several pivotal technological advancements,** reshaping various facets of Indian society.\n\nMajor technological changes introduced during the sultanate period:\n\n* **Agriculture and Irrigation:** Sophisticated irrigation systems, like **Hauz-i-Shamsi,** and water-lifting devices, like **Persian wheel**, improved water management and crop cultivation.\n* **Architecture and Construction:** Indian and Islamic architectural styles fused, creating Indo-Islamic architecture. **Qutub Minar** is an example.\n* **Trade and Commerce:** Standardized coinage, like **Silver Tanka and Copper Jital**, facilitated trade.\n* **Military Technology:** Fortified cities and forts, like **Tughlaqabad Fort,** improved defense capabilities. They showcased architectural innovations in military engineering.\n* **Intelligence Network:** Sultan Alauddin Khilji had a secret intelligence network called the “**Barid-i-Mumlikat.”**\n\nThese changes influenced Indian society in many ways, such as:\n\n* **Agrarian Expansion:** Improved irrigation systems **expanded agricultural lands, leading to the growth of rural communities.**\n* **Cultural Syncretism:** The blending of Indian and Islamic architectural styles and artistic forms fostered **cultural syncretism.**\n* **Numismatic Identity:** Standardized coinage helped establish a **unified numismatic identity across regions.**\n* **Military Infrastructure Legacy:** The architectural innovations in **military engineering left a lasting legacy** of strategic planning and engineering expertise.\n* **Intellectual Growth: Manuscript production and knowledge dissemination** played a crucial role in the intellectual growth of the society.\n* **Intelligence Heritage:** The secret intelligence network laid the groundwork for a tradition of **espionage and information gathering.**\n\nThe technological changes of the Sultanate period reshaped India’s culture, economy, and defense. They fostered **prosperity and resilience**, leaving an **enduring legacy of innovation and adaptation.**",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q13",
      "serial_no": "13",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**13. How did the colonial rule affect the tribals in India and what was the tribal response to the colonial oppression?**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "The arrival of **colonial powers,** especially the British, brought significant changes to the social, economic, and cultural fabric of these tribal societies. This impact was often marked by the displacement of tribal populations, land alienation, exploitation, and the **erosion of traditional ways of life.**\n\n**Impact of Colonial Rule on Tribals:**\n\n* **Displacement and Land Alienation:** One of the most significant impacts of colonial rule was the displacement and land alienation of tribal communities.\n* **Exploitative Labor Practices**: **Tribal communities** were often subjected to exploitative labor practices. The **British administration** forced many tribes into labor-intensive activities such as **mining, plantation work**, and road construction.\n* **Cultural Erosion**: The imposition of colonial laws, education systems, and religious practices led to the erosion of tribal cultures and traditions.\n* **Forest Policies:** The **British** introduced forest policies that restricted tribal access to forests, which were vital for their livelihoods.\n\n**Tribal Responses to Colonial Oppression:**\n\n* **Armed Resistance:** Tribal communities **mounted armed resistance** against colonial rule. They organized rebellions and uprisings to protect their lands, cultures, and ways of life. Examples: Santhal Rebellion, Munda Rebellion, Koya Rebellion.\n* **Cultural Preservation:** Some tribal communities focused on preserving their cultural heritage and traditions in the face of **colonial influence.**\n* **Guerrilla Warfare:** Some tribal communities employed guerrilla warfare tactics to resist colonial forces. They utilized their knowledge of the **local terrain** and their familiarity with guerrilla warfare strategies.\n\nTribal responses to colonial oppression in India were diverse, including both armed resistance and non-violent movements aimed at safeguarding their rights, culture, and traditional way of life. These efforts have contributed to ongoing discussions and policies regarding tribal rights and development in modern India.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_4_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**2. (a). “Corruption is the manifestation of the failure of core values in the society.’’ In your opinion what measures can be adopted to uplift the core values in the society?**  **(b) In the context of the work environment, differentiate between ‘coercion’ and ‘undue influence’ with suitable examples.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "**(a):**Corruption shows a **society’s loss of core values, such as integrity, honesty, and accountability.** When people choose personal gain over ethical principles, it damages good governance, economic development, and social justice.\n\nMeasures can be adopted to uplift the core values in the society to fight corruption:\n\n* **Moral and Ethical Education:** Including values like **honesty, integrity, and empathy** in school curricula.\n* **Transparency and Accountability:** Ensuring transparency and accountability in government actions.\n  + **Example:** The **Right to Information Act, 2005** in India.\n* **Adherence to Legal Principles:** Strengthening enforcement of anti-corruption laws with zero tolerance.\n  + **Example:** Singapore’s anti-corruption agency, the **Corrupt Practices Investigation Bureau known for its zero tolerance.**\n* **Civic Engagement:** Encouraging citizen participation in decision-making processes.\n  + **Example**: Participatory budgeting in **Porto Alegre, Brazil.**\n* **Media Freedom and Investigative Journalism:** A free and vigilant media that exposes corruption and holds power accountable.\n  + **Example:** The Panama Papers leak.\n* **Whistleblower Protection:** Protecting whistleblowers who report corruption.\n  + **Example:** The Whistleblower Protection Act, 2014 of India.\n\nIt is a collective responsibility that involves **individuals, institutions, and civil society** working together to build a **more just and ethical society.** It is also supported by international agreements like the **United Nations Convention against Corruption (UNCAC).**\n\n**(b):**In the work environment, **\"coercion\" refers to the use of force or threats to compel someone to act against their will,** while **\"undue influence\" involves exploiting one's authority or power to manipulate others' decisions.**\n\n* These distinct concepts play critical roles in shaping **ethical conduct** and **legal compliance** within professional settings.\n\n|  |  |  |\n| --- | --- | --- |\n| **Aspect** | **Coercion** | **Undue Influence** |\n| **Nature of Influence** | Explicit, often involving threats (e.g., **threatening termination**). | Subtle and manipulative, exploiting trust (e.g., **manipulating an employee's loyalty**). |\n| **Legal Status** | Typically illegal due to explicit threats or force (e.g., **blackmail**). | May not always be illegal but can be challenged (e.g., **persuading an employee to take on additional tasks**). |\n| **Psychological Impact** | Immediate fear, stress, and emotional distress (e.g., **causing anxiety**). | Long-term psychological impact, erosion of confidence (e.g., **undermining an employee's self-esteem**). |\n| **Reporting Behavior** | More likely to be reported promptly by victims (e.g., **employees reporting threats to HR**). | May go unnoticed or unreported for a longer period (e.g., **employees feeling pressured to stay silent**). |\n| **Workplace Implications** | Clear violation of legal and ethical standards (**e.g., violating labor laws**). | Can lead to unethical practices, potential legal issues (**e.g., favoritism in promotions)**. |",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q.11 Though the great Cholas are no more yet their name is still remembered with great pride because of their highest achievements in the domain of art and architecture. Comment. (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "### Approach:\n\n* Start by giving a brief introduction of great Cholas.\n* Mention their achievements in the domain of art and architecture.\n* Conclude Suitably.\n\n### Introduction:\n\nThe Cholas (8th-12th century AD) are remembered as one of the longest ruling dynasties in the southern regions of India. This rule stretched over for over five long centuries where Chola art saw culmination of dravida temple art resulting in the most sophisticated buildings.\n\n### Body:\n\n**The uniqueness of Chola temples:**\n\n* High boundary walls of temples with high entrance gateway (gopuram)\n* Circular and Square Sanctums.\n* Stepped pyramid structure (vimana)\n* Crowniang shikhar in an octagon shape\n* Intricate sculptures and inscriptions on walls of temples.\n* The presence of a water tank inside the temple enclosure\n* Pillared mandapams like ardha mandapa.\n\n**Contribution of Chola to Temple Development**\n\n* **More elaborative structures** like Brihadeshwara temple.\n* During the Chola period **stones were used instead of bricks** for making temples.\n* **Gopurams evolved into more exquisite** and well composed structures with carvings and series of effigies on them.\n* Cholas **brought maturity and grandeur to temple** architecture with elaborate pyramidal storeys. Eg. **Shiva Temple in Thanjavur.**\n* Temples have evolved **beautiful shikhara at the top with elaborate meticulous carving.** Eg. **Gangaikondacholapuram temple.**\n* The **dvarapalas at the entrance of the mandapa,** introduced by the Pallavas, became a **unique feature of Chola temples.**\n* The **temples were decorated with artistic stone pillars** with elongated limbs and polished features. Example: Carvings of the wheel chariot in Airavatesvara Temple.\n\n**Cholas Sculpture:**\n\n* **Chola bronze sculptures,** known for their exceptional craftsmanship, were created **using the lost wax technique. Eg. Nataraja Sculpture** in the Tandav posture.\n* The later chola sculpture shows Bhudevi (earth goddess) as the younger consort of Vishnu.\n* **Temple sculptures of Chola had delicate ornamentation**, pleasing faces and certain freshness. **Eg. Brihadisvara temple, Tanjavur.**\n* Independent figurines of **Parvati portray her in the elegant tribhanga posture.**\n\n### Conclusion:\n\nThe Chola Dynasty’s patronage, grand temples, architectural innovations, and support for sculptural art led to UNESCO recognition of their temples as world heritage sites.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q.20 Critically analyze the proposition that there is a high correlation between India's cultural diversities and socio-economic marginalities. (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HistoryAndCulture"
    },
    "solution": {
      "explanation": "### Approach\n\n* Examines India's cultural diversity and its correlation with socio-economic marginalities.\n* Highlights challenges faced by marginalized groups and opportunities for upward mobility..\n\n### Introduction\n\nIndia's cultural diversity, encompassing various languages, religions, and traditions, intersects with socio-economic factors, resulting in significant marginalization for certain communities facing persistent disadvantages in income, education, and social status.\n\n### Body:\n\n**Correlation Between Cultural Diversity and Socio-Economic Marginality**\n\n* **Historical Stratification:**\n  + The caste system has left Dalits and Adivasis systematically marginalized, facing exclusion from education, jobs, and social mobility. The 2011 Census revealed that Scheduled Castes (SCs) and Scheduled Tribes (STs) had significantly higher poverty rates compared to others. Similarly, the Sachar Committee (2006) highlighted that Muslims suffer from educational and economic deprivation, with lower literacy rates and poorer access to government jobs.\n* **Regional and Ethnic Disparities:**\n  + Tribal communities in central India and ethnic groups in the northeast face underdevelopment and displacement due to mining, infrastructure, and industrial projects. For instance, large-scale displacement caused by the Narmada dam disproportionately impacted Adivasi populations.\n* **Linguistic Marginalization:**\n  + Non-Hindi speaking states, particularly in the south, often express concerns over the central government's focus on Hindi, which they argue sidelines regional languages and leads to resource allocation disparities.\n* **Gender and Intersectionality:**\n  + Women from marginalized communities, like Dalit women, face compounded disadvantages in education, healthcare, and employment, experiencing both caste and gender-based discrimination.\n\n**Counter Arguments**\n\n* **Economic Structures:**\n  + Economic forces like globalization, neoliberal policies, and agrarian distress also exacerbate poverty, affecting both marginalized and non-marginalized communities.\n* **Policy and Governance Failures:**\n  + Poor implementation of schemes like MNREGA and PDS leakages further marginalize disadvantaged groups, revealing governance as a major factor beyond cultural identity.\n\n### Conclusion\n\nWhile there is a significant correlation between cultural diversity and socio-economic marginalization, broader economic factors and governance issues also contribute. Addressing both cultural and structural inequalities is essential for achieving socio-economic justice in India.",
      "explanation_format": "markdown"
    }
  }
]