[
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_2_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**9. Professor Amartya Sen has advocated important reforms in the realms of primary education and primary health care. What are your suggestions to improve their status and performance? (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Education and health care are some of basic human right to which all human beings are entitled to. The Supreme Court has from time to time interpreted Article 21 of the Constitution and has brought ‘Right to health’ and ‘right to primary education’ (Article 21A) under fundamental rights. Therefore, both primary education and health care is an important aspect for a democratic set up.\n\nProf. Amartya Sen have lamented about the primary education and health care situation in India and advocated for reforms. According to him:\n\n* Without developing social sectors like school education and basic health-care services, and without carrying outland reforms, it will not be possible for India to have a participatory and widely shared economic growth.\n* Education and health care are not only vital for quality of life, they have much to contribute to economic development and social change.\n* India needs to broaden its base in the spheres of education, healthcare and women’s equality to foster economic growth.\n* India ranks alongside Haiti and Sierra Leone when it comes to government spending on health as a share of the total health expenditure of the people.\n* He has made a strong case for a radical reform in primary school curriculum which would reduce the curriculum overload in primary education in the country, making home tasks redundant and private tuition unnecessary.\n* The government must prioritise expenditure on education and healthcare instead of ill-directed subsidies and tax exemptions.\n\n**Suggestions for improvement in primary education and health care**\n\n* Increasing the government expenditure on primary education and health care to atleast 5% of GDP. While the government spends only 1% of GDP on health, education spending in India has been lower than the world average.\n* There is a need for proper utilization of funds by plugging the loopholes arising from procedural and institutional bottlenecks.\n* Taking inspiration from the Yashpal Committee Report which seeks to make learning more meaningful and enjoyable by relating formal education to the living world of the children.\n* The mantra of availability, affordability, and assurance must be followed for improving status and performance of Health care in India.\n* Expanding the reach of health services to rural and remote areas is hindered by the limited availability of providers there. Therefore there is a need to improve the quality of Public Health Centres in those areas.\n* Cooperation and collaboration of both public and private sectors.\n\nIndia is the only country in the world which is aiming to become a global economic power with an uneducated and unhealthy labour force. Effective implementation of existing policies for skill development, fundamental education reforms, public private partnership and international collaborations can help the nation to become a global superpower.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_2_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**14. “Traditional bureaucratic structure and culture have hampered the process of socio-economic development in India.” Comment. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Traditional bureaucratic structure and culture is primarily identified with the maintenance of law and order, collection of revenues and regulation of national life. In this sense, it is status-quoist and regulatory in nature.\n\nIt is based on centralized decision-making. People are not given participation in administration and the decision-making process. It is known for its rigidity, centralization of power and procedure oriented consequently, the rules and regulations which were supposed to be the means to development have become an end in themselves, resulting in goal displacement. An example of this is the now dismantled Planning Commission which failed to keep pace with the changing socio-economic environment. Centralised state-led planning had been futile and redundant to address specific issues which never received adequate attention in the one-size-fits-all formula. Its replacement, the NITI Aayog is conceptualized to follow a bottoms-up approach supporting formulation. In the era of rolling-back of the state and globalization, there is a need for the bureaucracy to be downsized and confine itself to core functions that cannot be performed by market. There is a need for a result oriented bureaucracy which focuses on outcomes, is people-centric, participatory responsive and focused on effectiveness and equity rather than merely efficiency.\n\nWith the opening up of the economy with the 1991 reforms, things have gradually shifted. Bureaucracy now playing the role of an enabler, rather than ‘doer’. Public administration now focuses on good governance. Also, steps such as the 73rd and 74th Constitutional Amendment Acts have been steps in the positive direction for more inclusive development.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q1",
      "serial_no": "1",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**1. How globalization has led to the reduction of employment in the formal sector of the Indian economy? Is increased informalization detrimental to the development of the country? (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Globalization means gradual integration of economics through free movements of goods, services and capital. Globalization increased the efficiency of economy multi-dimensionally but one of the major challenges posed by globalization is the growing tendency towards flexible employment and informalisation. The reasons behind the reduction of employment due to globalisation in formal sector are following.\n\n* Increased automation in industries: Globalization exposed the technology globally which led to replacement of man power with robotics and other technology.\n* Shift from labour intensive industries to technology intensive industries: In India only 2% labour is skilled in comparison to 96% skilled labour in South Korea. Due to arrival of technology, unskilled labour was forced out from formal sector due to incapability of handling the new machines and led to informalisation.\n* Globalization encourages sub contracting of work to the informal sector because of low wage and lost cost of production in informal section. It increased the participation of contract labour in economy and reduced formal sector’s employment.\n* Globalization increased competition among the industries which shifted the employment/industrial units from non-competitive countries to market favoured economics. The shifting of textile industries to the Vietnam, Laos are recent examples of this phenomenon.\n\n**Impact of informalisation on the development of the country**\n\n* Less revenue generation: Due to high informalisation, tax to GDP ratio remains very low. In case of India it is only 16.6% whereas more than 30% in OECD countries.\n* Less coverage of social security schemes: Nearly all government schemes, programmes related to social security benefits are restricted to formal sector. A huge section of population remains out of the ambit of benefits. It ultimately reduces the efficiency of economy.\n\nThis shows how informalisation of labour force has proven detrimental to the development.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**7. What is water-use efficiency? Describe the role of micro-irrigation in increasing the water-use efficiency. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Water-use efficiency refers to the ratio of water used in plant metabolism to water lost by the plant through transpiration. Water use efficiency is also about careful management of water supply sources, use of water serving technologies, reduction of excessive demand and other actions.\n\nIn context of Indian agriculture, recognizing the fast declining irrigation water potential and increasing demand for water from different sectors, a number of demand management strategies and programmes have been introduced.\n\nOne such method is micro-irrigation that includes drip irrigation and sprinkler irrigation.\n\nUnder micro-irrigation, unlike flood method of irrigation, water is supplied at a required interval and quantity using pipe network, emitters and nozzles.\n\nThe on-farm irrigation efficiency of properly designed and managed drip irrigation system is estimated to be about 90 percent, while the same is only about 35 to 40 percent for surface method of irrigation.\n\nWhile increasing the productivity of crops significantly, it also reduces weed problems, soil erosion and cost of cultivation substantially.\n\nThe reduction in water consumption in micro irrigation also reduces the energy use that is required to lift water from irrigation wells.\n\nDrip-irrigation technique can replace the hand watering system in hilly areas with minimum water losses and labour.\n\nGovernment of India has also accorded high priority to water conservation and its management. Pradhan Mantri Krishi Sinchayee Yojana (PMKSY) has been formulated with the vision of extending the coverage of irrigation ‘Har Khet Ko Pani’ and improving water use efficiency ‘More crop per drop’ in focused manner using sprinker & drip method of irrigation.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_4_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**14. Saraswati was a successful IT professional in USA. Moved by patriotic sense of doing something for the country she returned to India. Together with some other like-minded friends, she formed an NGO to build a school for a poor rural community.The objective of the school was to provide the best quality modern education at a nominal cost. She soon discovered that she has to seek permission from a number of Government agencies. The rules and procedures were quite confusing and cumbersome. What frustrated her most were delays, callous attitude of officials and constant demand for bribes. Her experience and the experience of many others like her have deterred people from taking up social service projects.**  **A measure of Government control over voluntary social work is necessary. But it should not be exercised in a coercive and corrupt manner. What measures can you suggest to ensure that due control is exercised but well meaning, honest NGO efforts are not thwarted? (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "First of all developmental process like these aimed at imparting knowledge to rural poor community which will eventually help them in achieving a better standard of living should be encouraged.\n\nSaraswati and her friends were all determined to bring about a positive change through the medium of NGO. They should be facilitated with all possible support in a stipulated time to ensure that their passion is not thwarted.\n\nPosing unnecessary hindrances by creating excessive bureaucratic clearances to block the slightest likelihood of wrong doing is recurring news in case of NGO with malicious intentions these days. However, they should not create roadblocks for those with genuine intentions.\n\n**Methods that can be adopted:**\n\n* Laying out simple rules applying to all new entrants as well the existing ones. Reducing red tapism experienced in form of exhaustive paper work and clearances from various departments.\n* Strict action against complaints regarding intentional blocking of entry of new NGO by a concerned authority in lieu of bribe and personal favour.\n* Recently many NGO's have faced cancellation of their registration under the Foreign Contribution Regulation Act, 2010. These cancellations have been widely criticized. The government has been charged with stalling ground level work which is carried by NGOs. In order to avert such situation transparent system for both grant providers and receivers of such funds should be created.\n* Regular appraisals of NGO by government officials must be conducted to verify the purpose, nature of work and practices followed by NGOs to ensure credibility of an NGO.\n* Trust deficit created between NGOs and the government, both questioning each other's intention must be worked out as the common man suffers the most in between as visible in the case of Saraswati.\n\nGovernment and its official through NGOs and their personnels must ensure that the policies/programs of the former reaches the downtrodden, rural as well as in remote areas so they both need to work in tandem to achieve development.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q4",
      "serial_no": "4",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**4. What problems were germane to the decolonization process in the Malay Peninsula? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Malay Peninsula was under the British influence since they first came in the late 18th century looking towards Southeast Asia for new resources. Since then the British East India Company traded and partly controlled the region. The growth of their China trade further increased the company’s desire for bases in the region near it.\n\nThe decolonization of Malaya Peninsula was an extension of the series of decolonization movements going across the Asia and Africa and was influenced from this process which speeded-up after the World War-II.\n\n* Malay Peninsula was a multi-racial, multi-cultural society with Malay Chinese and Indians forming major ethnic and interest groups which was a suitable condition for colonial powers to consolidate their regime.\n* Fall of Singapore and Japanese advances in Malay Peninsula during the World War–II forced the British to consider reassessment of its non-interventionist policies in favour of ethnic cooperation and multiracial government in this region. But with the presence of diverse interest of different groups reaching to a consensus was a tough task.\n* Cold War ideological rivalry was prevalent in Malayan Peninsula too where with the rise of commintern aligned communist parties like Malayan Communist Party and Chinese Communist Organization, the fear of Malayan Peninsula falling to the Communists emerged.  It was a nightmare for the liberal democracies/ colonial powers (i.e. British) which ensured transfer of power to ideologically friendly regimes.\n\nThe decolonization of Malayan Peninsula was largely a result of long reconciliation process between the Malayan nationalist and the European colonial powers.  Their mutual compromise gave the British the confidence to speed up the process of decolonization through a smooth decolonization process.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_2_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**6. ‘To ensure effective implementation of policies addressing water, sanitation and hygiene needs, the identification of beneficiary segments is to be synchronized with the anticipated outcomes’. Examine the statement in the context of the WASH scheme. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "India is one of the developing countries that has come out with WASH schemes to address the challenges of health and sanitation in urban and rural areas. Swachh Bharat Abhiyan for urban and rural areas is one of the manifestation of the importance of WASH schemes.\n\nThere has been huge disparities in access to WASH services across different segments of the population. In India, around 128 million lack safe water services and about 840 million people don’t have sanitation services. Thus there is an urgent need to identify the different kinds of beneficiaries and communities whose accesss to WASH services need to be enhanced. The outcomes need to be enhanced in terms of adequacy, accessibility, affordability, quality and safety of the WASH services.\n\nWASH sectors come under concurrent subjects and both central and state governments can legislate on it. The collection of data related to WASH schemes are generally done at state level but it suffers from many discrepancies. The needs and barriers for segments of the population differ and consequently the strategies also need to be customised for the different segments. Therefore, policymakers are gradually moving away from a “one size fits all” approach to a more beneficiary-centric approach.\n\nA traditional approach has been to segment the beneficiaries on the basis of geographical and social context (GSS). Population was therefore segmented as rural, urban, low income and so on. Recently there is a trend to segment the beneficiaries on the basis of the human life cycle (LCS). Beneficiaries are thus segmented as children, adolescents, adults, senior citizens, and so on.  \nTo be able to achieve our WASH targets, it is important that our policies adopt both the LCS and GSS approaches.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**20. The scourge of terrorism is a grave challenge to national security. What solutions do you suggest to curb this growing menace? What are the major sources of terrorist funding? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "India has been hit by terrorism since a long time, like, 1993 Bombay blasts, attack on Parliament in 2011, the 26/11 Mumbai attacks, Pathankot attacks etc. In view of such attacks it becomes imperative for India to check this rising menace, for which the following steps can be taken:\n\n* Ensure co-ordination among the intelligence and security agencies to check infiltration of terror activity.\n* Empowering and engaging with civil society and local communities can help in countering radicalization and to stop the spread of violent extremism.\n* Given the important role of educational establishments in promoting the values of non-violence, peaceful coexistence and tolerance, education must feature prominently in counter radicalization programs.\n* Several initiatives that promote alliance of civilizations and intercultural dialogue must be promoted to counter terrorism. For instance, the Rashtriya Ekta Diwas celebrated on 31st October promotes unity in India.\n* Enhancing security presence along the international boundaries and seal the porous borders.\n* Undertaking policies to tackle economic and social inequalities will help in deterring disgruntled youth from being lured towards terrorism.\n* Terrorist organizations have successfully taken advantage of the great benefits of the Internet. Hence, countering radicalization on digital media must be given priority. Governments should intervene in this matter through monitoring and counter-propaganda programs\n* Incorporating ‘SAMADHAN’ in security operations in LWE affected areas and at same time focusing on development projects in Red corridor districts.\n\n**Sources of funding**\n\n* NGO, charities and donations are an important sourcing of funds for terrorism. These funds are mostly claimed through religious appeal, coercion and fears of victimization.\n* Counterfeiting of Indian currency not only funds terrorism, but, more importantly, it is used as a tool by neighboring states to destabilize the Indian economy.\n* Drug financing are also a major sources of terrorism financing in India.\n* Biggest source of internal funding for terrorist groups in India remains extortion. This is especially relevant for groups in the North-East and the Maoist-affected areas.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_2_Q3",
      "serial_no": "3",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**3. Under what circumstances can the Financial Emergency be proclaimed by the President of India? What consequences follow when such a declaration remain in force? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "The President of India proclaims the Financial Emergency under Article 360 of the Constitution, when he is satisfied that the financial stability or credit of India or of any part of the territory thereof is threatened.\n\nThe consequences of the proclamation of a Financial Emergency are as follows:\n\n* The executive authority of the Centre extends to directing any state to observe such canons of financial propriety as are specified by it; and the President may issue directions, necessary and adequate for the purpose.\n* Any such direction may include a provision requiring the reduction of salaries and allowances of all or any class of persons serving in the state; and the reservation of all money bills or other financial bills for the consideration of the President after they are passed by the state legislature.\n* The President may issue directions for the reduction of salaries and allowances of all or any class of persons serving the Union; and the judges of the Supreme Court and the High Courts.\n\nTill now, the Financial Emergency has never been invoked in India.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_2_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**7. Appropriate local community-level healthcare intervention is a prerequisite to achieve ‘Health for All’ in India. Explain. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "‘Health for All’ which includes the continuous availability of quality and affordable healthcare results in better health outcomes. It can be ensured by strengthening local community level healthcare services. Government has recently launched Ayushman Bharat to strengthen the primary health-care system through well functional health and wellness centres.\n\n**Role of local community level healthcare intervention to achieve ‘Health for All’:**\n\n* Local community level intervention is the first source of comprehensive and accessible healthcare that meets the immediate needs of individuals. Addressing issues at this level can result in risk screening for early disease detection bringing down the overall disease burden of the country.\n* Provision of preventive services at the local level like vaccinations and family planning, nutrition and maternal care can reduce the need for secondary and tertiary healthcare services.\n* Management of chronic health conditions and palliative care at local level can reduce the out-of-pocket expenditure for people.\n* Maintaining the physician-patient ratio at the grassroot level can ensure the availability of doctors for all, reducing the dependence on quacks and eliminating preventable causes like incorrect treatment.\n* The healthcare intervention at local community level should be supplemented by upgradation of infrastructure, technological advancement and capacity building of health workers.\n* Decentralised policy making that involves local community health workers can effectively address the local healthcare needs.\n\nHence, it is important to address these issues at the community level to achieve ‘Health for All’.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_2_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**12. How far do you agree with the view that tribunals curtail the jurisdiction of ordinary courts? In view of the above, discuss the constitutional validity and competency of the tribunals in India? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "A tribunal is a quasi-judicial body established by an Act of Parliament or State Legislature under Article 323A or 323B to resolve disputes that are brought before it. It is not a court of law, but enjoys some of the powers of a civil court like issuing summons and allowing witnesses to give evidence.\n\n**Tribunals Curtailing Jurisdiction of Ordinary Courts**\n\n* Tribunal, being a quasi-judicial body, goes against the Doctrine of Separation of Powers and allows dilution of judicial mechanism - the exclusive arena of ordinary courts.\n* The Supreme Court (SC) in Chandra Kumar case (1997) held that the power of the High Court (HC) under Article 226 and 227 to exercise judicial superintendence over the decisions of all courts and tribunals is a part of the basic structure of the Constitution. However, decisions of some of the tribunals, like National Green Tribunal continue to be taken on appeal only before the SC bypassing the HC as Court of Appeal, depriving them of their power of judicial review.\n* Conferring a direct right of appeal to the SC from tribunals has changed the SC from a constitutional court to a mere appellate court and has also resulted in a backlog of cases.\n* Appeals from SC would require SC to deal with the finer nuances of disputes under specialised areas of law from afresh. This is not ideal for a court of last resort.\n\n**Competency of Tribunals**\n\nTribunals are dependent for appointment, tenure, funding, infrastructure and mode of removal on the Executive - the largest litigant in the country. This creates a conflict of interest situation, putting a question mark over their independence. However, tribunals play significant role in following ways:\n\n* Their administrative members can better appreciate the technical nuances of the matters brought before them and can enhance the quality of justice delivery system.\n* They have flexibility and adaptability in adjudication as they are not restrained by rigid rules of procedure.\n* They are less formal, less expensive, and a faster way to resolve disputes.\n* They also give much needed relief to ordinary courts of law, already overburdened with numerous suits.\n\n**Way forward**\n\nGiven their benefits, tribunals should be revamped keeping in mind the 272nd Law Commission report for restructuring of tribunals and the ruling of SC in Chandra Kumar Case, and bringing tribunals under independent agency. Hence, tribunals are meant to supplement ordinary courts and cannot supplant them.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**15. How can the mountain ecosystem be restored from the negative impact of development initiatives and tourism?**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "The Himalayan States, including the Northeast, and the Western Ghats are the most prominent mountain ecosystems in India which are struggling to cope up with the negative impacts of development initiatives and tourism. The ***Report of Working Group II Sustainable Tourism in the Indian Himalayan Region*** by the NITI Aayog highlights similar concern.\n\nThe negative impacts emerge out of the replacement of traditional eco-friendly and aesthetic architecture with inappropriate and dangerous construction, poorly designed roads and associated infrastructure, inadequate solid waste management, air pollution, degradation of water sources, and the loss of biodiversity and ecosystem services. Their repercussions were evident in the Kedarnath floods of 2013.\n\n**In this respect, the following steps can be considered:**\n\n* The reports by committees on Western Ghats ecology headed by **Madhav Gadgil** and **K. Kasturirangan** need urgent attention. The concept of **ecological sensitive zones (ESZ)** cannot be sacrificed for the sake of development. Likewise, NITI Aayog has suggested setting up of **Himalayan Authority** for coordinated and holistic development of entire Himalayan region.\n* There has to be **clear demarcation and planning with respect to the extent of infrastructure development**. It should include a systematic process of urban planning, developing tourist hubs with strict controls, spring mapping and revival etc. For example, provision for no encroachment areas, well-preserved forested areas, etc.\n* With respect to tourism, measures like application of **carrying capacity concept** to tourist destinations, implementation and monitoring of **tourism sector standards,** and **performance-based incentives** for States faring well on the standards can be considered. The unregulated tourism movement is a major reason for plastic pollution.\n* States should also be encouraged to **spend more on sustainable development of tourism**. For instance, Uttarakhand stands second in tourist arrivals but invests only 0.15% of its total expenditure on this sector. Besides, States can also **adopt and share the best practices**. For example, Sikkim can be a lodestar for sustainable agriculture, **waste management** and **ecotourism**.\n* With collaborative and participatory frameworks **capacity building** for conservation is required. Viable enterprises that can provide sustained economic incentives and support local communities need to be promoted. These can help achieve **SDG Goal 8** (decent work and economic growth) and **Goal 12** (responsible consumption and production).\n\nTo provide a better standard of living to the mountain communities and to meet the overall needs of the economy, a linkage between development and conservation needs to be formed. Besides, effective implementation of schemes and policies hold significance for any desirable results.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_2_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**14. “The Attorney-General is the chief legal adviser and lawyer of the Government of India.” Discuss.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "The Constitution under Article 76 has provided for the office of the Attorney-General for India (AGI). He is appointed by the President and holds the office during the pleasure of the President. He must be a person who is qualified to be appointed as a judge of the Supreme Court.\n\nAs the **chief legal adviser** of the Government of India, the Attorney-General has the following duties:\n\n* To give advice to the Government of India on legal matters, which are referred to him by the President.\n* To perform other duties of a legal character that are assigned to him by the President.\n* To discharge the functions conferred on him by the Constitution or any other law.\n\nThe AGI is the highest law officer in the country and acts as the **lawyer** of the Government of India. Through a notification of 1950, he has been assigned the following duties by the President:\n\n* To appear on behalf of the Government of India in the Supreme Court and high courts.\n* To represent the Government of India in any reference made by the President to the Supreme Court under Article 143 of the Constitution.\n\nAlong with these duties, the AGI also has the right of audience in all courts in the territory of India. He also enjoys all the privileges and immunities that are available to a member of Parliament.\n\nHowever, the Attorney-General is not the full-time counsel of the Government. He does not fall in the category of government servants and he is not debarred from private legal practice. But, he should not advise or hold a brief against the Government of India and he should not defend accused persons in criminal prosecutions without the permission of the Government of India.\n\nThus, the duties and privileges of the AGI, combined with the limitations imposed on him, make him the chief legal adviser and lawyer of the Government of India. Nevertheless, the separate law minister in the Central cabinet to look after legal matters at the government level, to some extent, gives the office of AGI a subordinate position.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**20. How have digital initiativesin India contributed to the functioning of the education system in the country? Elaborate your answer**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "* In recent times, there has been a rise of digital education products in India both in private as well as public sectors such as app-based classes, SWAYAM portal, DIKSHA platform, etc. Notably, the online education market in India was valued at Rs. 39 billion in 2018 and is expected to reach `360 billion by 2024.\n* In the traditional education system, physical presence is paramount, i.e., attendance of teachers and students in the classroom. This has resulted in higher school dropout rates especially of girls due to lack of proper infrastructure (clean & separate toilets, distance from home) and various other household constraints.\n* Also, the investment needed in setting up schools and running them is also rising due to various factors. Moreover, the transportation of students, teachers and staff is also burdensome in some hilly states of India.\n* Digital initiatives like online lectures, online attendance, 3-D presentations, hearing and visual aid technology, etc. have changed the education world. There have been noticeable changes due to these technologies such as maximum participation of students is ensured, parents could keep real-time check on their pupil’s progress, traditional student-teacher interaction could be broadened, lectures could be recorded and be seen at any time, etc. Both students and the teaching community have benefitted.\n* The lockdown phase, from March 2020 onwards, hasseen the rise of digital education on large scale. However, caution needs to be maintained and a study needs to be done to understand the negative and positive effects of digital technology on education.\n* Most importantly, asitis an emerging market with huge potential,the government needsto be in vigilant mode so that the most backward of our citizens can have access to this revolution.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_2_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**9. Critically examine the role of WHOin providing global health security during the Covid-19 pandemic.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "WHO’s primary role isto direct and coordinate international health within the United Nationssystem. Its main areas of work are health systems; health through the life-course; non-communicable and communicable diseases; preparedness, surveillance and response; and corporate services.\n\n**WHO during COVID-19 pandemic**\n\n* COVID-19 is characterised as a virus-induced pandemic which refers to a new disease for which people do not have immunity.\n* The WHO issued guidelines and practices to be followed by the people to prevent the spread of the COVID-19 virus.\n* However, the WHO was criticised for not functioning independently under Chinese pressure. It also delayed declaring COVID-19, a pandemic.\n* WHO was also criticised for its handling of China, where the virus had originated. There was a deliberate delay in releasing virus-related information.\n* Delay in releasing information resulted in late actions by countries which aggravated the pandemic.\n* On the one hand, the WHO was accused of dancing to China’s tunes and, on the other, there were serious questions on the powers that the WHO enjoys when it comes to taking strict action against deep funders like China.\n* Withdrawal of the USA, inadequate funds and manpower further curbed the WHO’s independence and its ability to function.\n\nToday’s global institutions are extremely dependent on their contributors for funding that they often become pawnsfortheir political agendas. When the US cutfunding to the WHO, China increased its contribution. However, the WHO is not a failure. Possibly, it needs restructuring. In the 70 years since its founding, the WHO did a commendable job in helping eradicate smallpox, reduced polio cases and has been on the front lines of the battle against outbreaks like Ebola.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_2_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**18. National Education Policy 2020 isin conformity with the Sustainable Development Goal-4 (2030). It intends to restructure and reorient education system in India. Critically examine the statement.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Recently, the Government announced the New Education Policy (NEP) 2020, which will replace the National Policy on Education, 1986. The Sustainable Development Goal (SDG) 4 aims to “Ensure inclusive and equitable quality education and promote lifelong learning opportunities for all by 2030”.\n\n**Is NEP in tune with SDG 4?**\n\n* **Promote free primary and secondary education and universal literacy and numeracy (SDG 4.1 and 4.6):**\n  + NEP aims at universalization of education from preschool to secondary level with 100% Gross Enrolment Ratio (GER) in school education by 2030.\n  + The  Policy also makes education more inclusive by proposing the extension of the Right to Education (RTE) to all children up to the age of 18.\n* **Eliminate all discrimination in education (SDG 4.5):** NEP focuses on bringing 2 crores out of school children back into the mainstream through an open schooling system.\n* **Equal access to quality pre-primary education (SDG 4.2):** The Policy also recognizes the importance of the crucial early stage for the development of mental faculties of a child by bringing uncovered age group of 3-6 years under school curriculum with three years of Anganwadi/pre-schooling.\n* **Ensure equal access for all women and men to affordable and quality technical, vocational and tertiary education, including university (SDG 4.3):**\n  + NEP emphasises on Vocational Education from Class 6 with Internships.\n  + The Policy overhauls the undergraduate education with a flexible curriculum of 3 or 4 years with multiple exit options and appropriate certification.\n  + The National Research Foundation will be created for fostering a strong research culture and building research capacity across higher education.\n  + The National Educational Technology Forum (NETF), will be created to promote free exchange of ideas and technology.\n* **Substantially increase the supply of qualified teachers in developing countries (SDG 4.C):** A common National Professional Standards for Teachers (NPST) will be developed by 2022, in consultation with NCERT, SCERTs, teachers and expert organizations from across levels and regions.\n\nNEP 2020 has the potential to make an overwhelming impact on the socio-economic fabric of society, as expected in SDG-4. However, its effective implementation coupled with sufficient financing may become the defining factor of its success.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_3_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**8. What are the salient features of the Jal Shakti Abhiyan launched by the Government of India for water conservation and water security?**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "The Jal Shakti Abhiyan is a time-bound, mission-mode campaign for water conservation and water security. It is a mass movement to bring all the stakeholders under one ambit of water conservation drive. The campaign was mainly focused on the water-stressed blocks and districts.\n\n**Water Scarcity in India**\n\n* India has nearly 17.7% of the world’s population which has access to only 4% of the usable water sources. Poor management of resources and lack of government attention has contributed as a major factor for water scarcity in India.\n* As per NITI Aayog report released in June 2019, India is facing the worst-ever water crisis in history. Approximately 600 million people or roughly around 45 % of the population in India is facing high to severe water str\n* As per the report, several Indian cities will run out of their main source of water e., groundwater by 2020. The report goes on to say that nearly 40% of the population will have absolutely no access to drinking water by 2030 and 6% of India’s GDP will be lost by 2050 due to the water crisis.\n\n**The salient features of the Jal Shakti Abhiyan**\n\n* The Jal  Shakti  Abhiyan  is  a  campaign  for  water  conservation  and  water  security  in  the  country  through  a collaborative effort of various ministries of the Government of India and state governmen\n* The focus of the campaign is on water stressed districts and block The teams of officers from the central government will visit and work with district administration in water stressed blocks and districts, to ensure five important water conservation interventions.\n* **The important water conservation interventions are:**\n  + Water conservation and rainwater harvesting,\n  + Renovation of traditional and other water bodies/tanks,\n  + Reuse of water and recharging of structures,\n  + Watershed development, and\n  + Intensive afforesta\n* The water conservation interventions will also be supplemented with special interventions including the development of block and district water conservation plans, promotion of efficient water use for  irrigation and better choice of crops through Krishi Vigyan Kendr\n\nFollowing the massive water crisis across India in the summer of 2019, the Central government hurriedly launched the Jal Shakti Abhiyan (JSA). These kind of interventions would ensure water source sustainability in rural areas and would strengthen the ongoing Jal Jeevan Mission being implemented by the Ministry of Jal Shakti.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**11. To what extent did the role of the moderates prepare a base for the wider freedom movement? Comment.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "The first phase of the existence of the Congress is known as the moderate phase (1885-1905). During this, the Congress worked for limited objectives and concentrated more on building up its organisation. The leaders like Dadabhai Nauroji, P.N. Mehta, D.E. Wacha, W.C. Banerji, S.N. Banerji, Gopal Krishna Gokhale were staunch believers in liberalism and moderate politics and came to be labelled as moderates.\n\nThe main objective of the Moderates was to achieve self-government within the British Empire. They believed in patience and reconciliation rather than in violence and confrontation, thus relying on constitutional and peaceful methods in order to achieve their aims. They organised annual sessions with delegates participating from all parts of the country. After the discussions, resolutions were adopted which were forwarded to the Government for its information and appropriate action.\n\n**Success/contributions of moderates:**\n\n* They represented the most progressive forces of the time.\n* They were able to create a wide national awakening of all Indians having common interests and the need to rally around a common programme against a common enemy, and above all, the feeling of belonging to one nation.\n* They trained people in political work and popularised modern ideas.\n* They exposed the basically exploitative character of colonial rule, thus undermining its moral foundations.\n* Their political work was based on hard realities, and not on shallow sentiments, religion, etc.\n* They were able to establish the basic political truth that India should be ruled in the interest of Indians.\n* They created a solid base for a more vigorous, militant, mass-based national movement in the years that followed.\n\nThe early nationalists did a great deal to awaken the national sentiment, even though they could not draw the masses to them and failed to widen their democratic base and the scope of their demands. Moderates wanted to educate people in modern politics, to arouse national and political consciousness and to create a united public opinion on political questions. Their critics often accuse them for using methods of beggary through prayers and petitions.\n\nHowever, had they adopted revolutionary or violent methods, they would have been crushed right in the infancy of the Congress. They created a solid base for a more vigorous, militant, mass-based national movement in the following years. The Moderates thus were prudent in using the constitutional and peaceful methods to handle British rule.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_2_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**7. “Earn while you learn scheme needs to be strengthened to make vocational education and skill training meaningful.” Comment.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Benjamin Franklin once said, “Tell me and I forget, teach me and I remember, involve me and I learn.” ‘Earn while you learn’ scheme provides opportunities to the students to earn while they are learning through part-time jobs. It is a great combination of working & learning and is usually called vocational education.\n\nThe Ministry of Tourism runs a Scheme titled ‘Earn While You Learn’ with a view to inculcate appropriate tourism travel traits and knowledge amongst trainees to enable them to work as ‘student volunteers’.\n\n**Features/Benefits of the scheme:**\n\n* Provides opportunity to students to earn some extra pocket money during college days.\n* Chance to get work experience and hands-on training while studying.\n* College drop-out rate due to financial issues will come down considerably.\n* It will prepare the students to take up jobs in future and expose them to the outside world.\n\n**Need of the scheme to be strengthened:**\n\n* It is expected to facilitate the ease of doing business by providing a steady supply of skilled workforce to the industry and services.\n* It will lead to improvement in quality and market relevance of manpower.\n* It helps students to recognise and understand their choices and preferences and help them build their career.\n\nMore awareness about this kind of initiatives by the government should be generated. The success of this scheme will help India reap its demographic dividend to its fullest.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_2_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**6. The Gati-Shakti Yojana needs meticulous co-ordination between the government and the private sector to achieve the goal of connectivity. Discuss.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "PM Gati-Shakti is a transformative approach for economic growth and sustainable development. The approach is driven by 7 engines, namely: Railways, Roads, Ports, Waterways, Airports, Mass Transport, Logistics Infrastructure.\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2022_PAPER_2_Q6_IMG_1.jpg)\n\nThe approach is powered by Clean Energy and Sabka Prayas - the efforts of the Central Government, the state governments, and the private sector together - Leading to huge jobs and entrepreneurial opportunities for all.\n\n**Need for the Government and the Private sector coordination:**\n\n* Improving quality and efficiency of services delivery.\n* Exchange of expertise and managerial competence.\n* Driving investments and Finance availability.\n* Mobilisation of additional resources for activities.\n* Fostering entrepreneurship and innovation and technology development.\n* Ensuring optimal utilization of government investment and infrastructure.\n* Cost-effectiveness and competitiveness.\n* Addressing structural issues and environmental issues\n* Promote co-ordination, collaboration and cooperative development.\n\n### Way forward\n\n* Feasibility mapping of the project needs strengthening.\n* Utilization of viability gap funds to ensure financial viability of the project\n* Prudent fiscal reporting and monitoring of risk allocations with all stakeholders.\n* Move the PPP model to the next level of maturity with redesigning.\n\nThe projects pertaining to these 7 engines in the “National Infrastructure Pipeline” will be aligned with PM Gati-Shakti framework. It will ensure Indian infrastructure’s embrace of digital technology, which will improve overall project execution and efficiency.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_2_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**18. The Right of Children to Free and Compulsory Education Act, 2009 remains indadequate in promoting incentive-based system for children's education without generating awareness about the importance of****schooling. Analyse.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "The Right to Education Act 2009 (RTE Act 2009) was enacted by the Parliament of India on 4th August 2009. It provides for free and compulsory education for children aged between **6-14 years** under **Article 21(A)** of the Constitution of India. **India is one of the 135 countries** to have made education a fundamental right for every child.\n\n**Main Features of RTE Act 2009**\n\n* **Compulsory and free education** for all up to **class 8.**\n* Maintain proper norms and standards relating to   \n  + Pupil-Teacher-Ratios\n  + Classrooms\n  + Separate toilets for girls and boys\n  + Drinking water facility\n* **Special provisions** for admission of children out of school. They will be admitted to an age-appropriate class.\n* **Zero tolerance** against discrimination and harassment.\n* **No child** can be held back or expelled from school till Class 8.\n* All private schools to **reserve 25 % of their seats** for children belonging to socially disadvantaged and economically weaker sections.\n\n**Incentives provided to encourage parents and children to complete education**\n\n* **Free of cost** textbooks, uniforms and stationary items.\n* **Mid-Day Meal scheme (PM Poshan):** The scheme covers 11.80 crore children across Classes 1 to 8.\n* **Sarva Siksha Abhiyan**   \n  + To add **additional classrooms, toilets and drinking facilities.**\n  + Providing education to the **differently abled or children** with special needs.\n  + **To bridge the digital gap** by offering computer education to the children.\n* **Strengthening for providing quality Education in Madrassas (SPQEM)**   \n  + To bring about **qualitative education** and follow National Education System standards in subjects.\n  + Providing **Science labs, Computer labs** in the secondary and higher secondary stage madrasas.\n\n**Key issues for achieving RTE**\n\n* Lack of awareness among **child labourers, migrant children, differently abled children** about free educations, books, uniforms and other incentives.\n* Lack of awareness about **25% reservation** for disadvantaged sections of the society.\n* Lack of awareness about the **fundamental right Article 21A.**\n* **Minorities children** especially the poor class are unaware for special provisions under the **SPQEM scheme.**\n\n**Steps Need to Be Taken to Create Awareness**\n\n* **Campaign:** The representative of **local bodies and Sarpanch** of Panchayats should organise campaign in their local areas.\n* **Awareness** can be done with the help social media platforms like Facebook and YouTube.\n* The **Government teachers** should be visit to the backward areas to aware people about the incentives provided by the government like mid-day meal.\n\nIt has been twelve years since the implementation of RTE Act, but it still has a long way to go to be called successful in its purpose. All parents want their child to get quality education and food, but due to limited awareness, deserving children are missing out of school. Hence, digital media campaign can change the scenario and India’s demographic dividend will turn into asset for the nation.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_2_Q1",
      "serial_no": "1",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**1. \"Constitutionally guaranteed judicial independence is a prerequisite of democracy.\" Comment.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Judiciary, legislature and executive are the pillars of a democratic nation, sharing powers amongst themselves. In this, a judiciary free from the orders and whims of executive and legislature is of utmost importance for retaining and practising values of the constitution.\n\n### Why judicial independence?\n\n* Separation between executive and judiciary must be maintained to relieve the courts of any political biasness that might hamper justice for anyone.\n* A court’s verdict must be based solely on facts and not the perceived reality or partiality of the judge ensuring impartial judgement.\n\n### Why constitutionally backed judicial independence is important?\n\n* The judicial system works under the constitution. It is righty referred to as the guardian of the constitution, having the power as the final authority on its interpretation.\n* Unless the independence of the judiciary is constitutionally backed, it can be easily curtailed by the legislature or an executive order.\n\n**Provisions under the constitution**\n\n* Non-interference of legislature in the appointment of judges.\n* Fixed tenure of the judges.\n* Due process of impeachment for removal of a sitting judge.\n* Parliament cannot discuss the conduct of judges.\n* Charging of the salaries and allowances on the Consolidated Fund of India, thereby no need for legislative approval.\n\nThrough various provisions of the Constitution, India retains an unrestricted yet discipled judiciary that is relied on by the entire country with reverence.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_2_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**2. Who are entitled to receive free legal aid? Assess the role of the National Legal Services Authority (NALSA) in rendering free legal aid in India.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Voltaire rightly said, “It is better to save a guilty man than to condemn an innocent one.” Judicial justice forms the bedrock of a strong democratic nation. A proper and equitable availability of judicial justice to all citizens as envisaged under Article 39A is delivered by the National Legal Services Authority (NALSA).\n\n### Who can receive assistance?\n\n* A member of a Scheduled Caste or Scheduled Tribe\n* A woman or a child\n* A victim of trafficking or begar as per Article 23\n* A mentally ill or otherwise disabled person\n* A victim of a mass disaster, ethnic violence, caste atrocity, flood, drought, earthquake or industrial disaster\n* An industrial workman\n* People earning less than a stipulated amount of annual income which differs across states.\n\n**Role of NALSA in giving free legal services in India**\n\n* Organising ‘Lok Adalat’ as alternate dispute redressal mechanism in districts, which help in cordially settling a dispute.\n* Through school legal literacy clubs, Nyaydeep Newsletter and other programmes, NALSA works at enhancing legal literacy and awareness among masses.\n* Increasing accessibility through Lok Adalat, legal services app, and legal aids clinic.\n* Outreach programmes for undertrials and prisoners are also done, providing assistance and increasing awareness among them, for example, Haq Hamara campaign.\n\nNALSA has done a great job at making legal aid available to the most disadvantaged sections of the society. However, for a society as big and diverse as India, there is still a long way to go for achieving equitable justice for all.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_2_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**6. The crucial aspect of development process has been the inadequate attention paid to Human Resource Development in India. Suggest measures that can address this inadequacy.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Human resource is the keystone of the progress of a country. Insufficient attention, on this part of development has resulted in a massively undertrained population that finds it hard to exploit professional opportunities among other issues.\n\n**Measures for tackling inadequacy**\n\n* **Education:** Investing adequately in education to the tune of 6% of GDP, as proposed under New Economic Policy, will provide excellent returns. Scholarships by governments and various other programs also need to be made widely accessible.\n* **Skill Development:** Vocational skills and other upskilling opportunities are essential for increasing employability. For example, Bangladesh skilled a lot of people and used them in their industry to skyrocket their GDP.\n  + Skill India is a great initiative that needs to be tuned well to the needs of industry.\n* **Healthcare:** More focus on availability of medicines, functioning of hospital and overall availability of healthcare to entire population under schemes such as Ayushman Bharat is an imperative.\n* **Gender Sensitivity:** Implementation of schemes such as ‘Beti Bachao, Beti Padhao’, that are gender sensitive are imperative for development of a holistic human resource pool.\n\nAlthough India is a developing nation with a young, vibrant population, if adequate attention is not paid on developing it, a massive demographic dividend could be lost.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_2_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**9. ‘Virus of Conflict is affecting the functioning of the SCO'.**  **In the light of the above statement, point out the role of India in mitigating the problems.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "The Shanghai Cooperation Organization (SCO) has emerged as a major non-western security alliance encompassing majority of the world's population, that aims to promote peace in Eurasia. It is bound to have issues within itself, considering the varied nature and interests of its members.\n\n**Conflicts within SCO**\n\n* **India and Pakistan:** India’s long-lost cousin never seems to want to end its conflict with its neighbour.\n* **India and China:** China’s aggressive stance of claiming territories of its neighbours as its own has led to problems with its adjacent nations including India.\n  + The Belt and Road Initiative (BRI) too is a problem since it violates India's territorial integrity and is also seen as an aggressive debt-trap move.\n* **Economic Disparities:** With members having huge income disparities, internal friction is bound to arise.\n\n**How India can mitigate problems**\n\n* **Dialogue Promotion:** India has been known as a proponent of dialogues and diplomatic solutions.\n* **Cultural Diplomacy**: India enjoys a great number of cultural ties with most of the SCO countries. India should look to properly leverage this soft power.\n* **Backchannel Diplomacy**: Track II diplomacy can help create environment conducive for conflict management.\n* **Joint-military Exercises:** These are a great way to familiarise militaries and create healthy relations between nations. For example, Joint SCO anti-terror drill.\n\nIndia’s role in mitigation of various SCO conflicts can be immense considering its values of ‘Vasudhaiv Kutumbakam' and historical policies such as Panchsheel and non-alignment.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_2_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**18. Skill development programmes have succeeded in increasing human resources supply to various sectors. In the context of the statement, analyse the linkages between education, skill and employment.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Education, skill and employment are three very closely linked activities that are crucial for an individual and imperative for nation building.\n\n**Linkages between education, skill and employment**\n\n* Education acts as a beginning step for the basis of a civil life. It is crucial for adequate development of an individual and gives a citizen the basis to gain rightful employment.\n  + Basic and higher education plays respective roles in equipping individual with a knowledge base, upon which they can gain specialised knowledge for a profession.\n* Skill development is the activity of garnering necessary vocational or technical skills that have direct applicability in an industry thereby leading to successful employment. For example, certification of C++ can offer better chances of employability.\n  + Soft skills are a subset of skills that have garnered interest in the past decades and are essential today for modern job market.\n  + Skill development can also lead one not only to employment but also entrepreneurship that enables one to create jobs eventually.\n* Employment is the eventual goal of education and skill development. Employment is necessary for the growth of a nation. Employment is a necessary indicator of the health of an economy. Better employment shows higher prospects of growth for the nation.\n  + Both education and skill development train an individual adequately to help them get employed.\n  + Companies today follow a pattern of upskilling a hired person to make them better at their job.\n\nVarious skill development programmes such as Pradhan Mantri Kaushal Vikas Yojana and National Skill Development Mission have helped the industry receive skilled workers; in other words, they have succeeded in increasing human resources supply to various sectors.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**11. Most of the unemployment in India is structural in nature. Examine the methodology adopted to compute unemployment in the country and suggest improvements.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "Structural unemployment is basically an involuntary unemployment that occurs because of a structural change in the economy, such as the development of a new technology or industry or due to the mismatch in skills possessed by the populations and the job available in the market.\n\nMajor reasons for structural unemployment in India include labour market rigidities, geographic mismatch, agriculture dependency, infrastructure bottlenecks, and regulatory challenges.\n\n**Methodology adopted to compute unemployment in the country**\n\n* **Computation by NSSO using:**\n  + **Current Weekly Status (CWS):** Under this, a shorter reference period of a week is adopted. Individuals are counted as employed if they have worked for at least one hour on at least one day in the preceding seven days. For example, Labour Force Participation Rate in CWS in urban areas for persons aged 15 years and above increased to 48.2 per cent in the October-December quarter of 2022.\n  + **Usual Principal and Subsidiary Status (UPSS):** It is determined based on the activity one spent the most time in the previous year.\n  + **Current Daily Status:** It indicates the number of people who did not find work for one or more days in a week.\n* **Labor Bureau Surveys:** Labor Bureau conducts survey to obtain data on unemployment and employment in India. For example, All-India Quarterly Establishment-based Employment Survey (AQEES).\n\n### Way forward\n\n* **Increase in Frequency of Surveys:** It is important to ensure timeliness and updating of the surveys as increased frequency provides better understanding of changing employment trends.\n* **Modernizing Agriculture:** Increase in investment in agriculture could have a multiplier effect through backward and forward linkages, e.g., promoting cold storages.\n* **Incorporation of Informal Sector**: More than 80 percent of the labour force is employed in informal sector which needs to be incorporated in the formal sector.\n* **Seasonal Adjustments:** Improve seasonal adjustment techniques to account for the impact of agriculture and other seasonal employment trends.\n\nTo conclude, it is high time that certain computational methodologies need to be enhanced to envisage making India as one of the largest economies and nurture the rich demographic dividends with few bottlenecks and unemployment hurdles.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**16. What is the main task of India’s third moon mission which could not be achieved in its earlier mission? List the countries that have achieved this task. Introduce the subsystems in the spacecraft launched and explain the role of the ‘Virtual Launch Control Centre’ at the Vikram Sarabhai Space Centre which contributed to the successful launch from Sriharikota.**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "The Chandrayaan-3 created history for India and the world by doing the first soft landing on the south pole of moon. India joined the United States, Russia, and China to become the 4th nation to land on the moon.\n\nThe Chandrayaan-3 comprised the Vikram Lander and Pragyaan Rover. The rover aims to move around the landing site conducting experiments and sending data to the lander which in turn will send data to the orbiter that will eventually be communicated back to the earth. The Chandrayaan-3 could become a game-changer because the ‘permanently shadowed regions’ near the South Pole may contain potential water-ice and resources. For this, the various subsystems onboard Chandrayaan-3 seek to undertake several experiments.\n\n**Lander payloads**\n\n* **Chandra’s Surface Thermophysical Experiment (ChaSTE):** It measures thermal conductivity and temperature.\n* **Instrument for Lunar Seismic Activity (ILSA):** It measures the seismic frequencies around the landing site.\n* **Langmuir Probe (LP):** It estimates the plasma density and its changes over time.\n\n**Rover payloads**\n\n* **Alpha Particle X-ray Spectrometer (APXS)**: It determines elemental composition of lunar soil and rocks.\n* **Laser Induced Breakdown Spectroscope (LIBS)**: It derives chemical composition and infers mineralogical composition of lunar surface.\n\n**Propulsion module payload**\n\n* **Spectro-polarimetry of HAbitable Planet Earth (SHAPE)**: It aims to study exo-planets for habitability.\n\n**Role of Virtual Launch Control Centre**\n\n* **Nerve centre of the operation:** All procedures and operations of the launch and the mission are controlled from this place.\n* **Master control:** In case of any abnormalities, safety protocols or the final abortion of the mission can be initiated from here.\n\nWith the success of Chandrayaan-3, India can now look forward to the sample retrieval from the moon surface under Chandrayaan-4 mission that will help deepen our understanding of the lunar surface. The morale boost from a successful landing has also provided the much-needed motivation for further missions.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q2. Estimate the contribution of Pallavas of Kanchi for the development of art and literature of South India. (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "### Approach:\n\n* **Introduced** by mentioning the Pallavas' reign in South India.\n* Discuss Pallavas' Contributions to temple art, architecture and sculpture. Also, mention Pallavas' Contributions to Literature.\n* Conclude suitably.\n\n### Introduction\n\nThe Pallavas ruled from the 3rd to the 9th century CE. They were feudatories of the Satavahanas. The Pallava kings were great patrons of South Indian arts, architecture, and literature.\n\n### Pallavas' Contributions to Art\n\n* **Temple Architecture:** The Pallavas **introduced rock-cut temples and pioneered the Dravidian style of architecture**, evolving from cave temples to monolithic rathas, and finally to structural temples, developed in four stages.\n  + **Mahendravarman I** introduced the rock-cut temples.\n  + **Monolithic rathas and Mandapas**at Mamallapuram, credited to Narasimhavarman I. Eg, Panchapanadava rathas.\n  + Rajasimha introduced structural temples constructed from soft sandstone. E.g., Kailasanatha temple at Kanchi.\n  + Structural temples built by the later Pallavas. Eg, Vaikundaperumal temple.\n* **Sculpture:** The Pallavas significantly advanced sculpture like Open Art Gallery at Mamallapuram and Descent of the Ganges.\n* The Paintings at the caves of Sittannavasal belonged to them.\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_1_Q2_IMG_1.png)\n\n### Pallavas' Contributions to Literature\n\n* Pallava kings Mahendravarman I as a patrons of **Sanskrit literature authored the play \"Mattavilasa Prah****asana”****.**\n* **Tamil Literature** flourished with contributions from the Nayanmars and Alwars.\n* **Perundevanar** translated the Mahabharata into Tamil as *Bharathavenba* under Nandivarman II.\n\n### Conclusion:\n\nThe Pallavas of Kanchi laid a rich cultural legacy through their contributions to architecture, sculpture, and literature. Their innovations in temple architecture and patronage of literature not only influenced South Indian art but also had a lasting impact on Indian cultural history.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q.16 What is a twister? Why are the majority of twisters observed in areas around the Gulf of Mexico? (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "### Approach\n\n* Introduce the answer by defining Twisters.\n* Mention the reasons of frequent occurrence of twister in Gulf of Mexico\n* Conclude by summarizing key points.\n\n### Introduction\n\nA twister (tornadoes) is a violent windstorm featuring a twisting, **funnel-shaped cloud.** It consists of a rotating column of air that connects the Earth's surface to a **cumulonimbus cloud,** or occasionally a cumulus cloud. They can occur globally but are most common in the Gulf of Mexico region.\n\n### Body:\n\n**Factors that lead to frequent occurrence of Twisters in Gulf of Mexico:**\n\n* **Warm, Moist Air:** The Gulf of Mexico supplies warm, moist air that rises, creating conditions for thunderstorms.\n* **Cold, Dry Air:** Cold, dry air from the Rocky Mountains or Canada moves south, clashing with warm, moist air and causing atmospheric instability.\n* **Wind Shear:** Variations in wind speed and direction at different altitudes create wind shear, leading to a horizontal spinning effect essential for tornado formation.\n* **Geographical Features:** The flat terrain of the Great Plains and Mississippi River Valley heats quickly, providing ideal conditions for tornadoes.\n* **Tropical Storms and Hurricanes:** The Gulf is prone to tropical storms and hurricanes that can spawn tornadoes upon landfall.\n\n### Conclusion\n\nThus twisters, or tornadoes, are destructive windstorms formed by rotating columns of air. The Gulf of Mexico region experiences frequent tornadoes due to the collision of warm, moist air with cold, dry air, along with favorable geography and seasonal patterns.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_2_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**Q 17. In a crucial domain like the public healthcare system the Indian State should play a vital role to contain the adverse impact of marketisation of the system. Suggest some measures through which the State can enhance the reach of public healthcare at the grassroots level. (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "### Approach\n\n* **Introduction:** Start with the current state and valuation of India's healthcare sector, highlighting the concerns of marketization.\n* **Body:** Discuss the role of the state in addressing marketization through regulation, provision of services, and community-focused initiatives to enhance public health access.\n* **Conclusion:** Emphasise the need for the state to uphold the right to health and ensure equitable access in light of market pressures.\n\n### Introduction\n\nIndia's healthcare sector reached **USD 372 billion in 2023,** with the **private sector dominating** secondary and tertiary care (major concentration in metros, tier-I, and tier-II cities). The increasing marketization raises concerns by viewing **health as a commodity,** prioritising profits over patient welfare, potentially **compromising care quality** and exacerbating healthcare access inequalities.\n\n### Body\n\n**Role of the State in Containing the Adverse Impact of Marketization of the Healthcare System:** \n\n* **Right to Health: Article 21 of the Constitution** includes the right to health, requiring the state to protect this right amid marketization pressures that may lead to **inequality and service degradation.**\n* **State as a Benefactor:** Ensures healthcare **services are available to all,** especially vulnerable groups, through public hospitals and subsidized care schemes like the **Central Government Health Scheme (CGHS)**.  \n  + Establishes quality standards and patient satisfaction measures, maintaining dignity and rights.\n* **State as a Regulator:** Through the **Indian Medical Council (Professional Conduct, Etiquette and Ethics) Regulations, 2002** the state sets norms to prevent profit-driven service degradation and protect citizens.\n* **State as a Facilitator:** Facilitate PPP to enhance service delivery serving underserved areas. It mobilises funds for equitable healthcare financing.\n\n**Measures to Enhance Public Healthcare Reach at the Grassroots Level:** \n\n* The state should train **community health workers (ASHAs, ANMs)** to act as bridges between the healthcare system and the community, **facilitating health education and early disease detection.**\n* Expand the operationalization of **Ayushman Bharat Health and Wellness Centres** to ensure comprehensive primary healthcare services, including preventive, promotive, and curative care. \n  + Utilise the **15****th** **Finance Commission's grants** to strengthen local health systems and enhance community-specific health initiatives.\n* Implement  initiatives like **Pradhan Mantri Janjati Adivasi Nyay Maha Abhiyaan** to target low immunisation coverage areas, especially in tribal and hard-to-reach regions, ensuring effective prevention.\n* Additionally, establishing **new medical colleges in aspirational districts,** using **Rural Health Statistics for data-driven decisions**, and integrating telehealth services will further enhance healthcare accessibility and effectiveness.\n\n### Conclusion\n\nThe state should utilise marketization to enhance competition and deliver affordable, high-quality healthcare, prioritising patient welfare and improving access for vulnerable populations.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_3_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**Q.16 What are asteroids? How real is the threat of them causing extinction of life? What strategies have been developed to prevent such a catastrophe? (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "HealthAndEducation"
    },
    "solution": {
      "explanation": "### Approach:\n\n* Introduce briefly about Asteroids\n* Mention the threats posed by asteroids and the strategies developed to prevent them\n* Conclude Suitably\n\n### Introduction:\n\nAsteroids (minor planets) are rocky, airless remnants from the early formation of the solar system, approximately 4.6 billion years ago, primarily **found orbiting the Sun between Mars and Jupiter** in the main asteroid belt.\n\n### Body:\n\n**Threats Posed by Asteroids**\n\n* **Historical Impact:** A large asteroid struck earth 66 million years ago, leading to the extinction of the dinosaurs and other species.\n* **Localized Devastation:** Smaller asteroids can cause significant localized damage, triggering tsunamis, wildfires, and atmospheric disruptions.\n  + The explosion over the **Chelyabinsk meteorite(Russia)** in 2013, caused destruction around the city and injured many people.\n  + The **Tunguska event(1908)** was a massive explosion in Siberia(Russia), making it the largest recorded impact event.\n* **Space Debris**: A fragmented asteroid could create hazardous space debris, threatening satellites, space stations, and future space missions.\n\n**Strategies Developed to Prevent an Asteroid Impact Catastrophe**\n\n* **Asteroid Detection and Monitoring**\n  + Space agencies like NASA, ESA, and other organisations actively monitor and catalogue asteroids that could pose a threat to Earth.\n  + **Surveys and Telescopes:** Ground-based and space-based telescopes, such as **NASA’s NEOWISE mission,** track NEOs and assess potential impact risks.\n* **Deflection Missions**\n  + **Kinetic Impactor**: NASA's Double Asteroid Redirection Test (DART) mission was the first to test asteroid deflection for planetary defence by smashing a spacecraft into an asteroid.\n  + **Gravity Tractor:** A spacecraft could use its gravitational pull to slowly alter an asteroid's path over time without making direct contact.\n* **Nuclear Detonation**\n  + In extreme cases, detonating a nuclear device near an asteroid could break it apart or push it off its collision course, although this approach carries risks of fragmentation.\n* **Futuristic Approach:**\n  + ISRO **plans to study an asteroid in 2029** to improve planetary defense, potentially collaborating with the **Apophis asteroid mission**, which involves JAXA, ESA, and NASA.\n\n### Conclusion:\n\nWhile asteroids pose a threat, advancements in detection, deflection, and global cooperation are improving planetary defense, ensuring better preparedness and future opportunities for asteroid resource utilisation.",
      "explanation_format": "markdown"
    }
  }
]