[
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_1_Q13",
      "serial_no": "13",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**13. Discuss the concept of air mass and explain its role in macro-climatic changes. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "An air mass is a large volume of air in the atmosphere that is mostly uniform in temperature and moisture. Air masses can extend thousands of kilometers across the surface of the Earth, and can reach from ground level to the stratosphere—16 kilometers (10 miles) into the atmosphere.\n\nAir masses form over large surfaces with uniform temperatures and humidity, called source regions. Low wind speeds let air remain stationary long enough to take on the features of the source region, such as heat or cold. Meteorologists identify air masses according to their place of origin.\n\nThere are four categories of air masses: arctic, tropical, polar and equatorial. Arctic air masses form in the Arctic region and are very cold. Tropical air masses form in low-latitude areas and are moderately warm. Polar air masses take shape in high-latitude regions and are cold. Equatorial air masses develop near the Equator, and are warm.\n\n**Role of Air mass in Macro Climate Changes**\n\n* The properties of an air mass which influence the accompanying weather are **vertical distribution temperature** (indicating its stability and coldness or warmness) and the **moisture content**.\n* The air masses carry atmospheric moisture from oceans to continents and cause **precipitation** over landmasses.\n* They transport **latent heat,** thus removing the latitudinal heat balance.\n* Most of the migratory atmospheric disturbances such as temperate cyclones and storms originate at the **contact zone** between different air masses and the weather associated with these disturbances is determined by characteristics of the air masses involved.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_1_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**14. “The Himalayas are highly prone to landslides.” Discuss the causes and suggest suitable measures of mitigation. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Landslides are simply defined as the mass movement of rock, debris or earth down a slope and have come to include a broad range of motions whereby falling, sliding and flowing under the influence of gravity dislodges earth material. They often take place in conjunction with earthquakes, floods and volcanoes. In the hilly terrain of India including the Himalayas, landslides have been a major and widely spread natural disaster that often strike life and property and occupy a position of major concern. Example: the Uttarakhand tragedy.\n\nThe reason why Himalayas are particularly vulnerable to landslides is because the mountain belt comprises of tectonically unstable younger geological formations subjected to severe seismic activity. The slides in the Himalayas region are huge and massive and in most cases the overburden along with the underlying lithology is displaced during sliding particularly due to the seismic factor. The landslide-prone Himalayan terrain also belongs to the maximum earthquake-prone zones and thus is also prone to earthquake-triggered landslides. The slopes of the mountains have immature and rugged topography, high seismicity and high rainfall, all contributing to the region's high vulnerability to landslides.\n\nLike any other natural hazard they can't be entirely eliminated. The damage however can be reduced by planning and disaster management. This can be done through:\n\n* Treating vulnerable slopes and existing hazardous landslides.\n* Restricting development in landslide-prone areas.\n* Preparing codes for excavation, construction and grading.\n* Protecting existing developments.\n* Monitoring and warning systems.\n* Putting in place arrangements for landslide insurance and compensation for losses.\n\nAbove measures, if integrated in development and planning of Himalayan states will ensure sufficient protection against tragedies like Uttarakhand floods.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_1_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**15. The effective management of land and water resources will drastically reduce the human miseries. Explain. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "The twin problems of recurrent drought in Maharashtra- Telangana region resulting in suicides and furore over displacement of residents following forcible land acquisitions hold a common thread - increasing demand and avid scarcity of resources. While from the advent of life on earth water is a sin qua non for survival, exponential increase in population has put pressure on land too. Thus effective management of these two resources is important for mankind’s survival which involves the smart utilization of land and water for various purposes such as.\n\n* **Economic:** Balancing industrialisation needs with that of land for cultivation. Thus as far as possible cultivable land should be left for agricultural purposes.\n* **Social:** Land is required for settlement. Amid population explosion and transition of economy (Rostow’s model) has created urban clusters which if not managed will lead to slums development. Thus instead of a growth pole for industrialisation, India needs to develop more cities, industrial complexes.\n* **Ecological:** Land development for ecological needs such as forestry, wetland, biodiversity rich parks etc. would stabalise the gene pool and the food web. At all tropical levels effective management of water involves these components.\n* Recycling and reusing waste water through treatment.\n* Storing excess water (rain water harvesting, building canals and reservoirs)\n* Smart Agriculture (micro irrigation, hydroponics)\n* Minimising water pollution through sewage treatment as well as treating industrial water before release.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_1_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**16. South China Sea has assumed great geopolitical significance in the present context. Comment. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "South China Sea is a marginal sea of Pacific Ocean having the area of 3,500,000 square kilometer situated on the south of China. South China Sea has been “apple of discord” between US and China in international affairs for decades. Not only US-China rivalry but also regional countries have been motivated to involve on the territory as it’s one of the lucrative territories in both geopolitical and strategic dynamics. Now, it has become a global issue even small countries are involving vis-à-vis position. Philippine already has gone to Permanent Court of Arbitration against China and the court verdict is in favour of its claim.\n\n**Geopolitical significance of South China Sea**\n\n* South China Sea is the sea route for 50% global trade. It is the link between the Pacific Ocean and Indian Ocean. Malacca strait is the economical sea passage of Persian Gulf. Thus it becomes an imp Sea Lanes of Communications (SLOC) for US, China, Japan, Korean Peninsula and East Asian countries.\n* It’s the territory where a vast number of gas, petroleum and mineral resources are preserved, hence SCS attains strategic place as energy store house, important for both developed and developing countries.\n* South China Sea covers 12% of global fish products. China, Philippine, Vietnam etc produce a huge number of fisheries resources.\n* There are some other valuable materials like Limonite, Monazite, Zircon, Cassiterite, Arenaceous quartz etc. which are very important raw materials for industries. South China Sea is also rich in salt.\n\nWhile geopolitics indicates geographical relations with politics, it also has strategic importance. The power politics, military interests have made South China Sea important. The concept of Exclusive Economic Zone could be another conflicting zone between China and its neighbours.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_1_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**17. Major cities of India are becoming vulnerable to flood conditions. Discuss. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Indian cities like Mumbai, Kolkata and Chennai are being continuously deluged by the floods, throwing the amenities of urban life to question. Along with climate change, that has resulted in such unexpected monsoon spills, the other reasons that can be attributed to it are:\n\n* Haphazard and rapid urbanization without proper planning has put the natural carrying capacity of cities under stress, severely limiting their drainage capacity.\n* Improper and unregulated urbanization has also led to failure of civic authorities to manage drainage resulting in poor sewage treatment, clogging of drains and sewer lines thus intensifying drainage problem during monsoon.\n* Urbanization and associated activities like dredging, spilling on to the fragile coastal and river beds, thus hampering their natural absorptive capacity.\n* Destruction of wetlands in and around cities which act as natural absorbers of excess runoff during monsoons.\n\n*To prevent such flooding of cities, following measures need to be taken:*\n\n* Proper urban planning along with provisions for efficient drainage system.\n* Strict regulations on construction in fragile coastal and riverbed systems.\n* Rainwater harvesting systems should be put up.\n* Timely preparedness and precautions should be taken by the municipal bodies like cleaning of drainage systems, traffic management, out flow provisions for excess water before onset of monsoons.\n* Disaster management team to be put in place to chalk out pre and post disaster responses to minimize losses due to such eventualities.\n\nApart from above measures, robust implementation of Sendai framework for Disaster Risk Reduction 2015-30,effective utilization of government schemes like AMRUT, Smart Cities and further impetus on Coastal Zone Management and Regulation should be undertaken to deal with such challenges.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_2_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**12. In the integrity index of Transparency International, India stands very low. Discuss briefly the legal, political, social and cultural factors that have caused the decline of public morality in India. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Corruption is a global phenomenon and it is omnipotent. It has progressively increased and is now rampant in our society. As the nation grows, the corrupt also grow to invent new methods of cheating the government and public. India was placed at 76th position out of 168 countries with a score of 38 out of 100 in Transparency International’s Corruption Perceptions Index 2015. The causes of corruption are many and complex. Some of them are:\n\n**Legal**\n\n* Lack of enforcement capacity and regulatory complexity are deep causes of India’s institutions. Complex laws and procedures deter common people from seeking help from the Government.\n* Many laws and rules have become obsolete and breeds corruption, long delay in judicial proceedings and less severity of punishment, multiple investigative agencies with overlapping jurisdiction such as Lokpal, CVC, CAG etc.\n* Those in hierarchy vested with disciplinary powers shirk their duties and so unwillingness to use their powers against corrupt practices.\n\n**Political**\n\n* Emergence of political elite which believes in interest oriented rather than nation oriented programs and policies.\n* Inadequate regulation of political finance.\n* At the time of election, corruption reaches its peak. Big industrialists fund political parties to meet high cost of elections and ultimately seek personal favours. In order to get elected, politicians bribe poor, illiterate people.\n\n**Economical**\n\n* Artificial scarcity created by people with mal-intentions wrecks the fabric of the nation’s economy.\n* Vast size of population coupled with widespread illiteracy and poor economic infrastructure lead to increasing inequality that causes corruption in public life.\n* In a highly inflationary economy, low salaries of government officials compel them to resort to corruption.\n\n**Socio-Cultural**\n\n* Tolerance of people towards corruption, complete lack of intense public outcry against corruption and the absence of a strong public forum to oppose corruption allows corruption to rein in our society.\n* Lack of moral education, decreasing role of family in ethical values and teachings, sanskritization of corruption, social hierarchy, bribery etc. are some other socio-cultural factors.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**12. Discuss India’s achievements in the field of Space Science and Technology. How the application of this technology has helped India in its socio-economic development? (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "India embarked on developing space science and technology in an era when it was being criticized for spending money on such expensive technologies when it’s priority should be fighting rampant poverty that prevails.\n\nHowever, our visionary leaders like Nehru and scientists prevailed over such criticisms and led India onto a path of great technological achievements. It has shown its proverbs in the field through achievements like **Mars Orbiter Mission** at a cost ten times lower than US’s similar project, **Chandrayan mission** which made ISRO sixth space organization to send orbiter to moon, developing it’s own navigation system through **NAVIC (IRNSS)**. Thus ending its dependence on GPS. It has also made major strides in launch vehicles by developing **Reusable Launch Vehicle (RLV),** GSLV with indigenous cryogenic stage which made India self reliant in launching 2 ton class communication satellites, record launch of 20 satellites in 2016 etc.\n\nApart from being a mighty achievement, these achievements have also helped in socio-economic developments of the country. Through metrological data sent by satellites, it has been possible to gauge weather changes, arrival of monsoon and extent of rainfall, monitoring cyclones in advance which has helped farmers and citizens through advanced preparedness in general and in events of disasters. The communication satellites have enabled data connectivity to rural India eventually helped in digital India. NAVIC has made India self reliant thus saving resources, ensuring reliable data for army, farmers, tourists, navigators, fishermen.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**14. Rehabilitation of human settlements is one of the important environmental impacts which always attracts controversy while planning major projects. Discuss the measures suggested for mitigation of this impact while proposing major developmental projects. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Rehabilitation and Resettlement is one of the major challenges while planning the major developmental projects. To tackle this, Government has adopted National Rehabilitation and Resettlement policy to minimize displacement.\n\n* Its objectives are to promote as far as possible non-displacing or least-displacing alternatives, to ensure adequate rehabilitation package and expeditious implementation of the rehabilitation process with the active participation of affected families.\n* The right to fair compensation and Transparency in Land Acquisition, Rehabilitation and Resettlement Bill, 2015 also addresses the issue such as if private company acquires or purchase more than 50 acres of land in urban areas or 100 acres in rural areas it is required to rehabilitate and resettle affected families. This threshold can be circumvented by a private company by purchasing multiple parcels of land, each under the prescribed limit, through other entities.\n* The Singur judgement by the Apex court centered around the inept and illegitimate handling of power of Eminent Domain by the then Government. The Court said that it should not be left unacknowledged that when Eminent Domain is exercised the displaced persons is not provided with anything but cash compensation.\n* The Morse and Berger 1992 Report said that of the total displaced in the case of Sardar Sarovar dam project 58% were adivasis. These people did not possess formal title to their land and therefore could not claim compensation anyway.\n* Apart from all these measures, education facilities, health facilities should be taken care of displaced families should be resettled in groups that would protect their cultural and traditional rights.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**15. The frequency of urban floods due to high intensity rainfall is increasing over the years. Discussing the reasons for urban floods, highlight the mechanisms for preparedness to reduce the risk during such events. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Flooding and disruption have become the new normal for the monsoon season in urban India. Recent water logging in Gurgaon, urban flood in Mumbai and Srinagar shows the increasing intensity of urban flood disasters in India. These are some of the reasons of urban floods in case of Indian cities.\n\n* A special feature in India is heavy rainfall during monsoons. There are other weather systems also that bring in a lot of rain. Storm surges can also affect coastal cities/ towns.\n* The urban heat island effect has resulted in an increase in rainfall over urban areas. Global climate change is resulting in changed weather patterns and increased episodes of high intensity rainfall events occurring in shorter periods of time.\n* Stormwater drainage systems in the past were designed for rainfall intensity of 12–20 mm. These capacities get easily overwhelmed whenever rainfall of higher intensity is experienced. Further, the systems very often do not work to the designed capacities because of very poor maintenance.\n* Encroachments are also a major problem in many cities and towns. The flow of water has increased in proportion to the urbanization of the watersheds. Ideally, the natural drains should have been widened (similar to road widening for increased traffic) to accommodate the higher flows of stormwater. But on the contrary, there have been large scale encroachments on the natural drains and the river flood plains. Consequently the capacity of the natural drains has decreased, resulting in flooding.\n* Improper disposal of solid waste, including domestic, commercial and industrial waste and dumping of construction debris into the drains also contributes significantly to reducing drainage capacities.\n* Presence of impervious cover near trees and on road pavements also reduces water runoff.\n\nTo reduce these risk following measure can be taken:\n\n* Pre-Monsoon Desilting of drainage system.\n* Solid waste disposal and its proper management has significant effect on drainage performance and reduces the chances of choking of drainage system.\n* Protection and conservation of wetlands near urban habitats increase the water holding capacities and they also act as natural barriers against any surge in water level.\n* Rain water harvesting reduces the load of excess rain water of rain and help in mitigating urban floods.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_4_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**7. Anger is a harmful negative emotion. It is injurious to both personal life and work life. (2016)**  **(a) Discuss how it leads to negative emotions and undesirable behaviours.**  **(b) How can it be managed and controlled?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "**(a)** Anger is an emotion characterized by antagonism toward someone or something you feel has deliberately done you wrong. For many people anger results in negative emotions like irritability, rage, wrath, stress, resentment, hate, loss of confidence, depression etc. Further, anger prevents logical thinking. Usually decisions made in anger are made in haste, and don't hold up well to the light of day. One almost always regrets things said or done in anger.\n\n**(b)** Uncontrolled anger can lead to several problems—problems at work, in one’s personal relationships, and in the overall quality of one’s life. It is therefore important to manage anger before it leads to other serious problems.\n\nFor this, it is essential to understand one’s anger and why it happens. It is about learning and practicing better ways of expressing anger, and knowing how to prevent it from occurring in the first place. Specifically, anger management is about knowing the triggers and early warning signs of anger, and learning techniques to calm down and manage the situation before it gets out of control. A common strategy for managing anger is to distract one's mind from the situation. Try taking long deep breaths, counting to ten, playing soothing music, talking to a good friend etc.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**6. “In spite of adverse environmental impact, coal mining is still inevitable for development”. Discuss. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "India’s coal reserves, fourth largest in the world, provide it with a cheap source of energy. However, the mining of coal causes severe damage to the environment:\n\n* Pollution due to exposure of mining waste to air and water.\n* Coal mining results in methane emissions, a powerful greenhouse gas.\n* Fires from underground mines can burn for years, releasing smoke containing CO2, CO, NOx, SO2 etc.\n* Deforestation when trees are cut down or burned for clearing the way for a coal mine.\n\nDespite the damage caused by coal mining, it is expected to contribute the dominant share to India’s electricity production for decades to come. Even with annual growth rates above 10%, the share of renewable sources in India is unlikely to reach even 10% of the energy mix before 2040. (Solar energy still provides only about 1 per cent of the electricity generated in the country).\n\nIndia’s reliance on coal is expected to persist even in 2040s, with an envisaged share of 42%-50% in energy mix. A lower growth trajectory of renewable energy in view of the challenges and uncertainty of prices, storage costs, grid connectivity and parity make it over-ambitious to expect them to be central for India’s development.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**7. Mention the advantages of the cultivation of pulses because of which the year 2016 was declared as the International Year of Pulses by United Nations. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Despite the strong evidences of health and nutritional benefits of pulses, its consumption remains low in many developing and developed countries. Therefore, the United Nations declared the year 2016 as the International Year of Pulses to heighten public awareness of the nutritional benefits of pulses as part of sustainable food production aimed towards food security and nutrition.\n\n**Advantages of Cultivation of Pulses:**\n\n* Pulses are able to **increase biodiversity** as they are able to fix their own nitrogen into the soil, which increases soil fertility.\n* Introducing pulses into crop production can be key to increasing **resilience to climate change**.\n* Pulses also offer a great potential to lift farmers out of rural poverty, as they can yield two to three times **higher prices** than cereals, and their processing provides additional economic opportunities, especially for women.\n* Pulses are a powerful ally in achieving **food security**. They are economically affordable, can be grown in dry environments, and have a low food wastage footprint, as they can be stored for long periods without spoiling.\n\nTherefore, pulses contribute significantly in addressing hunger, food security, malnutrition, environmental challenges and human health and also are a vital source of plant-based proteins and amino acids.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**8. How does the cryosphere affect global climate? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Cryosphere is the frozen water part of the Earth system - snow cover, permafrost, sea ice. It impacts global climate in a variety of ways:\n\n* Snow and ice have a high albedo, reflecting back a significant amount of solar radiation back into space. In this way, cryosphere acts as an important cooling factor in the global climate system.\n* Snow and ice act as an insulating layer over land and ocean surfaces, holding in heat and moisture that would otherwise escape into the atmosphere. This insulation, then, also acts to cool the global climate.\n* Since cold polar seawater is dense due its high salinity and sinks to the bottom of the ocean, spreading out across the globe and acting as a pump which drives oceanic circulation that transfers energy between the equator and the poles – acting as a conveyor belt.\n\nThe cryosphere is highly vulnerable to global warming. Therefore, any change in its composition is likely to have great side-effects on the global climate.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**14. Account for variations in oceanic salinity and discuss its multidimensional effects. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Salinity refers to the amount of salt dissolved in 1000 gms of sea water. It is usually expressed as parts per thousand or ppt. The salinity for normal open ocean ranges between 33 o/oo and 37 o/oo. Oceanic salinity varies significantly due to the free movement of ocean water and its distribution has two aspects:\n\n* **Horizontal:** The areas of highest salinity (about 37o/oo, in Atlantic Ocean) are found near the Tropics due to active evaporation owing to clear skies, high temperature and steady Trade Winds.\n* From the tropical areas, salinity decreases both towards the equator and towards the poles. Salinity is relatively low near the equator (about 35 o/oo, in Atlantic Ocean) due to high rainfall, high relative humidity, cloudiness and calm air of the doldrums.\n* In polar seas, salinity decreases (20-32 o/oo) due to very little evaporation and due to melting ice yielding fresh water.\n* **Vertical:** Generally salinity decreases with increasing depth. Surface water is more saline due to loss of water from evaporation. This varies greatly with latitudes and is influenced by the cold and warm currents. In higher latitudes, salinity increases with depth and in middle latitudes it increases upto 35 meters and then decreases.\n* The multidimensional effects of oceanic salinity are as follows:\n* Salinity determines compressibility, thermal expansion, temperature, density, absorption of insolation, evaporation and humidity.\n* **Salinity & Water Cycle:** Water in liquid state dissolves rocks and sediments which creates a complex solution of mineral salts in ocean basins. Conversely, in other states such as vapor and ice, water and salt are incompatible and water vapor and ice are essentially salt free. By tracking ocean surface salinity we can directly monitor variations in the water cycle: land runoff, sea ice freezing and melting, and evaporation and precipitation over the oceans.\n* **Salinity, Ocean Circulation & Climate:** Ocean circulation in deep waters is primarily driven by changes in seawater density, which is determined by salinity and temperature. In the North Atlantic near Greenland, cooled high-salinity surface waters can become dense enough to sink to great depths.\n* **Salinity & Climate Density:** The ocean stores more heat in the uppermost three meters than the entire atmosphere. Thus density-controlled circulation is key to transporting heat in the ocean and maintaining Earth's climate. Excess heat associated with the increase in global temperature during the last century is being absorbed and moved by the ocean.\n* Ocean also influences the distribution of fish and other marine resources.\n* NASA studies suggest that sea water is getting fresher in high latitudes while saltier in sub-tropical latitude. This will significantly impact not only ocean circulation but also the climate in which we live.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**15. Petroleum refineries are not necessarily located nearer to crude oil producing areas, particularly in many of the developing countries. Explain its implications. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Oil refineries usually in developing countries are built away from the oil producing areas, the implications of which are both negative and positive, vis –a- vis environmental and economic costs:\n\n**Positive implications:**\n\n* Rrefineries tend to be situated closer to markets or distribution centres as it helps in saving transport costs of refined products because transport costs of refined products tends to be higher than transporting crude, as refined products lose weight through evaporation during transporting.\n* Since pipeline transfer of refined products in India is still only with private companies, it is not evenly distributed, making transportation through this method difficult. When refineries are far away from the market, other modes of transport for refined products like railways, road or waterways, always increases the economical as well as the environmental costs (eg. air pollution).\n* Since oil producing areas have a limited oil producing capacity the investments in setting up a refinery in its vicinity can go to waste once oil in the area dries up. Hence, it becomes economical to set up refineries near markets where a continuous consumer demand keeps it viable for longer durations of time.\n* Refineries also need abundant sources of water for cooling purpose and for discharge of wastes, and hence environmental concerns make refineries viable only where there are sufficient water resources available.\n* Promote decentralized industrial growth and balanced regional development.\n* Seaboard location eases the export of petrochemical products.\n\n**Negative implications:**\n\n* Having crude transported to large distances add to environmental pollution and economic costs.\n* Also, it does not incentivise further exploration and setting up of oil producing areas as it doesn't attract other industrial investments.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**16. In what way can floods be converted into a sustainable source of irrigation and all-weather inland navigation in India? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "India experiences monsoons for a period of four months during which sometimes incessant rains cause floods and devastation, while for the rest of the year it remains dry for most parts, often resulting in water shortages. This excess flood water can surely be used as a valuable resource in water scarce regions for the non-monsoon months, thereby solving the twin problems of flood and water scarcity. The following methods may be used to achieve this objective:\n\n* **River linking:** The government has been ambitious with this project of diverting excess water from overflowing rivers to rivers in non-perennial regions, in order to solve the problems of flood and water shortage. These river linking channels could also be useful as all-weather inland navigation waterways, thereby helping in creating a cheaper and pollution free mode of transport.\n* **Rain water harvesting:** The excess water can be captured and stored in wells, tanks etc. during rains as was practiced in many parts of India during medieval period (in form of stepwells/baolis etc).\n* **Multi-purpose projects/dams:** Dams can be erected in flood areas to capture excess water which can then be released slowly over the year as per irrigation requirements.\n* **Inundation canals and weirs:** Flood water can also be managed by making diversions through inundation canals, small irrigation structures, and with weirs that take away excess water to the agricultural fields.\n\nThe methods stated above, can go a long way in solving various water woes of India if implemented expeditiously and on a large scale.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**17. What characteristics can be assigned to monsoon climate that succeeds in feeding more than 50 percent of the world population residing in Monsoon Asia? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Some parts of the world experience seasonal winds like land and sea breezes but do so, on a much larger scale. There are tropical monsoon lands with on-shore wet monsoons in the summer and off-shore dry monsoons in the winter. They are best developed in Indian sub-continent, Myanmar, Thailand, Laos, Cambodia, parts of South China and Northern Australia.\n\n**Characteristics of Monsoon Climate**\n\n**Temperature:** Monthly mean temperature in Monsoon climate is above 18°C but temperature ranges from 15-45°C in summer and 15-30°C in winters. This temperature range helps in cultivating various crops such as wheat and rice, staple crop for the large population in the world.\n\n**Precipitation:** Monsoon is associated with high precipitation. Annual mean rainfall ranges from 200-250cm but varies according to the intensity of seasonal winds. It also helps in paddy cultivation.\n\n**Distinct season:** Seasons are chief characteristics of monsoon climate. Distinct seasons have been observed with the movement of sun between the Tropic of Cancer and Capricorn. It facilitates the cultivation of various types of crops.\n\n* **The Cool dry season:** Out blowing dry winds, the North-East Monsoon, bring little or no rain to the Indian sub-continent. It has been observed during October to February.\n* **The Hot dry season:** The temperature rises sharply with the sun’s northward shift to the Tropic of Cancer. Coastal regions are a little relieved by sea breezes.\n* **The Rainy season:** Rainy season has been observed during mid June to September. With the burst of the South-west monsoon in mid June, torrential downpours sweep across the country. Almost all the rain for the year falls within this rainy season.\n* This pattern of concentrated heavy rainfall in summer is a characteristic feature of the Tropical Monsoon climate.\n* **The Retreating Monsoon:** The amount and frequency of rain decreases towards the end of the rainy season. It retreats gradually southwards after mid September until it leaves the continent altogether.\n\nThe role of monsoon is vital in the economy of major parts of the world because it is the main source of irrigation in rain-fed areas and facilitates in feeding more than 50 percent of the world population residing in Monsoon Asia.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**9. Discuss the potential threats of Cyber attack and the security framework to prevent it. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "The benefits of cyberspace to citizens, businesses and governments are considerable and far reaching. While technologies are overwhelmingly created for positive use, they can be exploited as well. Crimes in cyberspace cost the global economy around $450 billion a year.\n\n**Potential threat**\n\nCyber attack is a particularly major threat to sectors identified under Critical Information Infrastructure (CII) that include financial systems, air traffic control and telecommunications.\n\nFirst, all the sectors identified as CII are dependent on connectivity. Debilitating attack on any one system can cause a cascading effect, disrupting the functioning of other systems.\n\nSecond, CII is highly dependent on industrial control systems, which depend on digital instructions. Any malicious takeover of these systems will not only disrupt but also seize functioning of CII.\n\nThird, many CII, such as air traffic control, is dependent on navigational data, which is especially vulnerable to spoofing. If the integrity of this data cannot be ensured, the input of false data can have disastrous consequences.\n\n**Security Framework**\n\nThe Indian government has also been aggressively addressing the rising prevalence of cyber threats.  National Cyber Security Policy 2013 has been framed to create a secure cyber ecosystem, ensure compliance with global security systems and strengthen the regulatory framework. The union budget for 2017 included the formation of Computer Emergency Response Team (CERT) for the financial sector.\n\nThe government has also sought data security protocol details from several smart phone manufacturers insisting that mobile manufacturing units be security-compliant. The Technology Development Board and Data Security Council of India (DSCI) have jointly decided to promote cyber security startups in India.\n\nNASSCOM and DSCI Cyber security Task Force have also launched a roadmap to develop the cyber security ecosystem to $35 USD billion by 2025.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**16. Give an account of the growth and development of nuclear science and technology in India. What is the advantage of fast breeder reactor programme in India? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "India’s journey in the field of nuclear science and technology began with the formation of Department of Atomic Energy (DAE) in 1954. The aim was to harness nuclear resources for peaceful purposes. India had to surpass the obstacle of technology denial by capable nations.\n\nIn this background  three-stage nuclear power programme was formulated by Dr. Homi Bhabha in 1950s to secure country’s long term energy independence, through use of uranium and thorium reserves found in the monazite sands of coastal regions of South India.\n\nThe ultimate focus of the programme is on enabling thorium reserves of India to be utilised in meeting country's energy requirements. Thorium is particularly attractive for India, as it has not only around 1–2% of the global Uranium reserves, but one of the largest shares of global Thorium reserves at about 25% of the world's known Thorium reserves.\n\nThe three stages adopted were\n\n* Natural uranium fuelled Pressurized Heavy Water Reactors (PWHR)\n* Fast Breeder Reactors (FBRs) utilizing plutonium based fuel\n* Advanced nuclear power systems for utilization of Thorium\n\nAt present only stage 1 is operational and all 22 functional nuclear reactor in India belongs to this stage with total capacity of 6780 MW. At present, the fast breeder reactor programme in India is carried out by Indira Gandhi Centre for Atomic Research, Kalpakkam, Tamilnadu.\n\nThe advantage with a breeder reactor is that it generates more fissile material than it consumes. Also in the second stage, fast breeder reactors (FBRs) would use Plutonium-239, recovered by reprocessing spent fuel from the first stage, and natural uranium.\n\nThis technology does not contribute to air pollution, except during mining and processing of Uranium ore. Breeder reactors use a small core, which is important to sustain chain reactions. Besides, they do not even need moderators for slowing down neutrons, as they use fast neutrons.\n\nIn FBRs, plutonium-239 undergoes fission to produce energy, while the uranium-238 present in the fuel transmutes to additional plutonium-239. Furthermore, once a sufficient amount of plutonium-239 is built up, thorium will be used in the reactor, to produce Uranium-233. This uranium is crucial for the third stage.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**17. 'Climate change' is a global problem. How India will be affected by climate change? How Himalayan and coastal states of India will be affected by climate change? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Climate change is referred to a change in average weather conditions, or in the time variation of weather within the context of longer-term average conditions.\n\nClimate change has attracted attention recently particularly due to the changes apparent from the mid to late 20th century onwards and it is attributed largely to the increased levels of atmospheric carbon dioxide produced by the use of fossil fuels.\n\n* India due to its peculiar geography and developmental stage is one of the most vulnerable nations to climate change.\n* India is already experiencing a warming climate and erratic monsoon pattern, unpredictable rainfall since last few years.\n* Droughts are expected to be more frequent in some areas, especially in north-western India, Jharkhand, Orissa and Chhattisgarh.\n* Climate change is expected to have major health impacts in India- worsening the already high malnutrition and related health disorders such as child stunting - with the poor likely to be affected most severely.\n\n**Possible effects on Himalayan states**\n\n* With rise in average temperature, most Himalayan glaciers have been retreating over the past century. This may have severe impact on the delicate Himalayan ecology.\n* The melting of glaciers and the loss of snow cover over the Himalayas is expected to threaten the stability and reliability of northern India’s primarily glacier-fed rivers systems, particularly major river systems like the Indus, the Ganges and the Brahmaputra. This will adversely impact the ecology, livelihood and overall economy of Himalayan states.\n\n**Possible effects on coastal states**\n\n* India is close to the equator, the sub-continent would see much higher rises in sea levels in comparison to higher latitudes and most of coastal states will face the heat of climate change.\n* Kolkata and Mumbai, both densely populated cities, are particularly vulnerable to the impacts of sea-level rise, tropical cyclones, and riverine flooding\n* Sea-level rise and storm surges would lead to saltwater intrusion in the coastal areas, impacting agriculture, degrading groundwater quality and contamination of drinking water.\n\nBeing one of the most vulnerable countries to climate change, it is high time that India should take corrective and mitigating actions to cope up with the upcoming challenges of climate change.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**18. On December 2004, tsumani brought havoc on fourteen countries including India. Discuss the factors responsible for occurrence of tsunami and its effects on life and economy. In the light of guidelines of NDMA (2010) describe the mechanisms for preparedness to reduce the risk during such events. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "On December 26, 2004 the gigantic tsunami waves generated due to a great undersea earthquake off the coast of Banda Aceh, northern Sumatra. This earthquake occurred along a thrust fault in the subduction zone where the Indian tectonic plate was going below the overriding Burmese plate. As a result, the ocean floor broke and there was a vertical displacement of about 15 to 20 meters along the fault causing large scale displacement of water and thus, generating tsunami waves.\n\n* Typically, for an average ocean depth of 4 km, like in the Indian Ocean/Bay of Bengal region, the speed of the tsunami waves can go up to 720 km/h or about the speed of a jet airliner. As the tsunami waves approach the shore, the water depth becomes shallower, waves slow down, wavelength becomes shorter and the waves gain larger amplitude or heights and become destructive.\n\n**Effect on life and economy**\n\n* Tsunami waves destroy boats, buildings, bridges, cars, trees, telephone lines, power lines - and just about anything else in their way. Once the tsunami waves have knocked down infrastructure on the shore they may continue to travel for several miles inland, sweeping away more trees, buildings, cars and other man made equipment. Small islands hit by a tsunami are left unrecognizable.\n* After a tsunami strikes, landscapes that previously constituted picturesque beaches or seaside towns become a wasteland. In addition to the destruction of human construction, tsunamis destroy vegetation such as trees, resulting in landslides and coastlines that slip into the sea as deep root systems that previously held land in place are ripped out.\n\n**Preparedness in light of NDMA Gudelines**\n\n* The 2004 tsunami prompted NDMA to formulate Tsunami Risk Management Guidelines to outline inter-agency roles and responsibilities, tsunami risk preparedness, mitigation and response.\n* In order to reduce risk of tsunami it is pertinent to explore options for effective dissemination of tsunami alert and warning messages generated by INCOIS to the concerned agencies and coastal vulnerable communities exposed to tsunamis in a coordinated manner.\n* Structural Mitigation measures, as envisaged in the Guidelines, gives a brief guidance on design and construction of new structures as well as strategies for protecting lifeline and priority structures from tsunamis along the seafront.\n* A robust techno-legal regime through efficient land use practices, bioshields, shelter belt plantation and mangrove regeneration with community involvement will also help towards the cause.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_4_Q3",
      "serial_no": "3",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**3. Young people with ethical conduct are not willing to come forward to join active politics. Suggest steps to motivate them to come forward. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "In India, the word politics over time has come to be associated with corruption, political manipulation, opportunism, nepotism, along with weak moral integrity and character of political leaders. The flexing of muscle and money power in politics has made young people with ethical conduct wary of joining politics these days because\n\n* They fear that their ethical power cannot compete with the money and muscle power of modern day politician as they cannot be as ruthless as unethical politician in the pursuance of power.\n* They are also worried as their clean reputation may be spoiled in the dirty game of politics.\n\nIn such a scenario, it has become pertinent to motivate youngsters towards politics, through following ways:\n\n* Instilling in them a sense of duty and responsibility towards the country and people and by virtue of which, in politics. They can’t change it for better by not entering the system itself.\n* Encourage participation in political debates and school and university elections to raise political awareness and check the indifference creeping in the youth towards politics.\n* Perception management by bringing upright leaders to limelight in public discourse, highlighting their work and showcasing the cases of punishment of corrupt leaders,\n* Persuasion and incentives by having a platform dedicated to youth in political parties where they can share their ideas, voice their grievances, experiment with politics, like youth wings, so that they feel their part in political matters.\n* The government and political parties should work together to define and implement career pathways in politics for qualified people, and provide career guidance to young people who want to enter politics in the future.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**14. “The ideal solution of depleting ground water resources in India is water harvesting system”. How can it be made effective in urban areas? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "The NITI Aayog in its recently released **Composite Water Management Index** warned that India is facing its ‘worst’ water crisis in history. Critical groundwater resources, which accounted for 40% of India’s water supply, are being depleted at “unsustainable” rates.Twenty-one cities, including Delhi, Bengaluru, Chennai and Hyderabad will run out of groundwater by 2020, affecting 100 million people.\n\nThough there are many ways to check the further depletion of ground water and increase the level of water such as limit of water-extraction, change in crop-patterns, diverting river streams, building reservoirs and plantation drives but water harvesting system provides ideal solution for the problem.\n\nWater Harvesting (WH) means capturing rain water, where it falls and capture the runoff from, catchment and streams etc. Local people can easily be trained to build expand systems themselves. It will not only reduce water bills; provide an alternative supply during water restrictions but also ensure supply of high quality water - pure, free of chemicals. In fact, depending upon tank size and climate, rainwater harvesting can reduce main water use by 100%. RWH also decreases storm water runoff, thereby helping to reduce local flooding and scouring of creeks. RWH is most suitable where groundwater is scarce, contaminated, rugged or mountainous terrains, risk to aquifer from salt water intrusion.\n\n**Approaches for Effectiveness of WH in Urban India**\n\n* Water Harvesting in urban small areas is done by surface runoff harvesting and rooftop rainwater harvesting. Since present day urbanization has resulted both in shrinking of open spaces and very minimal area remaining unpaved, so small structures like recharge pit, recharge trenches, dug wells, recharge shafts, and percolation tanks should be built to capture the runoff and inject rainwater into the soil during rains.\n* For better effectiveness of water harvesting in urban areas, existing water bodies should be protected and revived without allowing any further construction in them in future. This will have to be undertaken by the government. At the micro level every resident/individual should implement both rooftop and driveway runoff harvesting in their respective homes, commercial complexes, office premises, factories etc.\n\nMost metro cities in India are water starved but not rain starved. We should not forget the fact that water harvested is water produced and make sincere attempts to harvest every drop of water that falls within every premises, locality, city and country. For this, WH should be made mandatory in new buildings.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**6. What are the impediments disposing the huge quantities of discarded solid waste which are continuously being generated? How do we remove safely the toxic wastes that have been accumulated in our habitable environment? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Presently in India, about 960 million tonnes of solid waste is being generated annually as by-products during industrial, mining, municipal, agricultural and other processes. Of this 350 million tonnes are organic wastes, 290 million tonnes are inorganic waste and 4.5 million tonnes are toxic in nature. But approximately 90% of waste generated is dumped rather than properly disposed.\n\n**Impediments in disposing waste:**\n\n* Lack of trained and qualified waste management professionals.\n* Lack of accountability in current Solid Waste Management (SWM) systems throughout India.\n* Limited budgetary support to cover the costs associated with developing proper waste collection, storage, treatment and disposal.\n* Limited environmental awareness combined with low motivation has inhibited innovation and the adoption of new technologies that could transform waste management in India.\n* Lack of coordination among govt. and civic agencies, local waste collection groups.\n* Public attitudes to waste are also a major barrier to improve SWM in India.\n\n**Ways to remove safely the toxic wastes**\n\n* Proper collection and segregation of plastics, e-wastes, bio-medical wastes & other solid wastes at the site of generation.\n* Recycling, waste to energy conversion, use of plastics in making road, and use of Green wastes as fertilizers can be a way in solving the problems of waste accumulation.\n* Replacing dumps with properly managed engineered landfills to reduce the environmental impact of waste and prevent toxic leaks.\n* Monitoring at ground by civic agencies, awareness campaigns on lines of Swachh Bharat mission.\n* Implementation of Solid waste management rule backed by proper legislation, participation of self-help group and NGD, promotion to Start-ups to use solid waste & create innovative solutions.\n\nConsidering the pace of urbanization in India this is imperative that more waste will be generated in towns and cities and thus we need to take above mentioned steps keeping in mind the aspects of cleanness.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**7. What is wetland? Explain the Ramsar concept of ‘wise use’ in the context of wetland conservation. Cite two examples of Ramsar sites from India. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Wetlands are ecosystems saturated with water, either seasonally or permanently. They include mangroves, marshes, rivers, lakes, deltas, floodplains and flooded forests, rice-fields, and even coral reefs.\n\nWetlands are vital for human survival as they are among the world’s most productive environments; cradles of biological diversity that provide water and productivity upon which countless species of plants and animals depend for survival.\n\n**Wise Use**\n\nAccording to Ramsar Convention on Wetlands, ‘Wise use’ of wetlands is the maintenance of their ecological character, achieved through the implementation of ecosystem approaches, within the spirit of sustainable development. ‘Wise Use’ guidelines encourage Contracting Parties to:\n\n* adopt national wetland policies with legislations and institutional arrangements to deal with wetland;\n* develop programmes of wetland inventory, monitoring, research, training, education and public awareness; and\n* take actions involving the development of integrated management plans covering every aspect of the wetlands and their relationships with their catchments.\n\nIndia has 26 Ramsar Sites which are the Wetlands of International importance. The important Ramsar sites are: Chilika lake (Odisa), Keoladeo National Park (Rajasthan), Loktak Lake (Manipur), Ashtamudi Wetland (Kerala) etc.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**8. Sikkim is the first ‘Organic State’ in India. What are the ecological and economical benefits of Organic State? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Sikkim became India’s first ‘organic state’ by implementing organic practices - free of chemical pesticides and chemical fertilisers.\n\n**Ecological Benefits of Organic State**\n\n* Organic practices such as crop rotations, inter-cropping, symbiotic associations encourage soil fauna and flora, improving soil formation and structure and creating more stable systems.\n* This increases retentive abilities of the soil for nutrients and water. This also plays an important role in soil erosion control.\n* Pollution of groundwater due to synthetic fertilizers and pesticides is curtailed.\n* Organic practices like minimum tillage, returning crop residues to the soil, and the greater integration of nitrogen-fixing legumes contributes to mitigating the greenhouse effect and global warming through its ability to sequester carbon in the soil.\n* Reduce the risks of human, animal, and environmental exposure to toxic materials\n* Fine-tunes farming practices to meet local production conditions.\n\n**Economical Benefits**\n\n* Less dependency on terminator seeds will decrease the input cost of farmers.\n* Less consumption of fertilizers by farmers will lower the fertilizer subsidy burden on government.\n* The high demand for organic products and their higher sale prices will lead to higher farmer income.\n* It acts as a boon to tourist industry, with a growing market for eco-tours and farm vacations.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**9. The China-Pakistan Economic Corridor (CPEC) is viewed as a cardinal subset of China’s larger ‘One Belt One Road’ initiative. Give a brief description of CPEC and enumerate the reasons why India has distanced itself from the same. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "One Belt One Road (OBOR) is one of the major initiatives of China focusing on improving connectivity and cooperation connecting Asia to Europe and Africa.\n\n**It has two dimensions:** Silk Road Economic Belt (SREB), a land route and the 21st-century Maritime Silk Road (MSR) an ocean route.\n\nChina Pakistan Economic Corridor (CPEC) is one of the flagship project of SREB.\n\nIt provides rail-road connectivity between Gwadar in Baluchistan, Pakistan to Xinjiang province of China and passes through Pakistan-Occupied Kashmir.\n\nIt is one of the largest bilateral initiatives between China and Pakistan with a budget of around $46 billion. CPEC is considered as a boon to struggling Pakistani Economy.\n\nIndia has openly expressed it displeasure over CPEC due to following reasons:\n\n* CPEC passes through Indian Territory, thus interferes with India’s sovereignty and territorial integrity.\n* There is a lack of transparency around the way the project is funded. It is considered as a part of Chinese policy of debt-equity swap.\n* It may disrupt and destroy Himalayan Ecology.\n\nIt is said that India should join the CPEC as it will benefit the region at-large and can lead to an improvement in ties between India and Pakistan as economic inter-dependence between the two will increase.\n\nHowever, it should also be noted that India’s concerns regarding sovereignty and integrity have not been addressed by either China or Pakistan. It will not be good for India to join a project, which challenges India’s sovereignty. In addition, there is no clarity about the funding of the project.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**17. How does biodiversity vary in India? How is the Biological Diversity Act, 2002 helpful in conservation of flora and fauna? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Biodiversity is defined as the variability among living organisms. Biogeographically, India is situated at the tri-junction of three realms namely Afro-tropical, Indo-Malayan and Paleo-Arctic realms, and therefore, has characteristic elements from each of them. This assemblage of three distinct realms probably is a fact which is believed to partly account for its rich and unique biological diversity.\n\n**Variations according to bio-geographic regions are:**\n\n* **The Himalayan Region:** The altitude gradient results in tremendous biodiversity of the region. There exist Tropical rainforests in the eastern Himalayas, dense subtropical and alpine forests in central and western Himalayas. Sambar, muntjac serow, goral, Himalayan thar, snow leopard and brown bear inhabit this region.\n* **The Indian Desert:** The natural vegetation consists of tropical thorn forests and tropical dry deciduous forests, sandy deserts with seasonal salt marshes and mangroves. Thar desert possesses most of the major insect species. 43 reptile species and moderate bird endemism are found here.\n* **The Western Ghats:** This zone displays diversity of forests from evergreen to dry deciduous. The Nilgiri langur, Lion tailed macaque, Nilgiri tahr, Malabar grey hornbill and most amphibian species are endemic to the Western Ghats.\n* **The Deccan Peninsula:** Large parts are covered by tropical forests. Tropical dry deciduous forests occur in the northern, central and southern part of the plateau. Fauna like tiger, sloth bear, wild boar, gaur, sambar and chital are found throughout the zone.\n* **The Gangetic plains:** It includes tropical dry deciduous forest, littoral and mangroves regions of the Sunderbans. The fauna includes elephants, black buck, gazelle, rhinoceros, Bengal florican, crocodile, freshwater turtle and a dense waterfowl community.\n* **The North East:** The tropical vegetation of northeast India is rich in evergreen and semi evergreen rain forests, moist deciduous monsoon forests, swamps and grasslands. Mammalian fauna includes 390 species of which 63% are found in Assam.\n* **The Indian Islands:** About 2,200 species of higher plants are found here of which many are endemic.\n\n**The Biological Diversity Act, 2002**\n\nIt was enacted to preserve the biological diversity in India, and provides mechanism for equitable sharing of benefits arising out of the use of traditional biological resources and knowledge. It is helpful in conservation of flora and fauna as:\n\n* There are provisions for setting up National Biodiversity Authority, State Biodiversity Board, and Biodiversity Management Committee for proper management of biological resources.\n* It aims to respect and protect knowledge of local communities traditional knowledge related to biodiversity.\n* It secures sharing of benefits with local people as they are conservers of biological resources and holders of knowledge and information relating to the use of biological resources.\n* It also has provisions for notifying heritage sites by State Government in consultation with local body which will ensure better preservation.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**18. Describe various measures taken in India for Disaster Risk Reduction (DRR) before and after signing 'Sendai Framework for DRR (2015-30)'. How is this framework different from ‘Hyogo Framework for Action, 2005’? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Disaster leads to sudden disruption of normal life, causing severe damage to life and property. Its origin can be natural or man-made. India due to its geography and scarce resources is more prone to Disasters.\n\nIn order to manage disaster, prior to the signing ‘Sendai Framework for DRR (2015-30)’ in 2016, India has taken following steps:\n\n* The Disaster Management Act was enacted in 2005, which ushered in a paradigm shift from a relief-centric approach to a more proactive regime that laid greater emphasis on preparedness, prevention and mitigation.\n* The National Policy on Disaster Management (NPDM) has been prepared in pursuance of the Disaster Management Act, 2005, which laid the framework/roadmap for handling disasters in a holistic manner.\n* In 2016, India released the country’s first ever National Disaster Management Plan, a document based on the global blueprint for reducing disaster losses, the Sendai Framework for Disaster Risk Reduction. It will cover all phases of disaster management, from prevention and mitigation to response and recovery.\n\nIndia is the largest democracy which has adopted the Sendai framework for disaster risk reduction and the first country to have drawn a national and local strategy with a short term goal achievement target set for 2020.\n\n**The difference between Hyogo Framework and Sendai Framework is:**\n\n* The Sendai Framework (2015-30) is the successor instrument to the Hyogo Framework for Action (2005-15).\n* The Hyogo framework was the first plan which explained, described and detailed the work that is required from all different sectors and actors to reduce disaster losses.\n* Sendai framework recognizes that the State has the primary role to reduce disaster risk but that responsibility should be shared with other stakeholders including local government, the private sector and other stakeholders.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q4",
      "serial_no": "4",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**4. Assess the impact of global warming on the coral life system with examples.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Coral life system harbour the highest biodiversity of any ecosystem globally and directly support over 500 million people worldwide.\n\nHowever, over the last three years, coral reefs ecosystem around the world have suffered from mass coral bleaching events. They are now **among the most threatened ecosystems on Earth,** largely due to unprecedented global warming and climate changes, combined with growing local pressures.\n\n### Impact of global warming on the coral life system\n\n* As temperature rises, mass coral bleaching events and infectious disease outbreaks are becoming more frequent. The bleaching of the Great Barrier Reef in 2016 and 2017, for instance, killed around 50% of its corals.\n* Bleached corals are likely to experience reduced growth rates, decreased reproductive capacity, increased susceptibility to diseases and elevated mortality rates.\n* Ocean acidification, or increased CO2 levels has reduced calcification rates in reef-building and reefassociated organisms, causing their skeletons to become weaker and growth to be impaired.\n* Sea level rise may lead to increases in sedimentation for reefs located near land-based sources of sediment. Sedimentation runoff can lead to the smothering of coral.\n* Changes in storm patterns, due to climate change, may lead to stronger and more frequent storms that can cause the destruction of coral reefs.\n* Changes in coral ecosystem also affect the species that depend on them, such as the fish and invertebrates that rely on live coral for food, shelter, or recruitment habitat.\n* Changes in precipitation result in increased runoff of freshwater, sediment, and land-based pollutants contribute to algal blooms and cause murky water conditions that reduce light.\n* Altered ocean currents lead to changes in connectivity and temperature regimes that contribute to lack of food for corals and hampers dispersal of coral larvae.\n* It is also expected that there will be a gradual decrease in the quantity of marine plants such as phytoplankton in warmer waters, effectively reducing the amount of nutrients available to animals further along the food chain.\n* In addition, the collapse of coral life system due to global warming can have direct impacts on tourism, aquaculture, and pharmaceutical industries as well as reduce the overall resilience of coastal communities.\n\n### Way forward\n\n* Limiting global average temperature to well below 2°C above pre-industrial levels, addressing local pollution and destructive fishing practices provide chance for the survival of coral life system globally. Also, transformation of mainstream economic systems towards circular economic practices can help in mitigating rising global temperatures.\n* According to UNESCO, the coral reefs in all 29 reef-containing World Heritage sites would cease to exist by the end of this century if global warming is not reduced. Reinforcing commitments to the Paris Agreement may be mirrored in all other global agreements such as the Sustainable Development Goals. SDG 13, for instance, calls for urgent action to combat climate change and its impacts.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**5. Discuss the causes of depletion of mangroves and explain their importance in maintaining coastal ecology.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Mangroves are salt-tolerant vegetation that grows in intertidal regions of rivers and estuaries. They are referred to as ‘tidal forests’ and belong to the category of ‘tropical wetland rainforest ecosystem’.\n\nMangrove forests occupy around 2,00,000 square kilometres across the globe in tropical regions of 30 countries. India has a total mangrove cover of 4,482 sq km. However, more than 35% of the world’s mangroves are already depleted.\n\n### Causes of Depletion\n\n* **Clearing:** Large tracts of mangrove forests have been cleared to make room for agricultural land, human settlements, industrial areas, shrimp aquaculture etc. As a result, mangroves get depleted to the tune of 2-8 percent annually.\n* **Overharvesting:** They are also overexploited for firewood, construction wood and pulp production, charcoal production, and animal fodder.\n* **Damming of rivers:** Dams built over the river courses reduce the amount of water and sediments reaching mangrove forests, altering their salinity level.\n* **Destruction of coral reefs:** Coral reefs provide the first barrier against currents and strong waves. When they are destroyed, even stronger-than-normal waves reaching the coast can wash away the fine sediment in which the mangroves grow.\n* **Pollution:** Mangroves also face severe threats due to fertilizers, pesticides, discharge of domestic sewage and industrial effluents carried down by the river systems.\n* **Climate change:** Unusually low rainfall and very high sea surface and air temperatures caused severe threats to the survival of mangrove forests.\n\n### Importance of mangroves in maintaining coastal ecology\n\n* Mangroves are among the most productive terrestrial ecosystems and are a natural, renewable resource. For instance, Sundarbans in the Gangetic delta supports around 30 plant species of mangroves.\n* Mangroves provide ecological niches for a wide variety of organisms. They serve as breeding, feeding and nursery grounds for fisheries and provide timber and wood for fuel.\n* Mangrove forests act as water filters and purifiers as well. When water from rivers and floodplains flow into the ocean, mangroves filter a lot of sediments, hence protecting the coastal ecology including coral reefs.\n* Mangroves act as shock absorbers. They reduce high tides and waves and protect shorelines from erosion and also minimise disasters due to cyclones and tsunami.\n\nGiven their importance, strict enforcement of the coastal regulation measures, scientific management practices and participation of the local community in conservation and management are essential for the conservation and sustainable management of the precious mangrove forests.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**6. Can the strategy of regional-resource based manufacturing help in promoting employment in India?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "The National Manufacturing Policy aims to increase the share of manufacturing in the country’s GDP to 25% by 2022. However, It has been observed that the rate of development in certain areas is very fast due to some locational advantages with a high degree of industrialization while other areas lag behind. In this regard, regional manufacturing becomes very important.\n\n### Employment generation due to Regional-Resource based manufacturing\n\n* Suitably organized industries can utilize raw materials in the area and thereby give a fillip to greater production and processing. This would help in overall regional development.\n* Manufacturing creates employment in the industry at various levels of skills. Normally a good proportion of the employment is in the unskilled and semi-skilled labor field who can expect higher wages than the informal sector earning.\n* The industry also creates opportunities for entrepreneurship and employment in ancillary industries and services in the secondary and tertiary sectors.\n* There would be greater and more varied demand for consumer goods. This creates its own cycle of possible growth in local production, distribution and support in the secondary and tertiary sectors.\n* It would also reduce the income gap between rural and urban areas and thereby reducing the distress migration.\n\n### Challenges to regional-resource based manufacturing\n\n* While many states like Jharkhand, Chattisgarh have abundant mineral resources, it is the lack of adequate infrastructure — mainly roads and power — that has been a major roadblock.\n* Lack of skills amongst people in these manufacturing industries.\n* MSME sector which will have lion’s share in such a strategy are already facing challenges related to marketing, credit, growth, and non-availability of suitable technology for manufacturing, etc.\n* Intellectual Property protection and enforcement are expensive and high risk in India.\n\nIn this regard, State and the Union government have come up with various strategies for harnessing the regional manufacturing potential-\n\n* Orissa has also launched **‘Odisha Industrial Development Plan: Vision 2025’** the with focussed attention on five sectors that aim to attract investments of Rs. 2.5-lakh crore and generate direct and indirect employment opportunities for 30 lakh people.\n* UP government’s **One District, One Product scheme** seeks to promote traditional industries synonymous with their respective districts to spur the local economy and create jobs.\n* **North East Industrial Development Scheme (NEIDS)** encourages micro, small, and medium enterprises (MSMEs) to set up in the north-east region.\n* Forest-based industries and Tribal Products are being encouraged in different states because of its ability to solve the problem of unemployment and poverty.\n* Different states and regions harbor GI tagged products that could be manufactured locally and marketed globally.\n\nThe overall development of the country can happen only by securing a balanced and coordinated development of the decentralized manufacturing economy in each region.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**14. What is water stress? How and why does it differ regionally in India?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Water stress is a situation in which the water resources in a region or country are insufficient for its needs. Such a situation arises when the demand for water exceeds the available amount or when poor quality restricts its use.\n\n### Water stress in India\n\n* India is home to nearly 17% of the world’s population but has only 4% of the world’s freshwater resources.\n* According to NITI Aayog’s **Composite Water Management Index** (CWMI) report 2018, 21 major cities including Delhi, Bengaluru, Chennai, and Hyderabad are racing to reach zero groundwater levels by 2020, affecting access for 100 million people. Besides, 12% of India’s population is already living the **‘Day Zero’** scenario.\n* According to the Aqueduct Water Risk Atlas of **World Resources Institute**, India is ranked **13th among the 17** most water-stressed countries of the world.\n\nThis indicates that India is going through **water emergency**. However, there is regional variation i.e. not all regions are equally water stressed.\n\n* While the northwestern and central parts of the country are severely water stressed, the eastern parts receive abundant rainfall for groundwater recharge.\n* The variation is also at the intra-regional level. For example, the areas in north Bihar struggle due to flooding while that of south Bihar finds it difficult to beat the heat. Flooding in Mumbai has become a regular phenomena while the nearby Vidarbha faces drought.\n\n### This uneven distribution of water crisis can be attributed to the following reasons:\n\n* **Geographical factors**\n  + India has diverse physiography, due to which different regions receive varying degrees of rainfall. For example, winter monsoon along the eastern coast and summer monsoon in northern India.\n  + Interior of southern India lies in the rain shadow zone and most of Rajasthan and northern Gujarat have arid climate.\n  + Also, the arid and semi-arid areas of northwestern India and central India are naturally occurring waterstressed areas.\n* **Climatic factors**\n  + Changing climate has led to an increase in the **frequency and intensity** of floods as well as droughts.\n  + Erratic monsoon is causing delayed and infrequent rainfall in different parts of India.\n* **Agricultural practices**\n  + In India, agriculture is **not practised according to the agro-climatic zone**. Groundwater is used to cultivate water intensive crops like paddy and sugarcane in rain deficit states like Punjab and Maharashtra respectively.\n  + State procurement policy and subsidised electricity in Punjab makes it profitable for farmers to produce rice. Similarly, farmers in Maharashtra cultivate sugarcane because they are assured of marketing.\n  + Moreover, flood irrigation is the most common form of irrigation in India which leads to a lot of water loss.\n  + All these have led to **excessive groundwater extraction** and have made **India virtual exporter of water**.\n* **Human factors**\n  + Rapid **urbanization** has led to the **concentration of population** in and around major cities which usually happen to be located in the rainfall deficient regions (like Delhi-NCR).\n  + The situation is aggravated by encroachment, contamination and consequent **destruction of water bodies** which otherwise help recharge the underground aquifers.\n  + Above all, there is a lack of awareness about water economy which demands judicious use of water.\n* **Way forward**\n  + India’s water challenge stems not only from the limited availability of water resources but also its mismanagement.\n  + There is a need to follow **conservation agriculture** i.e. farming practices adapted to the requirements of crops and local conditions. Cultivation of less water intensive crops like pulses, millets and oilseeds should be encouraged in water stressed regions.\n  + **Rainwater harvesting** needs to be incorporated with urban development projects. **Mission Kakatiya (Telangana),** which seeks to restore tanks through community-based irrigation management, is commendable.\n  + Freshwater sources need to be declared as **water sanctuaries** on the lines of national parks and tiger reserves. Water must be treated **as a resource** rather than a commodity.\n  + The efforts like the formation of ***Jal Shakti*** **ministry** (to tackle water issues holistically) and the goal to provide **piped water to all rural households by 2024**, under the **Jal Jeevan mission**, are steps in the right direction.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**16. How is efficient and affordable urban mass transport key to the rapid economic development in India?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Across nations, and through decades, economic development has been correlated to personal mobility. India has witnessed remarkable growth over the last few decades. However, the mobility infrastructure has not kept pace with the demand. As India aspires to be the second largest economy in the world by 2050, we must prepare for a rapid increase in demand for mobility.\n\n### Importance of efficient and affordable urban mass transport\n\n* **Supports clusters and agglomerations:** In large metropolitan areas, growth can be slowed with the heavy usage of private vehicles. Effectively planned transportation can overcome this constraint and reinforce agglomerations by allowing more people to come closer together in higher density developments.\n* **Increases productivity:** When transportation improvements increase the accessibility of people and businesses to reach jobs, services, and activities, productivity also increases.\n* **Enhances job & labor force accessibility:** Another economic benefit of transportation improvements is the resulting larger pool of employees available for the job market.\n* **Opens new markets for businesses:** Building a multi-modal facility opens new markets for companies searching for locations with the appropriate transportation infrastructure for their corporate needs.\n\n### Towards building an efficient and affordable urban mass transport\n\n* Government has devised various policies for ensuring *affordable, efficient and accessible mobility system* like - National Transit Oriented Development Policy, 2017; Green Urban Transport Scheme, 2016; FAME (Faster Adoption and Manufacturing of (hybrid &) Electric vehicles etc.\n* Despite these, Regulations must be introduced to encourage efficient use of existing roads and smarter traffic management. For example, not allowing trucks and large commercial carriers to ply city roads during the day.\n* Governments must ensure that the adequate ecosystem is in place before adopting new technologies in mobility. For instance, to adopt electric vehicles, cities must have first installed sufficient number of charging stations.\n* A good beginning is being made through the Smart Cities Programme, and all the selected 100 cities have put NMT (non-motorised transport) promotion as one of the goals in their respective Smart City Proposals.\n\nIn the coming years, Emerging market cities will play an increasingly large role in the global economy and for their unimpeded contribution. Therefore, India needs to develop ***Safe, Adequate and Holistic Infrastructure* *(SAHI)*** for the Indian population including women, elderly and the disabled.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**17. How do ocean currents and water masses differ in their impacts on marine life and coastal environment? Give suitable examples.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Ocean currents (surface or deep ocean currents) are streams of water flowing constantly in definite path and direction, for example, Gulf Stream (warm current) and Labrador current (cold current ). Water masses are the extensive homogeneous body of immense volume of ocean water in terms of temperature and salinity. These are generally characterised by the the downwelling of denser cold water and upwelling of less dense water, for example, the North Atlantic Deep water mass in the Norwegian Sea.\n\n### Impacts of ocean currents\n\n* **On marine life**\n  + Ocean currents act as distributing agents of nutrients, oxygen and other elements necessary for the existence and survival of fishes and zooplanktons.\n  + They also transport planktons from one area to the other area. For example, Gulf Stream carries planktons from the Mexican Gulf to the coasts of Newfoundland and north-western Europe. Many significant fishing grounds of the world are developed in these areas.\n  + Mixing of warm and cold ocean currents bring rich nutrients which support marine organisms. For example, seas north of Japan is a rich fishing ground due to the mixing of warm Kuroshio and cold Kurile currents.\n  + Sometimes, a few ocean currents destroy planktons. For example, El Nino current destroys planktons off the Peruvian coasts resulting into mass deaths of fishes.\n* **On coastal environment**\n  + Ocean currents maintain the horizontal heat balance of the earth. The warm currents transport warm waters of the tropics to colder areas of temperate and polar zones. Cold currents on the other hand bring cold waters of the high latitudes to the areas of low latitudes.\n  + Surface ocean currents also modify the weather conditions of the coastal areas. The ideal and favourable European type of climate of the western coasts of Europe is due to the moderating effects of the North Atlantic warm currents.\n  + Cold currents also intensify the desert-like conditions in the coastal areas, exemplified by the presence of some deserts in the western edges of continents, e.g., Namib Desert in Africa.\n  + The convergence of warm and cold currents causes foggy conditions, e.g., near Newfoundland due to convergence of warm Gulf Stream and cold Labrador current.\n\n### Impacts of water masses\n\n* **Downwelling of water masses**\n  + It transports oxygen downward which is much needed by the marine organisms.\n  + This process discourages enrichment of seawater by bringing nutrients, and hence the areas of downwelling of water masses are not conducive to marine life and hence they are the areas of low marine productivity.\n* **Upwelling of water masses**\n  + It is beneficial to the rich marine life because dissolved oxygen and nutrients are brought to the surface through upwelling. For example, the upwelling of nutrient rich cold water off the coast of Peru has made the region one of the richest fishing grounds.\n\nGlobal warming is disrupting the sinking of cold, salty water as a result of increased melting of glaciers and sea ice. This could slow or even stop the circulation of ocean waters, which could result in potentially drastic impact on marine life and coastal environment. Thus, arresting global warming is the need of the hour.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_2_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**6. Despite the consistent experience of high growth, India still goes with the lowest indicators of human development. Examine the issues that make balanced and inclusive development elusive.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Human development is increasingly viewed as the ultimate goal of development. It has multiple dimensions such as life expectancy at birth, education, standard of living, healthcare, inequalities, etc. and these can be improved and achieved with the rapid economic growth.\n\nThe Human development is best measured by the United Nations Human Development Index and the World’s Banks Human Capital Index. While, the economic growth is measured by the Gross Domestic Product or gross national product. However, there exists a strong correlation between Economic Growth and Human Development as Economic Growth provides the necessary resources to permit sustained improvements in Human Development.\n\n* India today is among the largest economies of the world. However, according to the United Nations Human Development Index report 2018, India ranks 130 out of 189 countries. The HDI 2018 highlighted some improvements such as increased life expectancy at birth, increased enrollment in schools, etc. However, India’s gross national income per capita also increased by a staggering 266.6 per cent between 1990 and 2017.\n* According to the World Bank’s Global Human Capital Index 2019, India ranks 115th out of 157 nations. The report also held that a child born in India is likely to be only 44% productive when (s)he grows up, if (s)he receives education and adequate healthcare. So, This clearly states that the Indian economy has failed to **provide a trickle-down effect**.\n\n### Reasons for the lack of Human development\n\n* **Unequal Distribution of Wealth and Non-inclusive growth:** In the last five years, only 1% of the wealthiest in India increased their share in wealth of around 60% and the richest 10% in India own more than four times more wealth than the remaining 90%.\n  + This results in an uneven distribution of wealth across the various sections of the society and it marks the prevalence of high inequality in the Indian socio-economic paradigm which led Non-inclusive growth and low human development.\n* **Jobless growth:** With increasing economic growth, the rate of growth of employment has declined.\n  + According to NSSO, unemployment is India is highest in 45 years.\n  + With rising population and, consequently, the labour force, India will soon experience demographic disaster rather than a demographic dividend.\n  + Also, according to ASSOCHAM, there is no deficiency of the adequate number of jobs, but the majority of the labour force doesn’t have adequate skills required by the market.\n* **Dismal condition of Education and Health:**\n  + On comparison with similarly placed emerging economies, India spends way too low in the education and health sector.\n  + India spends 3% of GDP on education and 1.5% of GDP on health.\n* **Education status in India:**\n  + Independent India retained the largely **colonial superstructure** of primary, secondary, and tertiary education, which emphasis on rote learning and obsession with marks in the exams.\n  + Consequently access, quality, and outcomes all are far lower than what anyone would have desired.\n  + Dropouts are only one outcome of bad quality. Poor learning outcomes, low employability of graduates, low productivity, and consequent low wages constitute another set of outcomes.\n  + All these outcomes are reflected in the Annual Status of Education Report (ASER) 2018, which concluded that the quality of education is far from satisfactory.\n* **Health status in India**\n  + Even after many government schemes, both the infant mortality rate and the maternal mortality rate remains high.\n  + There is a high prevalence of malnutrition in Indian children, reflected in a high percentage of Child stunting, wasting and underweight.\n  + The neglect of women’s health, in particular, is striking.\n  + Apart from it, India features the highest deaths in the world due to air pollution.\n* Also, there is a **disconnect between the rate of technological growth and ability to distribute the gains** from it by adequately focusing on skilling (via knowledge, education) and health, which is critical for greater resilience and sustained productivity.\n* Though the government has initiated many schemes for enhancing human capital i.e. Skill India, Digital India, Startup India, Ayushman Bharat. However, the results are not yet promising.\n\n### Way forward\n\n* The government needs to increase public expenditure on health and education as envisaged by National health policy 2017 (2.5% of GDP) and Draft education policy 2019 (6% of GDP).\n* Apart from holistic reforms in education, Right to Education must be accompanied by Right to Learning.\n* Promotion of Primary health centre under Ayushman Bharat, which focuses on preventive healthcare is a step in the right direction.\n* The government should also focus on promoting labour-intensive sectors such as gems and jewellery, textiles and garments and leather goods.\n* Skill framework in India needs to integrate with industries, so as to increase the employability of the Indian labour force.\n* The government should make efforts to curb digital divide, as it creates and reproduces socio-economic backwardness.\n\nHuman development and economic growth share a cause and effect to each other relationship. Therefore, without investing in Human capital and addressing current economic slowdown, the goal to becoming a $5 trillion economy, will remain a pipe dream for India.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_3_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**7. Coastal sand mining, whether legal or illegal, poses one of the biggest threats to our environment. Analyse the impact of sand mining along the Indian coasts, citing specific examples.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Sand consumption globally has been increasing and according to a report by the United Nations Environment Programme (UNEP), India is in the list of critical hotspots for coastal sand mining.\n\n**Coastal sand mining poses one of the biggest threats to our environment:**\n\n* It is very damaging to the beach fauna and flora and is ruinous to beach aesthetics.\n* Resulting in coastal erosion, it frequently causes environmental damage to other coastal ecosystems associated with the beach such as wetlands.\n* Another major impact of beach sand mining is the loss of protection from storm surges associated with tropical cyclones and tsunamis.\n\n**Indian coasts are greatly affected by coastal sand mining:**\n\n* For instance, in Periyasamypuram in Tuticorin district of Tamil Nadu, fish catch has come down, the palm trees have dried up, ground water has turned brackish and the sea has entered the village due to coastal sand mining.\n* Seawater intrusion, inundation of coastal land and salinisation of groundwater have been observed along the coast of Kollam, Alappuzha, Pathanamthitta, Kottayam and Ernakulam due to sand mining.\n* Coastal sand mining also has many negative impacts on the society. It affects the livelihood of the people, health, science beauty, climate and damage infrastructure.\n\nBetter spatial planning and reducing unnecessary construction, using green infrastructure, adopting recycled and alternative substitute materials such as oil palm shell, bottom ash, strictly adhering to Coastal Regulation Zone (CRZ), etc. can help in reducing coastal sand mining. Also strengthening standards and best practices to curb irresponsible extraction; investing in sand production and consumption measurement should be adopted at policy level.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_3_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**8. Vulnerability is an essential element for defining disaster impacts and its threat to people. How and in what ways can vulnerability to disasters be characterized? Discuss different types of vulnerability with****reference to disasters.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "According to **United Nation Office of Disaster Risk Reduction (UNDRR), Vulnerability** can be defined as the conditions determined by physical, social, economic and environmental factors or processes, which **increase the susceptibility** of an individual, a community, assets or systems to the impacts of hazards.\n\nVulnerability assessment needs to be based on a systematization and conceptualization of vulnerability describing the main linkages between the different components of risk. Only if the population and decision makers know where and how vulnerable the system is and which social–economic, physical, and environmental factors play a major role in it, adequate measures can be implemented to reduce vulnerabilities to disasters. It involves two approaches:\n\n* **Scientific Approach:** It includes the research line of practical measurement approaches of vulnerability and disaster risk reduction.\n* **Policy Approach:** It provides information about the spatial distributions of vulnerability to different natural hazards upon which the authorities need to take actions.\n\n### Different Types of Vulnerability\n\n* **Physical Vulnerability:** The potential for physical impact on the physical environment – which can be **expressed as elements-at-risk (EaR)**. The degree of loss to a given EaR or set of EaR resulting from the occurrence of a natural phenomenon of a given magnitude and expressed on a scale from 0 (no damage) to 1 (total damage)”.\n  + **For Example:** A wooden house is sometimes less likely to collapse in an earthquake, but it may be more vulnerable in the event of a fire or a hurricane.\n* **Economic Vulnerability:** The potential impacts of hazards on economic assets and processes (i.e. business interruption, secondary effects such as increased poverty and job loss) vulnerability of different economic sectors.\n  + **For Example:** Families with low incomes often live in high-risk areas around cities, because they can’t afford to live in safer (and more expensive) places.\n* **Social Vulnerability:** The potential impacts of events on groups such as the poor, single parent households, pregnant or lactating women, the handicapped, children, and elderly; consider public awareness of risk, ability of groups to self-cope with catastrophes, and status of institutional structures designed to help them cope.\n  + **For Example:** Women and children are more vulnerable to disasters as compared to men.\n* **Environmental Vulnerability:** The potential impacts of events on the environment (flora, fauna, ecosystems, biodiversity).\n  + **For Example:** People living in the tropical areas are more vulnerable to tropical cyclones as compared to people living in temperate region.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_3_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**18. Disaster preparedness is the first step in any disaster management process. Explain how hazard zonation mapping will help disaster mitigation in the case of landslides.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Disaster preparedness refers to measures taken to prepare for and reduce the effects of disasters i.e. to predict and prevent disasters, mitigate their impact, and respond to and effectively cope with their consequences. These are achieved through programs that strengthen the technical and managerial capacity of governments, organizations, and communities.\n\nDisaster preparedness is a continuous and integrated process resulting from a wide range of risk reduction activities and resources. It is considered as the first step in any disaster management process as it involves:\n\n* Risk assessment (to point out which measures to implement) and early warning systems\n* Life safeguarding equipment, for example, cyclone shelters\n* Resources and emergency kits in anticipation of need, maintaining emergency rosters and evacuation plans, emergency information and communication systems\n* Training to ensure adequate emergency response capacity, maintenance of preparedness levels, public education and preparedness campaigns\n\nThat said, hazard zonation mapping is one of the disaster preparedness mechanisms to mitigate the risks associated with landslides. Landslides involve mass movement of loose soil and uncompact rock materials under the effects of gravity along a sliding plane.\n\nAccording to a recent study, India is among the most landslides affected countries, accounting for at least 28% of such events in the past 12 years. In such a scenario, hazard zonation mapping will help disaster mitigation in the case of landslides.\n\n* Landslide hazard zonation (LHZ) mapping refers to the division of land into homogeneous areas and ranking of these areas according to their degrees of actual or potential hazard caused by landslides and mass movements.\n* The susceptibility of a given area to landslides can be determined and depicted using hazard zonation. Once landslide susceptibility is identified, intervention projects can be developed which avoid, prevent, or substantially mitigate the hazard.\n* These maps provide important information to support decisions for urban development and land use planning. Also, effective utilization of these maps can considerably reduce the damage potential and other cost effects of landslides.\n* The LHZ maps identify and delineate unstable hazard-prone areas, so that environmental regeneration programmes can be initiated adopting suitable mitigation measures.\n* Even if the hazardous areas cannot be avoided altogether, their recognition in the initial stages of planning may help to adopt suitable precautionary measures.\n\nLandslides and their consequences are still a great problem for many countries, particularly in India due to rapidly increasing populations. The most recent example being that of Kerala. For this reason, landslide hazard zonation mapping serves as one of the many components in an integrated disaster management planning.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**6. How will the melting of Himalayan glaciers have a far-reaching impact on the water resources of India?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "India known for her rivers as blessings has both perennial and non-perennial rivers. Rivers of north India originate in Himalayas and Himalayan glaciers and are known as perennialrivers. Ganga, Bharamputra, Satluj etc. are the rivers of Himalayas.\n\nMelting of glaciers is a phase of global warming cycle of the Earth but with the anthropogenic activities the rate of melting of glaciers has aggravated. From the past decade, the global temperature has increased which has accelerated the melting of glaciers which will impact water resources in India in several ways:\n\n* Melting of glaciers will lead to overflow of rivers resulting into floods, breaking of dams, increased expanse of the river course etc. This will cause loss of human life, animal life, destruction of habitat and harvest.\n* Increased flow of river also results in the increase of erosion power of river. The rivers will start eroding deep into the river beds which can cause overload of sedimentation and siltation.\n* The sediments that rivers carry with them will be drained into sea making the sea water level saline which results into coral reefs destruction, submerging of islands and so on.\n\nMelting of glaciers willsolve the scarcity of waterin India forshort-term. For optimumutilization,the government has to take steps like interlinking of river, formation of ponds, irrigation facilities, etc. which will help mitigate the impacts. These steps can help decrease the possibility of waterscarcity in long term as melting of glaciers will lead to decline in the availability of fresh water.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**7. Account for the present location of iron and steel industries away from the source of raw material, by giving examples.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "The iron and steel industry is called a basic industry. It is basic because it provides the raw material for other industries such as machine tools used for further production.\n\nThe iron and steel industry istraditionally located close to the sources ofrawmaterials – iron ore, coal,manganese and limestone. For example, Jamshedpur TISCO plant. However, later it wasrealised that accessto markets, cheap labour, access to ports, and government policies are considerably more important than inputs.\n\n* **Cheap Labour:** In the USA, the industry has also moved towards the southern state of Alabama because of factorslike cheap labour and globalsupply chain. Pittsburg area, which wastraditionally the hub ofthe industry, is now losing ground. It has now also called the “rust bowl” of the USA.\n* **Market:** Japan is deficient in both iron ore and coal and almost all raw materials are imported. Japanese steel plants aremostlymarket-based. Example: The ‘Tokyo-Yokohama’ and ‘Osaka – Kobe –Heemeji’ iron steelregions.\n* **Port:** The Vizag Steel Plant, in Visakhapatnam in Andhra Pradesh, is a port-based plant which started operating in 1992. Its port location is of advantage.\n* **Government Policy:** In India, which is the 2nd largest crude steel producer, new steel plants which were set up in the Fourth Plan period are away from the main raw material sources in southern states to promote regional parity.  Example, Salem steel plant in Karnataka.\n\nIron and Steel Industry, not located near the source of raw materials, are less expensive to build and operate and can be located near markets because of the abundance of scrap metal, which is the main input. Realising the changing trends ofthe industry, India in 2017 launched theNational Steel Policy to create a technologically advanced and globally competitive steel industry that promotes economic growth.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**14. The interlinking of rivers can provide viable solutions to the multi-dimensional inter-related problems of droughts, floods, and interrupted navigation. Critically examine.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Unlike southern states,the northern plains of India are endowed with surplus water due to the presence of perennial rivers originating from the Himalayas. The river interlinking project aimsto link 60 riversso that water from the surplus basin to deficit basin can be transferred. The project aimsto link 60 rivers,some of which include Ken-Betwa, Daman Ganga-Pinjal, Mahanadi-Godavari.\n\n### Proposed Benefits\n\n* **Hydropower Generation:** The river interlinking project claims to generate a total power of 34 GW which will help India fulfil its growing requirements and commitment to the Paris Climate Deal.\n* **Flood Control:** The objective is to conserve seasonal flows for irrigation, hydropower generation, and flood control. For instance, the linkage will transfer surplus flows of the Kosi, Gandak and Ghagra to the west.\n* **Drought Mitigation:** The aim is to transfer water to drought-prone regions. A link with the Ganga and Yamuna is proposed to transfer the surplus water to drought-prone areas of Haryana, Rajasthan and Gujarat.\n* **Round the Year Navigation:** As it would address the low levels of water in southern India’s rivers, it would provide around year waterways connectivity. Under the project, 10,000 km of navigation will be developed reducing the transportation cost.\n* **Irrigation Benefits:** Interlinking of rivers will increase the country’s total irrigation potential. It will provide additional irrigation to 35 million hectares in the water-scarce regions.\n\n### Concerns with the Project\n\n* **Perennial Rivers are not so Perennial:** A new analysis of rainfall data reveals that monsoon shortages grow in river basins with surplus water falling in those with scarcities.\n* **Federal Issue:** Historically, there has been dissent on the part of the states regarding water sharing. Examples include Cauvery, Mahadayi disputes.\n* **Neighboring Countries:** Convincing neighbours will be a tough task. For example, Bangladesh being a lower riparian state is less likely to agree to India’s interlinking project.\n* **High Environmental Cost:** Construction of dams will lead to submerging of Himalayan forests and wide-scale displacement of people. For example, Ken-Betwa project will consume 23 sq miles of forest land. Moreover, it would harm many ecological factors like delta formation, growth of mangroves, and aquatic life.\n\nThe necessity and feasibility of river-interlinking should be seen on case to case basis, with adequate emphasis on easing out federal issues and environmental costs. Alongside, localsolutions(like better irrigation practice) and watershed management should be focused on.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**17. Examine the status of forest resources of India and its resultant impact on climate change.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "According to the ‘India State of Forest Report 2019’ the total forest and tree cover in India is 80.73 million hectares which is around 24.56% of the total geographical area of the country. These forests and trees deliverimportant ecosystemgoods and services. Anymajor change caused in the available forestresources, directly or indirectly affects climate change.\n\n### Forest Resources and Climate Change\n\n* Different forest types are a gateway to different wood and non-wood forest resources. Forests also provide food, fiber, edible oils, and drugs. Forest is an important source of minerals and minor forest produce like tendu and honey.\n* These forest resources in India despite being under protection laws suffer as open access resources. Due to this, almost 78% of the forest area issubjected to heavy grazing and other unregulated uses. Forests are also prone to illegal mining activities and slash and burn agricultural practices in certain areas. With increase in population, the pressure on forest resources have increased. This over-exploitation of resources has aggravated the impact of climate change.\n* Forests help in carbon sequestration and oxygen enrichmentin environment.Unregulated use offorestresources and deforestation activities disturb the carbon cycle resulting in increase in globaltemperature levels. Thistranslates to change in wind pattern and precipitation levels.\n* Climate change isincreasing the risk of droughtin some areas, while making many other areas prone to extreme precipitation and flooding situations. Increased temperature is increasing the melting rate of icebergs thereby resulting in increase in sea level and submergence of coastal areas and islands.\n* Also, the unchecked forest resource utilization has resulted in frequent wildfires, storms, insect outbreaks, invasive species and diseases. The increase in human-animal conflict cases nowadays is also a result of over exploitation of forest resources.\n* Thus, there is a close interrelationship between climate change and forests. The issue of unchecked human activities in forest areas needs to be addressed in a holistic manner not only at local level but also at global level. Making plantation mandatory along highways, road dividers, vacant land along railway tracks, etc. coupled with promoting sustainable usage of forest resources will serve the purpose.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_3_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**14. Suggest measures to improve water storage and irrigation system to make its judicious use under depleting scenario.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "A continuous wastage or misuse of potable groundwater either in industries, agriculture or households has left a large population of the country facing high water stress conditions today. High wastage of water coupled with burgeoning population in some manner ensures that sooner or later we will be facing scarcity of potable water in the country.\n\n**Traditional methods to improve water storage and irrigation**\n\n* **Jhalaras**: They are typically rectangular-shaped stepwells that have tiered steps on three or four sides.\n* **Talabs**: These are reservoirs that store water for household consumption and drinking purposes. They may be natural, such as the pokhariya ponds.\n* **Bawaris**: These are unique stepwells that were once a part of the ancient networks of water storage in the cities. The little rain that the region received would be diverted to this man-made tank through canals.\n* **Taanka**: It is a traditional rainwater harvesting technique indigenous to the desert region.\n* **Ahar Pynes**: These are traditional floodwater harvesting systems indigenous to regions frequently prone to floods.\n* **Johads**: These are one of the oldest systems used to conserve and recharge groundwater, which are small earthen check dams that capture and store rainwater. It is constructed in an area with naturally high elevation on three sides.\n\n**Modern methods to improve water storage and irrigation**\n\n* **Rainwater Overhead Tanks**: These are the simple tanks placed over the building or on the terrace, collecting water as it comes.\n* **Rooftop Rainwater Harvesting**: A simple structure where the roof is used as a support for installing catchment pipes through which the rainwater flows and is eventually stored in ground level containers.\n* **Percolation Tanks**: The percolation tanks are mostly earthen dams with masonry structure only for spillway. The purpose of these tanks is to recharge the groundwater storage.\n\n**Irrigation methods to ensure judicious use of water**\n\n* **Bamboo Drip Irrigation System**: It is an indigenous system in northeast India. In this, the water from perennial springs is diverted to the terrace fields using varying sizes and shapes of bamboo pipes. The system ensures that small drops of water are delivered directly to the roots of the plants.\n* **Irrigation Scheduling**: It is basically smart water management. It deals with when, how often, and how much water needs to be provided to plants. To avoid overwatering of crops and avoid water wastage farmers carefully monitor the weather forecast, understand the soil condition, and use smart meters for water management.\n* **Dryland Farming**: The practice of cultivating crops without irrigation in regions of limited moisture.\n* **Sprinkler Irrigation**: It is a method of applying water to crops which is similar to natural rainfall but in a more judicious manner and spread uniformly over the land surface. It is done using a pump, pipes and nozzle to sprinkle water.\n\nThus, we see that traditional methods when coupled with modern scientific approaches to conserve water can produce the intended results in the field of water conservation. Hence, the above-mentioned methods should be brought to use holistically to reduce water wastage and ensure availability of potable water to mankind for a longer period of time.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_3_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**17. What are the key features of the National Clean Air Programme (NCAP) initiated by the government of India?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "National Clean Air Programme is a national framework for air quality management with a time-bound reduction target. The NCAP will be a mid-term, five-year action plan with 2019 as the first year.\n\n**Features of the National Clean Air Programme (NCAP)**\n\n* To achieve a national-level target of 20-30% reduction of PM2.5 and PM10 concentration by 2024, keeping 2017 as base year.\n* Under NCAP, 122 non-attainment cities have been identified across the country based on the Air Quality data from 2014-2018.\n* The city specific action plans have been prepared which, inter-alia, include measures for strengthening the monitoring network, reducing vehicular/industrial emissions, increasing public awareness etc.\n* Implementation of the city specific action plans are regularly monitored by Committees at Central and State level namely Steering Committee, Monitoring Committee and Implementation Committee.\n* Air quality of cities is monitored by State Pollution Control Boards which publishes their results from time to time. Some Smart Cities have established Integrated Command and Control Centres (ICCCs) which are also connected to Air Quality Monitors (AQMs) for effective monitoring.\n* It also proposes state-level plans of e-mobility in the two-wheeler sector along with rapid augmentation of charging infrastructure, stringent implementation of BS-VI norms, boosting public transportation system, and adoption of third-party audits for polluting industries.\n* To attain its desired objectives, NCAP follows the approach of Collaborative, Multi-scale and Cross-Sectoral Coordination between relevant Central Ministries, State Government and local bodies.\n\nNCAP is envisaged to be dynamic although the targets appear less ambitious. However, it is expected to evolve based on the additional scientific and technical information.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q4",
      "serial_no": "4",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**4. Differentiate the causes of landslides in the Himalayan region and Western Ghats.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "A landslide is defined as the movement of a mass of rock, debris, or earth down a slope. They are a type of mass wasting, which denotes any downward movement of soil and rock under the direct influence of gravity. Landslides are caused due to three major factors: geology, morphology, and human activity.\n\n**Causes of landslides in Himalayan region:**\n\n* **Geology:** Himalayas are young, fragile mountains still growing, hence susceptible to natural landslides, tectonic activity, with the plate moving up which causes instability.\n* **Morphological:** Steep and sharp slope in the Himalayas.\n* **Anthropogenic:** These include, jhum cultivation, deforestation etc., leading to landslides.\n\n**Causes of landslides in Western Ghats:**\n\n* **Geology:** These factors play a very little role here as the Western Ghats are one of the most stable landmasses.\n* **Anthropogenic:** Heavy mining activities, deforestation for settlements and cutting for road construction, windmill projects have led to huge fractures on the mountains, loosening structures.\n\n**Following measures for the mitigation of landslides can be taken:**\n\n* Restriction on the construction and other developmental activities such as roads and dams in the areas prone to landslides.\n* Limiting agriculture to valleys and areas with moderate slopes.\n* Promoting large-scale afforestation programmes and construction of bunds to reduce the flow of water.\n\nTerrace farming should be encouraged in the north-eastern hill states where Jhumming (Slash and Burn/Shifting Cultivation) is still prevalent.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**6. What are the environmental implications of the reclamation of the water bodies into urban land use? Explain with examples.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Land reclamation means creating land either by removing water from muddy areas or raising the level of the land. With an increasing demand for land, it can be a good solution for creating areas for building, agriculture and other uses.\n\nHowever, it is one of the most consequential fields of human induced environmental transformation and has many environmental consequences such as:\n\n* **Damaged Ecology**: Urban land transformation leads to creation of residential, commercial buildings around water bodies, causing degradation of water ecology and influx of nutrients. Dal Lake and other water bodies in Srinagar are a great example of it. Land reclamation can also change the shape of the seabed and wave patterns leading to changes in the ecosystem.\n* **Frequent Floods:** Water bodies act as sponges for rainfall, reclamation of water bodies, has led to higher incidences of floods. Depletion of vegetation, transformation of soil cover to concretised landscape has reduced permeability, increased run-off. The biggest example of it is Mumbai.\n* **Extinction of Species**: Land reclamation of wetlands has increased the Biochemical Oxygen Demand (BOD) which is detrimental not only for aquatic species but also for aerial fauna.\n* **Pollution:** Water bodies have been turned into landfills in several cases. Because of heavy pollution of Hussainsagar Lake, many pollutants get carried into underground water bodies. Though percolation filters many pollutants, open wells or bore wells receive certain pollutants causing groundwater pollution.\n\nWater bodies not only support high concentrations of biodiversity, but also offer a wide range of important resources and ecosystem services like food, water, fiber, groundwater recharge, water purification, flood moderation, storm protection, erosion control, carbon storage and climate regulation. Hence their conservation is an imperative.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**7. Mention the global occurrence of volcanic eruptions in 2021 and their impact on regional environment.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "A volcano is an opening or rupture in the earth’s surface that allows magma (hot liquid and semi-liquid rock), volcanic ash and gases to escape. The volcanic eruption could have implications for the local and regional environment like earthquake, landslides, lahars (mudflows), ash and thunderstorms. 2021 witnessed several volcanic eruptions viz. Mount Sinabung (Indonesia); Klyuchevskoy (Kamchatka, Russia); Fournaise (Réunion); Mount Etna (Italy); and Erebus (Antarctica).\n\n**Impact of volcanic eruption on the environment:**\n\n* Volcanic eruptions are responsible for forming new rock on the Earth’s surface.\n* The gases and dust particles thrown into the atmosphere during volcanic eruptions have influences on climate.\n* Volcanoes have also caused global warming over millions of years during times in Earth’s history when extreme amounts of volcanism occurred, releasing greenhouse gases into the atmosphere.\n* Even though volcanoes are in specific places on Earth, their effects can be more widely distributed as gases, dust, and ash get into the atmosphere\n* Volcanic eruptions are generally preceded by increased seismic activity.\n\nMost of the active volcanoes on earth occur on the Circum-Pacific Belt, also referred to as the Ring of Fire. Volcanoes are a natural exogenic phenomenon that cannot be avoided, but developing disaster risk resilience will surely be a step in the right direction.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**8. Why is India considered as a subcontinent? Elaborate your answer.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "The Indian subcontinent, or simply the subcontinent, is a physiographic region in South Asia. It is situated on the Indian Plate, projecting southwards into the Indian Ocean from the Himalayas.\n\nGeologically, the Indian subcontinent is related to the landmass that drifted from the supercontinent Gondwana during the Cretaceous and merged with the Eurasian landmass nearly 55 million years ago. Geographically, it is the peninsular region in South-Central Asia, delineated by the Himalayas in the north, the Hindu Kush in the west, and the Arakanese in the east.\n\nThis natural physical landmass in South Asia has been relatively isolated from the rest of Eurasia. The Himalayas (from Brahmaputra River in the east to Indus River in the west), Karakoram (from Indus River in the east to Yarkand River in the west) and the Hindu Kush mountains (from Yarkand River westwards) form its northern boundary. The Indian Ocean, Bay of Bengal and Arabian Sea form the boundary of the Indian subcontinent in the south, south-east and south-west.\n\nMoreover, India’s high population and its multiple races, religions, castes, languages, customs make it look like a small continent like the subcontinent. The diversity is largely a result of physical aspects of the land itself, which in turn shaped historical events such as migrations and invasions. However, in spite of numerous differences, at the root there are numerous similarities in the socio-cultural-economic way of life.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**14. Briefly mention the alignment of major mountain ranges of the world and explain their impact on local weather conditions, with examples.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Mountain range refers to a series of ridges which originated in the same age and underwent the same processes. The most prominent or characteristic feature of mountain ranges is their long and narrow extension.\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2021_PAPER_1_Q14_IMG_1.tif)\n\n**Mountain ranges and their influence:**\n\n* **Andes Mountain Range:**\n  + The range stretches from north to south through seven countries in South America, along the west coast of the continent: Venezuela, Colombia, Ecuador, Peru, Bolivia, Chile, and Argentina.\n  + Because the Andes act as a large wall between the Pacific Ocean and the continent, they have a tremendous impact on weather in the region.\n  + The northern part of the Andes is typically rainy and warm, and the weather is also wet in the eastern part of central Andes, and the area to the southwest.\n  + To the west, the dry climate is dominated by the Atacama Desert in northern Chile. The mountains form a rain cover over the eastern plains of Argentina, which have extremely dry weather.\n* **The Himalayas**:\n  + The Himalayan mountain ranges are stretched over the northern borders of India. These mountain ranges run in a west-east direction from the Indus to the Brahmaputra. The Himalaya consists of 3 parallel ranges in its longitudinal extent.\n  + The mountain range in Asia separates the plains of the Indian subcontinent from the Tibetan Plateau.\n  + The Himalayas have a profound effect on the climate of the Indian subcontinent and the Tibetan Plateau. They prevent frigid, dry winds from blowing south into the subcontinent, which keeps South Asia much warmer than corresponding temperate regions in the other continents.\n* **Rockies Mountain Range**:\n  + These are massive mountain ranges that stretch from Canada to central New Mexico.\n  + These cast a fairly substantial rain shadow - a dry area on the leeward side of the mountain range, where wind does not hit, which forms because the mountains block rain-producing weather systems and create a metaphorical shadow of dryness.\n  + Wet weather systems begin in the Pacific Ocean and travel over the western states to the Rocky Mountains, and as the air moves higher up the western slope it cools and condenses, leaving rain and snow along the mountainside in its wake.\n  + Having been stripped of moisture, the air continues over the Rocky Mountains and dries out as it moves down the eastern slope. Because the air is now dry, it absorbs moisture from the landscape, leaving the earth more arid.\n  + Essentially, the rain shadow is a desert forced into existence because of the mountain range it borders, which prevents the eastern slopes and foothills from experiencing the same moisture that falls on the western side of the range.\n* **Great Dividing Range**:\n  + It runs roughly parallel to the east coast of Australia and forms the fifth-longest land-based mountain chain in the world, and the longest entirely within a single country.\n  + The Great Dividing Range blocks the flow of moist air coming from the Tasman Sea. This creates rain over the range and reduces the amount of rainfall in inland regions west of the range.\n* **Atlas Mountains**:\n  + The Atlas Mountains extend some 2,500 km across north-western Africa, spanning Morocco, Algeria and Tunisia. The mountain range separates the Mediterranean and Atlantic coastlines from the Sahara Desert.\n  + Westerly winds from the Atlantic Ocean carry moisture into the region, but the mountains act as a weather barrier between the coastal grasslands and wetlands and the Sahara Desert.\n  + The Atlas Range causes a rain shadow effect, preventing the areas beyond the mountains from receiving much rainfall. During the winter months, the highest peaks of the Atlas Mountains are among the few parts of Africa to see snow.\n* **The Ural Mountains**:\n  + It extends from the Kara Sea to the Kazakh Steppe along the border of Kazakhstan. Geographically, this range marks the northern part of the border between Europe and Asia.\n  + The northern side of the mountain range receives cool, rainy weather, while the southern side is a hot desert.\n  + The western side of the mountain range receives warm continental winds, while the eastern side is much cooler and drier.\n\nThe mountain ranges of the world provide essential ecosystem-based services to global communities as well as inspiration and enjoyment to millions. These are particularly important for their biodiversity, water, clean air, research, cultural diversity, leisure, landscape and spiritual values.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**15. How do the melting of the Arctic ice and glaciers of the Antarctic differently affect the weather patterns and human activities on the Earth? Explain.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Many glaciers around the world have been rapidly melting. Human activities are at the root of this phenomenon. Specifically, since the industrial revolution, carbon dioxide and other greenhouse gas emissions have raised temperatures, even higher in the poles, and as a result, glaciers are rapidly melting, calving off into the sea and retreating on land.\n\n**Consequences of melting:**\n\n* The Arctic and Antarctic act like the world’s refrigerator. They balance out other parts of the world that absorb heat. The loss of ice and the warming waters will affect sea levels, salinity levels, and current and precipitation patterns.\n* The global average sea level has risen by about 7-8 inches since 1900, and it’s getting worse. Rising seas endanger coastal cities and small island nations by exacerbating coastal flooding and storm surge.\n* Permafrost in the Arctic region (ground that is permanently frozen) stores large amounts of methane, which is a greenhouse gas that contributes to climate change. As more quickly the ice is lost, more rapidly permafrost will melt. This will result in a vicious cycle that may result in a climate catastrophe.\n* The melting of ice also puts the region’s vibrant biodiversity under serious threat. Many land and sea animals rely on glaciers as their natural habitats and as they disappear, so does the rich ecological life they shelter**.**\n\nThe solution to all of this is obvious. Climate change mitigation policies need to be implemented stringently. If CO2 emissions can be reduced over the next ten years, then glaciers can still be saved. More targeted measures may also be required.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**16. Discuss the multi-dimensional implications of uneven distribution of mineral oil in the world.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Petroleum is not distributed evenly around the world. Slightly less than half of the world’s proven reserves are located in the Middle East (including Iran but not North Africa). Following the Middle East are Canada and the United States, Latin America, Africa, and the region made up of Russia, Kazakhstan, and other countries that were once part of the Soviet Union.\n\n**This uneven distribution of mineral oil across the globe has many multi-dimensional implications.**\n\n* **Economic**: Uneven distribution of the mineral oil across the world, affects the balance of trade between the importing and the exporting countries. This in turn affects the foreign exchange reserves of the country. It also leads to economic consequences like inflation, for the importing country.\n* **Political:** Many historical and present-day conflicts involve nations trying to control resource-rich territories. For example, the desire for diamond and oil resources has been the root of many armed conflicts in Africa. USA’s interference in the geopolitics of West Asia is also one of the reasons for uneven distribution of oil minerals.\n* **Employment & Migration**: Availability of oil reserves leads to more job opportunities in the Middle east. That is the reason why India has a large diaspora in the middle east.\n* **Uneven Growth:** Uneven distribution of mineral oil has also led to uneven growth across the globe. Rise in import prices directly hamper the capabilities of the government to spend on welfare objectives.\n* **Energy Security:** The uneven distribution of the mineral oil resource is the reason for energy insecurity in the oil deficient countries. It also directly affects their strategic autonomy.\n\nThe uneven distribution of the mineral oil resources leads to various implications ranging from economic to energy security. This highlights the need for India to diversify its energy basket both in terms of content and geography.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**17. What are the main socio-economic implications arising out of the development of IT industries in major cities of India?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Information technology is an example of a general-purpose technology that has the potential to play an important role in economic growth, as well as other dimensions of economic and social development. The IT industry accounted for around 8% of India’s GDP in 2020.\n\nHowever, IT industries in India are concentrated in a few major cities like Delhi-NCR, Hyderabad, Bengaluru, etc. This, though boosted the economy around the cities, has imprinted wider socio-economic implications.\n\n**Socio-economic implications of development of IT industry:**\n\n* **Uneven development and Economic Disparity:** The major cities with large IT hubs are developing faster than the semi urban and Tier I, II cities. There is also a huge wage gap between IT workers and other workers.\n* **Accentuating Digital Divide:** Given the importance of industries, the hosting cities attract most of the developmental activities. To illustrate, lack of infrastructure in rural areas impede the access to essential services, impacting their socio-economic development.\n* **Increased Migration and Cultural Change:** The youth migrate from rural areas and small cities to the major IT cities leaving their parents alone and needy for social and emotional support. This is leading to breakdown of joint family culture and more nuclear family culture is emerging in India.\n\nIndia’s technology services industry can achieve USD 300-350 billion in annual revenue by 2025 if it can exploit the fast-emerging business potential in cloud, artificial intelligence (AI), cybersecurity and other emerging technologies. Though we need to invest in such technologies, this investment should be evenly distributed and not centred to a few locations. For example, the IT-BPO industries can be established in North East cities and Tier 1 and 2 cities. We can only become a knowledge economy if the developments are even and inclusive.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_2_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**6. “Besides being a moral imperative of a Welfare State, primary health structure is a necessary precondition for sustainable development.” Analyse.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Primary health care is a term used to describe the first contact a person has with the health system when they have a health problem. The Welfare State is a concept of government in which the State plays a key role in the protection and promotion of the economic and social well-being of its citizens.\n\n**Primary health structure is a moral imperative of a Welfare State:**\n\n* Right to Health is a part and parcel of Right to Life and therefore right to health is a fundamental right guaranteed to every citizen of India under Article 21 of the Constitution.\n* As a Directive Principle of State Policy, Article 47 talks about raising the level of nutrition and the standard of living of people and to improve public health. It provides an obligation on the state to provide primary health facilities.\n\nPrimary health care is the most efficient and effective way to achieve health for all. Primary health structure is a necessary precondition for sustainable development in the following ways:\n\n* Sustainable Development Goal (SDG) 3 talks about ‘Ensuring healthy lives and promoting well-being for all at all ages’. Access to quality health care would not be possible without an effective primary health structure.\n* Lack of availability of subsidised and timely treatment leads to affordability issues and creates a vicious cycle of poverty and heightens the out of pocket expenditure of people.\n* Health conditions, disabilities, and unhealthy behaviors can all have an effect on educational outcomes and can also lead to social exclusion.\n* At a societal level, poor population health is associated with lower savings rates, lower rates of return on capital, and lower levels investment; all of these factors can and do contribute to reductions in economic growth.\n\nAs recognized in the 2018 Astana Declaration, the Primary Health Care approach is the most effective way to sustainably solve today’s health challenges. The National Health Policy 2017 envisages providing a larger package of assured comprehensive primary health care through the Health and Wellness Centers’ and advocates allocating major proportion of resources to primary care.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_3_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**7. Describe the key points of the revised Global Air Quality Guidelines (AQGs) recently released by the World Health Organisation (WHO). How are these different from its last update in 2005? What changes in India’s National Clean Air Programme are required to achieve revised standards?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "The World Health Organisation released an updated version of the Global Air Quality Guidelines (AQGs). The guidelines recommend new air quality levels to protect the health of populations, by reducing levels of key air pollutants. This is the first-ever update of WHO since 2005.\n\n**The key updates of the new Global Air Quality Guidelines are:**\n\n* WHO’s new guidelines recommend air quality levels for six pollutants – particulate matter (PM 2.5 & PM10), ozone (O3), nitrogen dioxide (NO2), sulphur dioxide (SO2) and carbon monoxide (CO).\n* The annual average for PM2.5 and PM 10 should not exceed 5 micrograms and 15 micrograms per cubic metre of air respectively, while the 24-hour average should not exceed 15 micrograms and 45 micrograms per cubic metre.\n* The average levels of ozone, nitrogen oxide, sulphur dioxide and carbon monoxide should not exceed 100 micrograms, 25 micrograms, 40 micrograms, 4 micrograms per cubic metre respectively over a 24-hour period.\n\nThe new air quality guidelines mean that entire India would be considered a polluted zone for most of the year. The new WHO norms should push India to work harder to make its air cleaner and safer. The region has challenging meteorological and climatic conditions, with the added challenge of haze columns, heat island effects and exceedingly high base pollution.\n\nIndia’s National Clean Air Programme (NCAP) aims for a 20% to 30% reduction in particulate matter concentrations by 2024 in 122 cities, keeping 2017 as the base year for the comparison of concentration. India’s air pollution standards are more relaxed in comparison to WHO’s prescribed guidelines. Thus, efforts are needed to make the guidelines more stringent with revised targets. Under the proposed Clean Air for All, the government tends to make targets of PM2.5 & PM10 more stringent. There is a need to adopt an airshed approach to take measures to deal with air pollution.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_3_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**17. Describe the major outcomes of the 26th session of the Conference of the Parties (COP) to the United Nations Framework Convention on Climate Change (UNFCCC). What are the commitments made by India in this conference?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "The COP26 summit held at Glasgow brought parties together to accelerate action towards the goals of the Paris Agreement and the UNFCCC.\n\n**Major outcomes of the 26th CoP are as follows:**\n\n* **Methane Pledge:** The European Union and the US have launched a landmark pledge to slash emissions of greenhouse gas methane, a commitment that could prevent 0.2 degrees Celsius of global warming. The alliance’s members will seek to lower global emissions of methane (the second-largest contributor to climate change after carbon dioxide) by 30% below 2020 levels by 2030. India did not sign it.\n* **Deforestation Pledge:** More than 100 national leaders pledged to halt and reverse deforestation and land degradation by the end of 2030. The agreement vastly expands a commitment made by 40 countries as part of the 2014 New York Declaration of Forests and promises more resources.\n* **Call for Climate Finance:** India noted that climate finance cannot continue at the levels decided in 2009 (100 billion USD) and emphasized that it should be at least USD 1 trillion to meet the goals of addressing climate change. India underlined the unity and strength of Like-Minded Developing Countries (LMDC) as fundamental in the UNFCCC negotiations.\n* **Infrastructure for Resilient Island States (IRIS):** India launched it for developing the infrastructure of small island developing nations (SIDN). SIDN faces the biggest threat from climate change, India’s space agency ISRO will build a special data window to provide them timely information about cyclones, coral-reef monitoring, coastline monitoring etc.\n* **One Sun One World One Grid Group (OSOWOG):** It is an initiative by India and the United Kingdom to tap solar energy and have it travel seamlessly across borders. It includes a group of governments called the Green Grids Initiative (GGI) - One Sun One World One Grid group.\n\n**India made the ‘Panchamrit’ commitments (five promises) at the CoP 26:**\n\n* India will achieve **net-zero emissions** by 2070.\n* India will bring its **non-fossil energy capacity** to 500 GW by 2030.\n* India will bring its economy’s **carbon intensity** down to 45% by 2030.\n* India will fulfil 50% of its energy requirement through **renewable energy** by 2030.\n* India will reduce 1 billion tonnes of **carbon emissions** from the total projected emissions by 2030.\n\nCOP26 of Glasgow is a promising start on emissions reduction, however, on the part of global largest emitters, much more is expected to be done. In India’s context, it needs to work out a detailed plan of action with reference to phasing-down coal-based power generation and encouraging electric vehicles.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_3_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**18. Describe the various causes and the effects of landslides. Mention the important components of the National Landslide Risk Management Strategy.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "A landslide is defined as the movement of a mass of rock, debris, or earth down a slope. They are a type of mass wasting, which denotes any downward movement of soil and rock under the direct influence of gravity.\n\nSlope movement occurs when forces acting downward (mainly due to gravity) exceed the strength of the earth materials that compose the slope. Landslides are caused due to three major factors: geology, morphology, and human activity.\n\n* **Geology** refers to characteristics of the material. The earth or rock might be weak or fractured, or different layers may have different strengths and stiffness.\n* **Morphology** refers to the structure of the land. For example, slopes that lose their vegetation to fire or drought are more vulnerable to landslides.\n* **Human activity** refers to agriculture and construction which increases the risk of a landslide.\n* Landslides can be initiated in slopes already on the verge of movement by rainfall, snowmelt, changes in water level, stream erosion, changes in groundwater, earthquakes, volcanic activity, disturbance by human activities, or any combination of these factors. Earthquake shaking and other factors can also induce landslides underwater.\n\n**Different effects of landslides are as follows:**\n\n* Landslides have been verified to result in destruction of property. If the landslide is significant, it could drain the economy of the region or country. After a landslide, the area affected normally undergoes rehabilitation.\n* Infrastructure such as roads, railways, leisure destinations, buildings and communication systems can be decimated by a single landslide.\n* Communities living at the foot of hills and mountains are at a greater risk of death by landslides. A substantial landslide carries along huge rocks, heavy debris and heavy soil with it.\n* The soil, debris, and rock sliding downhill can find way into rivers and block their natural flow. Many river habitats like fish can die due to interference of natural flow of water.\n\n**Important components of National Landslide Risk Management Strategy are as follows:**\n\n* Generation of User-Friendly Landslide Hazard Maps\n* Development of Landslide Monitoring and Early Warning System\n* Awareness Programmes\n* Capacity Building and Training of Stakeholders\n* Preparation of Mountain Zone Regulations & Policies\n* Stabilisation and Mitigation of Landslides and Creation of Special Purpose Vehicle (SPV) for Landslide Management.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q14",
      "serial_no": "14",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**14. What are the forces that influence ocean currents? Describe their role in fishing industry of the world.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Ocean currents are like river flow in oceans. They represent a regular volume of water in a definite path and direction.\n\nOcean currents are influenced by two types of forces i.e. Primary Force, which initiates the movement of water while the secondary force influences the currents to flow. These forces are:\n\n* **Primary Force:**\n  + **Heating by Solar Energy**: It causes the water to expand which causes water to spread from hot to cold regions.\n  + **Wind:** Wind blowing on the ocean surface pushes the water to move on.\n  + **Gravity:** Gravity tends to pull the water down the pile and create gradient variation.\n  + **Coriolis Force:** It causes the water to move to the right in the northern hemisphere and to the left in the southern hemisphere.\n* **Secondary Force:**\n  + **Landmass**: Interaction of ocean with landmass results in change in direction of ocean current. For example: Brazil Ocean Current.\n  + **Salinity:** Water with high salinity is denser than water with low salinity, leading to variation in ocean currents as denser water tends to sink, while relatively lighter water tends to rise.\n\n**Ocean currents affect fishing industries in the following ways:**\n\n* **Creation of Fishing Zones:** Meeting of cold and warm ocean currents forms fishing zones in the ocean.\n  + Prominent examples are North East Pacific Zone, Newfoundland (Labradour & Gulf Stream), North West Pacific Zone along Japan (kuroshio and oyashio current) etc.\n  + Upwelling is a process in which currents bring deep, cold water to the surface of the ocean. Upwelling is a result of winds and the rotation of the Earth.\n* **Movement of Planktons:** Planktons are the organisms that come with ocean currents. They act as the base of the marine food chain and attract the fish populations towards them, leading to accumulation of fishes in a particular zone.\n  + Upwelling is a process in which currents bring deep, cold water to the surface of the ocean. The deeper water that rises to the surface during upwelling is rich in nutrients. These nutrients “fertilize” surface waters, encouraging the growth of plant life, including phytoplankton.\n* **Long Shelf Life:** Fishes in cold ocean currents have longer shelf life as compared to warm ocean currents, leading to non-perishable fish products.\n* **Ecological Balance:** Ocean currents maintain ecological balance by transferring water to the areas of less oceanic current and having low fish population to maintain oxygen level and fishes in the deficit area. Example: Saragasso Sea; Dead Zone.\n\nAlthough ocean current is the main player in creating fishing zones, the use of technology could be carried to develop fishing industries in other potential zones as well.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**15. Describing the distribution of rubber producing countries, indicate the major environmental issues faced by them.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "* Natural rubber is a polymer of isoprene, an organic compound. It comes from various sources, the most common being the Pará rubber tree (Hevea brasiliensis).\n* **Distribution of rubber producing countries:** Thailand produced 35% share of global natural rubber in 2020 followed by Indonesia.\n  + The tropical climate supports healthy rubber trees. It thrives in deep soil with resistance to flooding and in areas where the annual rainfall remains between 60 and 78 inches.\n* Despite **natural rubber being native to the Amazon basin**, approximately **90% of the world’s supply is grown in Asia.** Much of this comes from Southeast Asia – specifically Thailand, Indonesia, Vietnam, and Malaysia.\n* The other countries of the world that are producing the rubbers are Ivory coast, Brazil, Mexico, Gabon, Guina, Ecuador and Sri Lanka etc.\n\n#### **Environmental issues:**\n\n* The rubber cultivation is a plantation crop and takes a long gestation period to become a fruitful crop for providing monetary benefits. This plantation incurs many negative externalities like:\n  + Countries like Malysia and Indonesia has lost a large part of its natural forest due to cultivation of Rubber.\n    - It also leads to extinction of biodiversity and population of some of the iconic species like orangutans have reduced.\n  + Preference to plantation crops like Rubber reduces the cultivation of the food crops and reduces the chance to achieve SDGs.\n  + Monotonous cropping pattern reduces the rejuvenation capacity of the soil and the accelerated application of the synthetic fertilizer further reduces the capacity of the soil and residue fertilizer prevails various illnesses in the society.\n  + The long gestation period of the rubber plantation (7-8 years) makes it more vulnerable to pests and other climate induced diseases and illnesses that hamper the interest of the small crop holders and bring the issue of livelihood.\n  + The rubber plantation itself is the source of various pollution and GHGs like:\n    - The open burning of rubber plantation wastes in the form of rubber tree stumps after land clearing (in Malaysia).\n    - Per kg dry rubber generates eight kg of effluents and its Natural degradation releases a huge amount of carbon dioxide (CO2) and methane.\n    - The emission of the rubber industry has been linked to various diseases and diverse impacts on human health.\n  + The rubber industry is one of the major water polluting industries. It accelerates the problem of water scarcity in the rubber producing countries.\n\nIncreasing demand of rubber due to industrial expansion, the sustainable cultivation of rubber is the only way forward. The synthesis of local and global knowledge with the use of modern technology can prevail in the interest of all the stakeholders involved in the industry.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_2_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**8. Reforming the government delivery system through the Direct Benefit Transfer Scheme is a progressive step, but it has its limitations too. Comment.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Aiming greater transparency and accountability, the Government under its welfare programs has introduced the direct benefit transfer scheme. In 2011, Nandan Nilekani committee recommended the DBT scheme concept. Under DBT, transferring subsidies directly into the accounts of beneficiaries can minimize the duplication frauds and leakages. Some examples of DBT scheme are **PM KISAN YOJANA, M GNREGA Scheme, PAHAL YOJANA** etc.\n\nIn the field of Government delivery system, DBT is a progressive step in many ways such as-\n\n* It prevents duplication fraud of beneficiaries.\n* It provides targeted delivery and reduces the delay time of payments.\n* DBT wipes out intermediaries or middleman culture. It reduces the window for corruption and exploitation of poor beneficiaries.\n* It includes the faster flow of targeted funds and services. By this way, it fulfils the positive aspirations of citizen charter.\n\nThere is no doubt that DBT is a positive milestone in the government delivery system but it has some limitations which need to be addressed. Some of limitations are as follows-\n\n* Many beneficiaries are excluded due to not having access to banking services.\n* Due to lack of financial literacy among the masses, DBT cannot achieve its true potential.\n* Aadhaar card data and biometric data mismatch creates ruckus in service delivery system.\n* There are some networking issues in remote areas and rural areas. These led to a delay in services delivery.\n\n### Way forward\n\n* There is a need for robust technical infrastructure and capacity building.\n* Collaboration and coordination among various government departments is very much needed for swift delivery of services to targeted beneficiaries.\n* Government should run the financial literacy awareness program for harnessing the true potential of Direct Benefit Scheme.\n* There should be a provision of single window redressal platform for all glitches and issues related to direct benefit transfers.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**7. Discuss in detail the photochemical smog emphasizing its formation, effects and mitigation. Explain the 1999 Gothenburg protocol.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Photochemical smog also known as Los Angeles smog is a type of air pollution due to the reaction of solar radiation with airborne pollutant mixtures of nitrogen oxides (NOx) and volatile organic compounds (hydrocarbons).\n\n**Formation:**\n\nThe formation of photochemical smog is closely related to the concentration of primary pollutants (oxides of nitrogen such as nitric oxide, nitrogen dioxide, and nitrous oxide and most VOCs) in the atmosphere. In some cases, it is also related to the concentration of secondary pollutants (aldehydes, tropospheric ozone, and PAN).\n\n* Photochemical smog appears to be initiated by nitrogen oxides\n* Absorbing the visible or ultraviolet energy of sunlight, it forms nitric oxide (NO) to free atoms of oxygen (O), which then combine with molecular oxygen (O2) to form ozone (O3).\n* With hydrocarbons, certain other organic compounds, and sunlight, various chemical reactions take place to form photochemical smog.\n\n**Effects:**\n\n* Chemicals within it, when combined with hydrocarbons, form molecules which cause eye irritation.\n* Ground level ozone can prove to be extremely toxic to human beings.\n* Other negative symptoms include decreased vision and shortness of breath.\n* Acid rain and eutrophication.\n\n**Mitigation**\n\n* Catalytic converters can reduce vehicle emissions of nitrogen, carbon dioxide, and hydrocarbons.\n* reducing greenhouse gas emissions and noxious urban emissions from transport through Biofuels.\n* cleaner options for vehicles such as Hydrogen powered and electric vehicles\n\n**Gothenburg Protocol:**\n\n* It is to Abate Acidification, Eutrophication and Ground-level Ozone was adopted by the countries of UNECE in Gothenburg (Sweden) on 30 November 1999.\n* It is also known as Muti-effect protocol.\n* It sets emission ceilings for 2010 for four pollutants: Sulphur, NOx, VOCs and ammonia.\n* These ceilings were negotiated on the basis of scientific assessments of pollution effects and abatement options.\n\nCurrently, the protocol is under negotiation for a revised protocol. It was updated in 2012 to include particulate matter and black carbon.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**17. Discuss global warming and mention its effects on the global climate. Explain the control measures to bring down the level of greenhouse gases which cause global warming, in the light of the Kyoto Protocol, 1997.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Global warming is the long-term heating of Earth’s surface observed since the pre-industrial period (between 1850 and 1900) due to human activities, primarily fossil fuel burning, which increases heat-trapping greenhouse gas levels in Earth’s atmosphere.\n\n**Effects on Global Climate**\n\n* Early snowmelts, disappearing glaciers, and severe droughts are causing more water shortages.\n* Rising sea levels lead to more coastal flooding.\n* Heatwaves, heavy downpour, and increased flooding levels create trouble for farms, forests, and cities.\n* Disruption of coral reefs and alpine meadows could cause many plant and animal species to extinction.\n* Allergies, asthma, and infectious diseases will become more common due to higher levels of air pollution.\n\n**Control measures to bring down the level of greenhouse gases which cause global warming**\n\n* The Kyoto Protocol was an international treaty that commits state policies to reduce greenhouse gas emissions. It was adopted in 1997 and entered into force in 2005.\n* The Kyoto protocol targets emission of six gases which includes Carbon Dioxide (CO2), Methane (CH4), Nitrous Oxide (NO2), Sulphur hexafluoride (SF6), group of hydrocarbons (HCFs), and groups of per fluorocarbons (PFCs).\n* There are various mechanism to reduce levels of greenhouse gases under the Kyoto Protocol:  \n  + The clean development mechanism allows the country with emission-reduction commitment under the Kyoto Protocol to implement projects in developing countries.\n  + Carbon credit is a tradable certificate which is equal to one tonne of carbon dioxide. It attempts to limit the growth of concentration of greenhouse gases. Carbon credits can be acquired through afforestation, carbon sequestration, methane capture, etc.\n  + Joint implementation allows country with an emission reduction commitment under Kyoto Protocol to earn emission reduction units from emission reduction projects.\n  + Emission trading allows countries to sell unused emission units to other countries which have exceeded their targets.\n\nThe Kyoto Protocol is based on the principle of common but differentiated responsibilities and is only global treaty with binding limits on greenhouse gases emissions.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**18. Explain the causes and effects of coastal erosion in India. What are the available coastal management techniques for combating the hazard?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "The process of removal of coastal sand or displacement of land because of local sea level rise, strong wave action, heavy intrusion of sea water in coastal region can be termed as coastal erosion. The Ministry of Earth Sciences informed the Lok Sabha that of the 6,907.18 km long Indian coastline of the mainland, a significant area is under varying degrees of coastal erosion.\n\nFactors responsible for coastal erosion are:\n\n* **Natural reasons**   \n  + **Global Warming-** The increase in concentration of CO2 in atmosphere has led to warming of planet and has resulted in melting of glaciers which invariably has led to rise in sea level. Thus, threat of coastal erosion has increased manifold.\n  + **Planetary cycle-** Planetary position of Earth and Moon cause tides in the sea every fortnight\n  + Strong winds that blow across the planet generate huge energy; this generated energy is released by waves on the shores breaking rocks into sand in long run.\n  + **Warming of Sea Water**- It has increased the formation of cyclones in Indian peninsula and contribute to destruction of coastal areas.\n* **Anthropological reasons**   \n  + Violation of Coastal Management Zones (CMZ) rules by builders\n  + Energy production near coastal areas like nuclear energy, tidal energy plant\n  + Dredging at shallow waters near coasts\n  + Reduced flow of sand from river into ocean\n* **Effect of coastal erosion are:**  \n  + Rise of sea level has increased the threat submergence of small islands.\n  + Destruction of coastal habitats thus increases vulnerability of coastal flora and fauna.\n  + Loss of income from coastal ecosystems.\n\n**Major coastal management techniques to prevent erosion are:**\n\n**Natural response**\n\n* Coastal Shelter belts such as mangroves, coral reefs and lagoons are recognized as the best defence against sea storms and erosion, deflecting and absorbing much of the energy of sea storms. Therefore, it is important to maintain these natural habitats for shore protection as well as for environmental conservation.\n\n**Artificial response**\n\n* **Use of Geo-synthetic Tubes / Bags-** Geo-synthetic tube is a sizable, tube-shaped bag filled with sand slurry and fashioned with porous, weather-resistant geotextile that is used to create artificial coastal structures like breakwaters, dunes, or levees. They are aligned with the shoreline to weaken wave energy and protect against coastal erosion\n* **Artificial Beach Nourishment-** Often referred to as a “soft armoring” technique, beach nourishment, or beach filling technique is the practice of adding large quantities of sand or sediment to beaches to combat erosion and increase beach width.\n* **Groynes -** An active structure that protrudes into the sea from the shore and is often perpendicular to or slightly oblique to the shoreline is called a groyne. A groyne's primary job is to catch and hold back some of the sediment that is travelling through the surf zone, mostly in a longshore direction.\n\nWith the alarming rise in climate change threats, rising sea level is a certain outcome of the process. As coastal areas across India are densely populated, it has become quintessential that coastal planning is given concrete thought by considering the option of displacement of people to safe havens.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q4",
      "serial_no": "4",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**4. Discuss the consequence of Climate change on the food security in tropical countries.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Climate change impacts crop yields, water resources, biodiversity, food costs, and public health.\n\nSome of the consequences are:\n\n* **Reduced crop yields:** Higher temperatures, changing rainfall patterns, and more frequent and intense droughts and floods can reduce crop yields and quality.\n  + In Sub-Saharan Africa, maize yields have declined by 5.8%.\n* **Altered growing seasons:** Climate change can alter farming seasons, harming agriculture's productivity.\n  + In India, climate change is leading to erratic rainfall patterns and shorter growing seasons for crops like rice.\n* **Food price volatility:** Climate change can disrupt food supply and demand, causing price instability and harming food access.\n  + The 2007-2008 food crisis was partly triggered by climatic factors such as droughts and floods.\n* **Increased vulnerability**: Tropical countries face increased vulnerability to cyclones, and storms, leading to damage to crops, and food systems.\n  + In 2021, Cyclone Amphan caused widespread damage to agriculture and fisheries in India.\n\nTo boost food security in tropical countries, we require adaptation and mitigation measures such as:\n\n* Enhancing land management to reduce emissions and increase carbon sequestration.\n* Developing resilient crop varieties.\n* Diversifying food production systems and diets.\n* Promoting healthy and sustainable eating habits.\n* Reducing food waste throughout the supply chain.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**6. Discuss several ways in which microorganisms can help in meeting the current fuel shortage.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Microorganisms like algae, bacteria etc., can be used to generate several fuels, including ethanol, hydrogen, methane, lipids, and butanol out of raw organic materials, thereby converting the chemical energy in the biomass into chemical energy in the form of fuels.\n\n**Microorganism can help in meeting the current fuel shortage**\n\n* **Biofuel Production:** Certain microorganisms such as algae and bacteria can be used to produce biofuels like biodiesel and bioethanol. For example, algae can convert sunlight and carbon dioxide into lipids, which can be processed into biodiesel.\n* **Biogas Production:** Microbes are used in anaerobic digestion to break down organic waste, such as agriculture residues, sewage etc. to produce biogas.\n* **Hydrogen Production:** Several microorganisms can produce hydrogen gas through fermentation processes which can be further used as a clean fuel in various applications, including fuel cells, which can power vehicles.\n* **Bioremediation:** Microorganisms can help in cleaning oil spills and contaminated sites by breaking down hydrocarbons which can be used to recover useful hydrocarbons from polluted areas.\n* **Carbon Capture and Utilization:** Microorganisms can capture and convert carbon dioxide (CO2) emissions from industrial processes into biofuels.\n\nThe development of pilot plants for microbial energy fuel production is necessary to mitigate the fuel shortage and not only can it reduce the higher crude prices but also can serve the environment in a sustainable way.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**7. Dam failures are always catastrophic, especially on the downstream side, resulting in a colossal loss of life and property. Analyze the various causes of dam failures. Give two examples of large dam failures.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "A dam failure is simply an uncontrolled release of water from a reservoir through a dam because of structural failures or deficiencies in the dam. Ranked third in terms of building large dams, dam failure in India can potentially result in a release of large quantities of water imposing risks on the people or property downstream.\n\n**Causes of dam failures**\n\n* **Overtopping:** It is caused due to poor spillway design, leading to a reservoir filling too high, especially in times of heavy rainfall.\n* **Foundational Defects:** Instability of slopes can lead to seepage of water beneath the dam.\n* **Operational Failures:** Valves and conduit failures often cause improper functioning which can lead to inadequate water discharge.\n* **Geological Instability**: Tectonic induced calamities like landslides, earthquakes can pose a threat to dam structures.\n* **Ageing Dams:** Rising frequency of flooding and other environmental changes can accelerate the dam’s ageing process.\n* **Structural Failure:** Inadequate design, construction materials, or maintenance can lead to dam collapse.\n\n**Examples of large dam failures**\n\n* **Machchu II Dam Failure (1979):** Due to heavy rainfall and improper design, the Machchu II Dam in Gujarat burst, resulting in a catastrophic flood. The torrential flow destroyed villages, claiming the lives of over 2,000 people.\n* **Tiware Dam Failure (2019):** Situated in Ratnagiri, Maharashtra, the Tiware dam breached due to excessive rainfall, flooding seven villages and killing several people.\n\nEfforts like the Dam Safety Act 2021 and Dam Rehabilitation and Improvement Project (DRIP) are the steps in right direction to prevent catastrophic events of dam failure in India.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**8. What is oil pollution? What are its impacts on the marine ecosystem? In what way is oil pollution particularly harmful for a country like India?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Oil pollution, also known as oil contamination or oil spills refers to the release of crude oil or refined petroleum products into the water bodies caused due to accidents involving oil tankers, pipelines, offshore drilling rigs, or other industrial processes.\n\n**Its impacts on the marine ecosystem**\n\n* **Harm to Marine Life:** It causes difficulty in regulating marine animals body temperatures by coating feathers of seabirds, fur with oil spills which leads to hypothermia.\n* **Toxicity:** Crude oil components are toxic to marine organisms and causes damage to their organs, impairing reproduction.\n* **Habitat Destruction:** Oil spills can damage coral reefs, seagrass beds, and marshes which are critical for marine life.\n* **Disruption of Food Chain:** Loss of biodiversity can have a cascading effect, as many species are interdependent. For example, phytoplankton, the primary producer can be killed due to oil contamination.\n\n**Oil pollution is particularly harmful for a country like India for several reasons**\n\n* **Economic Impact:** India is world's second-largest aquaculture nation and the third-largest fish producer after China. Oil pollution can disrupt fishing and tourism industries.\n* **Environmental Consequences:** India is home to diverse marine ecosystems, including coral reefs, mangroves etc., oil pollution can lead to loss of biodiversity.\n* **Health Implications:** India has a coastline of over 7500 km. Oil spill can pose a significant health threat to coastal communities and people who rely on sea food.\n\nOil pollution is a matter of concern for India and efforts to prevent and mitigate the impacts of oil spills are essential to protect the country’s coastal environment, economy and well-being of its coastal communities.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**15. The adoption of electric vehicles is rapidly growing worldwide. How do electric vehicles contribute to reducing carbon emissions and what are the key benefits they offer compared to traditional combustion engine vehicles.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "The adoption of electric vehicles has been on the rise globally due to increased environmental awareness and increasing government incentives for ensuring more sustainable transport options and controlling rising temperatures.\n\n**Role of electric vehicles in reducing carbon emissions**\n\n* EVs being more energy efficient consume less energy than traditional vehicles and emit less GHG emissions.\n* They reduce dependency on fossil fuels, particularly gasoline products and hence, diversify energy baskets.\n* EVs run on electricity which can be generated from cleaner sources like renewables. It reduces direct emissions of GHGs like carbon monoxide, CO2, etc.\n* The transition from internal combustion engines to electric motors reduces carbon dioxide (CO2) emissions and other pollutants, contributing to improved air quality and a greener future.\n\n**Key benefits of EVs compared to traditional combustion engine vehicles**\n\n* Having lower fueling and maintenance costs, EVs offer cheaper alternate than gasoline products.\n* They can reduce a significant amount of greenhouse gas emissions, especially when charged from renewable sources.\n* EVs deliver instant torque, providing quick acceleration and a responsive driving experience.\n* They are quieter than traditional vehicles, which can lead to lower noise pollution promoting a more pleasant environment.\n* EVs generally have lower center of gravity which offers better handling and comfort.\n\nEVs offer numerous advantages over traditional vehicles but sustainable generation of electricity is still a cause for concern. However, with technological advancements, and government incentives, EVs can offer a potential solution for emission less future.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**17. Comment on the National Wetland Conservation Programme initiated by the Government of India and name a few of India’s wetlands of international importance included in the Ramsar Sites.**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Ramsar Convention is an international treaty for the conservation and sustainable utilization of wetlands. A wetland listed under the Convention is called wetlands international importance. Important Ramsar sites in India include the following:\n\n* Karikili bird sanctuary (Tamil Nadu): It is home to cormorants, grey heron and open-billed stork.\n* Pichavaram mangrove (Tamil Nadu): It is an island of vast mangrove forest.\n* Chandra Taal: It is one of the two high altitude Ramsar wetlands.\n\nThe National Wetland Conservation Programme (NWCP) was initiated to protect wetlands considering the benefits provided by them such as freshwater supply, resource pool, biodiversity, flood control, groundwater recharge, and climate change mitigation. The NWCP seeks to conserve wetlands and prevent degradation while providing local communities access to the benefits provided by them.\n\n**Importance of NWCP**\n\n* The Ministry of Environment, Forest and Climate Change (MOEFCC) has identified 115 wetlands that require urgent conservation and management.\n* It defines wetlands in the same way as prescribed under the Ramsar Convention on Wetlands.\n* While wetlands are administered by state governments, the central government is responsible for funds, technical assistance and overall coordination.\n\n**Objectives of NWCP**\n\n* Laying down policy guidelines for conservation and management of wetlands.\n* Preparing and maintaining inventory of wetlands.\n* Allocation of financial assistance to states.\n* Monitoring the implementation of the program.\n* Sponsoring multidisciplinary research by institutions.\n\nThe National Wetlands Conservation Programme (NWCP) and National Lake Conservation Plan (NLCP) were merged under National Plan for Conservation of Aquatic Eco-systems (NPCA) to synergise efforts and avoid overlap of administration. India had achieved a great deal in safeguarding its wetlands.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**18. The Intergovernmental Panel on Climate Change (IPCC) has predicted a global sea level rise of about one metre by AD 2100. What would be its impact in India and the other countries in the Indian Ocean region?**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "Global warming and its associated problems, which were once educated assumptions have now become actual problems. The rise of global sea level and its impact has been widely talked about since the report by IPCC released.\n\n**Impact on India and the region**\n\n* **Environmental impact:**\n  + **Shrinkage of Coastline:** India derives immense economic benefits from its vast coastline. It will be threatened if the coasts start submerging in ocean.\n  + **Costal Wetland Degradation:** Wetlands near coastal zones have a threat of degradation and even extinction.\n  + **Coral Bleaching:** Fresh water dilution resulting from an increased sea surface level is bound to cause coral bleaching.\n  + **Fauna Displacement:** Animals and biodiversity gets displaced from their environment which causes distress.\n  + **Groundwater Salination:** The water table gets contaminated by the incoming saltwater from the ocean, therefore reducing availability of usable groundwater.\n* **Economic impact:**\n  + **Property and Resource:** Damage to the property and resource due to increased occurrence of costal disasters will incur a high cost for the nation.\n  + **Loss of Livelihood:** Employment in costal based professions will take a hit as the people would have to relocate due to lack of livelihood options. Employment patterns will also change.\n* **Social impact:**\n  + **Displacement of People:** Climate refugees are a group of people that have been displaced by the horrors of climate change. The number of people losing their houses to the impact of climate change is rising every year.\n  + **Stress on Inland Location**: People displaced by the changes on the coastal areas are bound to move towards inland locations thereby putting pressure on already stressed resources.\n\n### Measures\n\n* Activities such as mangrove plantation can help in mitigating the problems of rising sea surface.\n* Coastal Regulation Zone (CRZ) Rules and Integrated Coastal Zone Management Plan seek to regulate the management and resource utilization in coastal areas.\n\nVarious other researches predict an even early onset of these effects with much more devastating consequences. Considering the impacts of the rise of sea levels, the government must work on a policy to address the issues related specifically to the rising sea level.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q6. What is the phenomenon of cloudbursts? Explain. (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "### Approach\n\n* Introduce the phenomenon of cloudburst with recent examples.\n* Mention the mechanism and impacts of cloudburst\n* Conclude Suitably\n\n### Introduction\n\nCloudbursts are **intense rainfall events, exceeding 100 mm/h, over a small area of 20-30 square km**. Recent cloudbursts in hilly regions like Uttarakhand and Himachal Pradesh have highlighted this phenomenon. \n\n### Body\n\n**Mechanism of Cloudburst**\n\n**![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_1_Q6_IMG_1.png)**\n\nCloudbursts happen when warm, moist air rapidly rises due to various factors like: \n\n* **Orographic lift:** Moist air is pushed upward by mountains or hills, cooling quickly and condensing into heavy rainfall.\n* **Convective processes:** The warm air near the surface rises due to temperature differences and forms **cumulonimbus clouds**.  \n  + If the air at higher altitudes cools rapidly, it can trap the moisture, leading to sudden, concentrated rainfall.\n\nWhen the  **moisture in these clouds becomes too heavy**, it is released in a short, violent downpour, often accompanied by thunder and lightning.\n\n**Impacts:** \n\n* **Flash Floods**: Sudden water release causes rivers to overflow, devastating communities.\n* **Landslides**: Rain in mountainous areas triggers landslides.\n* **Infrastructure Damage**: Roads, bridges, and buildings suffer severe damage.\n* **Loss of Life**: Cloudbursts, especially in hilly areas, can lead to fatalities.\n\n### Conclusion\n\nIndia has seen a rise in cloudburst events, especially in vulnerable areas like the Himalayas and coastal cities. Improved weather monitoring and climate adaptation plans are urgently needed to mitigate these disasters.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_2_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**Q20. Discuss the geopolitical and geostrategic importance of Maldives for India with a focus on global trade and energy flows. Further also discuss how this relationship affects India's maritime security and regional stability amidst international competition ? (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "### Approach\n\n* Write in brief about the strategic location of Maldives.\n* Discuss how geopolitical and geostrategic importance of Maldives affects global trade and energy flows.\n* Show how external players like China impact India-Maldives relations.\n\n### Introduction\n\nMaldives – a key part of India’s neighbourhood first policy – is strategically located in the Indian Ocean along critical maritime routes, defining Maldives’ geopolitical and geo-strategic importance far beyond its physical size.\n\n### Body\n\n**Geopolitical and Geostrategic Importance of Maldives:**\n\n* **Sea Lanes of Communication (SLOCs):** The Maldives has two critical SLOCs at its southern and northern ends, vital for maritime trade between the Gulf of Aden, Gulf of Hormuz, and the Strait of Malacca.\n  + 50% of India's external trade and 80% of its energy imports pass through these SLOCs in the Arabian Sea.\n* **Indian Ocean as India’s Backyard**: The Maldives is crucial for India's role as net security provider in the Indian Ocean due to its strategic location, collaborative defence initiatives, and joint efforts in maritime surveillance and humanitarian assistance.\n\n**Impact of Changing India-Maldives Relationship:**\n\nIn the recent years, there has been a **perceived decline in India-Maldives relations:**\n\n* **Strategic Dynamics:** India's **limited engagement** with the Maldives has enabled China's growing influence through **BRI investments**, threatening India's control over key maritime routes and its maritime security.\n* **Economic Competition**: Due to comparatively **less India’s investment** in Maldives, China with its **chequebook diplomacy** has emerged as a major economic player, directly challenging India's long-standing position as the primary partner in the region.\n* **Diplomatic Strain:** Maldives' balancing strategy, fueled by perceived **Indian 'Big** **Brother syndrome',** complicates India's diplomatic efforts and weakens its influence in the Indian Ocean.\n* **Maritime Security:** China's **submarine and destroyer** deployments, along with new docking facilities in the Maldives and Sri Lanka, pose a direct threat to India's maritime interests.\n* **Terrorism:** **Anti-Indian sentiment** and Maldives' focus on **Islamic values raise** concerns about terrorism, potentially destabilising the region and threatening India's security.\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_2_Q20_IMG_1.png)\n\n### Conclusion\n\nAmid rising Chinese influence and anti-India sentiment, strengthening India-Maldives relations is essential for regional stability and mutual prosperity. A harmonious partnership will benefit economic development, security, and cultural ties, fostering a more resilient and prosperous future for both countries.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_3_Q4",
      "serial_no": "4",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**Q.4 Explain the role of millets for ensuring health and nutritional security in India. (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "### Approach:\n\n* Introduce the significance of millets.\n* Discuss their role in promoting health and nutritional security.\n* Conclude with a forward-looking perspective.\n\n### Introduction:\n\nMillets are drought-resistant \"nutri-cereals\" that contain **7-12% protein** and boast a superior amino acid profile. Often called **superfoods** as they are both affordable and nutritionally rich.\n\n* Additionally, the UN has designated **2023 as the International Year of Millets.**\n\n### Body:\n\nRole of Millets in Ensuring Health\n\n* **Gluten-Free Option:** Millets are naturally **gluten-free**, with a **low glycemic index** and high fibre content, making them ideal for individuals with gluten intolerance or celiac disease.\n* **Mitigating Lifestyle Diseases:** High in dietary fibre, antioxidants, and minerals like magnesium and iron, millets help prevent lifestyle diseases like diabetes, obesity etc.\n* **Enhancing Immunity:** With **abundant B vitamins** and minerals such as zinc and selenium, millets support immune function, particularly **pearl millet (bajra)**, known for its high zinc content.\n\nRole of Millets in Nutritional Security\n\n* **Tackling Hidden Hunger:** Millets combat micronutrient deficiencies; about 3**0% of Indian** women aged 15-49 suffer from iron deficiency anaemia (WHO).\n* **Nutritional Security:** Millets are photo-insensitive, climate-resilient, and water-efficient \"nutri-cereals\" that offer a rich source of nutrition. Their cultivation is encouraged in drought-prone states (Maharashtra and Rajasthan) to support farmers.\n\n### Conclusion:\n\nThus, initiatives for **Nutritional Security through Intensive Millets Promotion (INSIMP),** and increased MSP for millets are significant steps in the right direction. Shifting perceptions and incorporating these nutrient-rich grains can lead to a healthier future.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_3_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**Q.10 Describe the context and salient features of Digital Personal Data Protection Act 2023. (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "### Approach:\n\n* Introduced the Digital Personal Data Protection Act, 2023 (DPDP Act) as a significant step in India's data privacy landscape.\n* Provide context related to the Act.\n* Discuss its key salient features\n* Conclude by emphasising the Act's importance and potential impact on data privacy in India.\n\n### Introduction:\n\nAmidst the rapid growth of **digital technology** and the increasing reliance on data-driven services, the **Digital Personal Data Protection Act, 2023** marks a significant step forward in **India's data privacy landscape.**\n\n### Body:\n\n**Context:**\n\n* **Rapid Digitalization**: With over **750 million** internet users as of 2023.\n* **Rising Data Breaches:** Increased incidents compromising personal information, exemplified by the **Air India data breach** in 2021.\n* **Global Data Protection Trends**: International regulations like General Data Protection Regulation of the European Union.\n* **Absence of Comprehensive Law:** Over-reliance on the **outdated IT Act, 2000.**\n* **Digital Public Infrastructure:** Systems like **Aadhaar,** the largest biometric ID system.\n\n**Salient Features:**\n\n* **Applicability:** Applies to processing **digital personal data in India and abroad** if offering goods or services in India.\n  + Personal data processing requires **individual consent, with clear notice about data collection purposes.**\n* **Rights of Data Principals:** Individuals can obtain **information about data processing**, seek corrections.\n* **Obligations of Data Fiduciaries**: Data fiduciaries must **ensure data accuracy** and erase data after its purpose is fulfilled.\n* **Exemptions:** Certain rights and obligations do not apply to cases like **crime prevention or government activities for state security.**\n* **Data Protection Board of India:** A regulatory body will monitor compliance, impose penalties, and handle grievances.\n\n### Conclusion:\n\n**Digital Personal Data Protection Act, 2023** marks a crucial advancement in India's data protection landscape, striving to **balance individual privacy rights, digital democracy with the needs of enhanced digital scrutiny and national interests.**",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_3_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**Q17. What is disaster resilience? How is it determined? Describe various elements of a resilience framework. Also, mention the global targets of Sendai Framework for Disaster Risk Reduction (2020-2030). (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "### Approach:\n\n* **Introduction:** Define disaster resilience\n* **Body:**\n  + Mention factors determining Disaster resilience along with elements of a resilience framework.\n  + Mention 7 Global Targets Of Sendai Framework For Disaster Risk Reduction (2015-2030) along with Priorities for Action.\n* **Conclusion:** Give the Government of India’s initiative to implement the Sendai Framework.\n\n### Introduction:\n\n**Disaster resilience** is the ability to withstand, prevent, and recover from the **harmful effects of natural hazards** on people, places, and the environment.\n\n### Body:\n\nDisaster resilience is determined by several factors, including:\n\n* **Adaptive capacity:** The ability to adjust to **disturbances, moderate damage,** and learn from shocks.\n* **Exposure to risk:** The magnitude and frequency of shocks or stress.\n* **Sensitivity:** How much a system is affected by a shock or stress.\n* **Organisation:** The ability to organize oneself to learn from past disasters and reduce future risks.\n\n**Four Elements of Resilience Framework:**\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_3_Q17_IMG_1.png)\n\n**Global Targets of Sendai Framework For Disaster Risk Reduction (2015-2030):**\n\nThe Sendai Framework for Disaster Risk Reduction is a UN General Assembly-endorsed agreement that aims to reduce disaster risk and losses through a combination of **global targets and a shared responsibility** between governments and other stakeholders.\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_3_Q17_IMG_2.png)\n\n**Priorities for Action:**\n\n* **Priority 1:** Disaster risk management needs to be based on an understanding of disaster risk in all its **dimensions of vulnerability**, capacity, exposure of persons and assets, hazard characteristics, and the environment.\n* **Priority 2:** Disaster risk governance at the **national, regional, and global levels** is vital to the management of disaster risk reduction in all sectors.\n* **Priority 3:** Public and private investment in **disaster risk prevention** and reduction through **structural and non-structural measures** are essential to enhance the economic, social, health and cultural resilience of persons, communities, countries and their assets, as well as the environment.\n* **Priority 4:** Enhancing disaster preparedness for effective response, and to Build Back Better in recovery, rehabilitation, and reconstruction.\n\n### Conclusion:\n\nThe **Government of India** has issued a set of priority actions based on the goals, targets, and priorities of the Sendai Framework 2015-2030. The government of India, during the **Asian Ministerial Conference for Disaster Risk Reduction (AMCDRR) 2016,** has extended the grant of USD 1 million to UNISDR for the effective implementation of the Sendai Framework for Disaster Risk Reduction in the **Asian region**.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_3_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**Q18. Flooding in urban areas is an emerging climate-induced disaster. Discuss the causes of this disaster. Mention the features of two such major floods in the last two decades in India. Describe the policies and frameworks in India that aim at tackling such floods. (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "GeographyAndEnvironment"
    },
    "solution": {
      "explanation": "### Approach\n\n* Start the answer by defining urban flooding.\n* Discuss key contributors to urban flooding. Highlight significant flood events, noting their causes. Highlight policies and frameworks related to flood management.\n* Conclude by emphasising the importance of effective management and sustainable infrastructure to enhance urban resilience against flooding.\n\n### Introduction\n\nUrban flooding, a climate-induced disaster, occurs when heavy rainfall overwhelms drainage systems, inundating land or property in densely populated areas like cities.\n\n### Body\n\n**Causes of Urban Flooding:**\n\n* **Climate change:** Drives urban flooding by **increasing rainfall intensity.** Warmer air **holds more moisture, resulting in heavier precipitation**. Rising temperatures, particularly in **urban heat islands,** further disrupt seasonal weather patterns.\n  + **Sea-level rise** heightens risks for coastal cities, leading to flooding and freshwater contamination.\n* **Urbanisation:** Exacerbates flood risks by increasing impervious surfaces that elevate runoff and reduce water absorption, while encroachments on floodplains disrupt natural water flow due to inadequate regulations.\n* **Improper Solid Waste Management:** Blocks drainage systems, causing overflow **during heavy rains and further complicating flooding risks** with the mixing of sewage and stormwater.\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_3_Q18_IMG_1.png)\n\n**Major Flood Events:**\n\n* **Chennai Floods (2015):** Heavy rains and poor drainage, along with the destruction of **300 inland water bodies** due to urban growth, intensified flooding. Significant reduction of **Pallikaranai marshlands** undermined natural ecosystems and flood control.\n* **Mumbai Floods (2005):** Triggered by heavy rainfall, overwhelming a **century-old drainage system** designed to **handle only 25 mm of rain per hour.** Urbanisation led to a **40% reduction in mangroves** and decline in **green spaces,** further aggravating flooding and preventing effective water absorption.\n\n**Policies and Frameworks to Tackle Urban Floods in India**\n\n* **Guidelines on Management of Urban Flooding (2010):** Issued by National Disaster Management Authority, these guidelines promote a multi-disciplinary approach for urban flood management planning.\n* **Smart Cities Mission (2015):** Promotes sustainable urban infrastructure, including smart drainage and flood management systems.\n* **AMRUT 2.0:** Focuses on upgrading stormwater drainage and urban infrastructure to reduce flood vulnerability.\n* **Storm Water Drainage Manual (2019):** Provides guidance on sustainable stormwater management and flood response planning.\n\n### Conclusion\n\nUrban flooding driven by climate change poses significant risks to cities. Effective management through sustainable infrastructure and adherence to NDMA guidelines can enhance city resilience.",
      "explanation_format": "markdown"
    }
  }
]