[
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_1_Q1",
      "serial_no": "1",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**1. Early Buddhist Stupa-art, while depicting folk motifs and narratives successfully expounds Buddhist ideals. Elucidate. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "After the death of the Buddha, Stupas were raised in his honor. The relics of the Buddha were distributed to different kingdoms and Stupas were erected over them. The Buddhist Stupa transcends its predecessor, the burial mound, by shifting the emphasis from a particular relic to a higher transcendental actuality as realized by the Buddha, i.e. the Buddha's enlightenment.\n\n* The Jataka stories were depicted on the torans of Stupas. The Jataka stories are a method of teaching Buddhists the lessons of karma, samsara and dharma. The overall structure of the Jataka Tales is about the cycle of samsara that the Buddha had to experience before reaching enlightenment.\n* The main structure of the Great Stupa consisted of a flattened hemispherical dome, called an anda, placed atop a cylindrical base. Anda, literally an egg, alluded not only to the shape, but to its deeper significance as a symbol of latent creative power.\n* The anda was also intended as an architectural replica of the infinite dome of heaven, representing the cycle of death and rebirth.\n* The harmika, located at the summit of the anda, symbolized the zenith beyond life and death (nirvana). Its resemblance to a sacrificial altar was of particular significance for the attainment of nirvana required the sacrifice of the self and the world (what was below needed to be sacrificed to reach the top).\n* The parasol was always a distinguishing feature that implied royalty and dignity; it symbolized the sacred Tree of Life or enlightenment.\n* The three elements of the chattra at Sanchi represented the Three Jewels of Buddhism: the Buddha, the Dharma (the Law), and the Sangha (the community of monks).\n* Vedikas were repeated around the stupa and on the terrace on which the anda rested (medhi level). They served to demarcate the boundary of the sacred precinct with the secular world.\n\nIn this way Buddhist stupa-art successfully expounds Buddhist ideals.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**11. Give an account of the current status and the targets to be achieved pertaining to renewable energy sources in the country. Discuss in brief the importance of National Programme on Light Emitting Diodes (LEDs). (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "The Ministry of New and Renewable Energy has revised its target of renewable energy capacity to 1,75,000 MW till 2022, comprising 1,00,000 MW Solar, 60,000 MW Wind, 10,000 MW Biomass and 5,000 MW Small Hydro projects.\n\nCurrently the installed capacity of renewable energy in India is 48.85 GW of which the contribution from solar, wind and biopower is 5.8GW, 25 GW and 4.5 GW respectively. The steps taken by government to support and increase the share of renewable energy in India’s power matrix and to achieve the new target are:\n\n* Enactment of a national offshore wind energy policy.\n* Govt plans to set up a trading platform for clean energy to help states buy, sell and trade renewable-based power.\n* 10-year tax exemption for solar energy projects.\n* Govt has outlined new guidelines which allow states to use its unproductive and non-agricultural land for solar parks.\n\nIn order to make Energy Efficiency a high priority National Programme on Light Emitting Diodes (LEDs) has been initiated. The importance of National Programme on Light Emitting Diodes (LEDs) is following.\n\n* It aims to install LED bulbs for domestic and street-lighting in 100 cities across India by March 2016.\n* LED bulbs will be distributed in a phased manner.\n* LED bulbs have a very long life, almost 50 times more than ordinary bulbs, and 8-10 times that of CFLs, and therefore provide both energy and cost savings in the medium term. It will help in saving of energy around 24 crore units every year.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**16. With reference to National Disaster Management Authority (NDMA) guidelines, discuss the measures to be adopted to mitigate the impact of recent incidents of cloudbursts in many places of Uttarakhand. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Cloudburst is a short-term extreme precipitation of 10 cm or above rainfall in an hour which occurs over a small area.\n\nWhen saturated clouds are unable to produce rain because of the upward movement of warm current of air leading to excessive condensation, raindrops are carried upwards by the air current instead of dropping as rainfall. After a point raindrops become too heavy to be carried upwards and drop together in a quick flash. This phenomenon is known as cloudbursts.\n\nRainfall does not directly cause death but the consequences of the cloudbursts in the form of rainfall triggers landslides, flash floods, houses and establishment getting swept and cave in lead to death and damage. Restoring settlements near mountain foothills is difficult due to flashfloods that might happen from cloudburst.\n\n**Ways to minimise the loss of life and property**\n\nDetecting cloud bursts is a difficult task as it covers small areas so precaution will go a long way in lessening the damage.\n\n* Stopping haphazard construction in hilly areas.\n* Preventing encroachments of riverbeds.\n* Afforestation programmes specially on hill slopes to prevent landslides.\n* Alert-relay system (Early warning system) should be put in place so that people can evacuate on time.\n\nThe damaged ground must be replanted as soon as possible since erosion caused by loss of ground soil cover can lead to flash flooding and additional landslides in the near future.\n\nSpace Application Centre (SAC) of ISRO has developed a model for heavy rainfall/cloud burst alert to prevent the damage caused by a cloudburst. It is currently working on pilot basis but once its effectiveness is proven, it will go a long way in saving lives.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_4_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**5. Law and Ethics are considered to be the two tools for controlling human conduct so as to make it conducive to civilized social existence. (2016)**  **(a) Discuss how they achieve this objective.**  **(b) Discuss how they achieve this objective.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "**(a)** Laws are rules of conduct that government creates and requires people to obey. Whereas ethics are guidelines for proper behavior that come from sources other than the government, like personal morals, values or code of conduct established by professional organizations etc. Both law and ethics shape our behavior but ethics often shapes our behavior before laws do.\n\n**(b)** While both law and ethics shape human conduct, each follows a different approach in doing so. Whereas as laws are more objective, ethics are subjective. Legal standards are mostly negative ie., they usually prescribe not to do something. Ethics on the other hand are more positive and tell what is the right thing to do. For example— Law forbids to harm other people, ethics tell us to help other people.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**5. How does the Juno Mission of NASA help to understand the origin and evolution of the Earth? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "With the principal goal to understanding the origin and evolution of Jupiter, the Juno spacecraft (NASA) was launched in 2011.  Juno will study Jupiter much more thoroughly, given the array of nine scientific instruments that it carries on board.\n\nThe huge gas planet was likely the first planet formed and had a major impact on the formation of other planets. Like our sun, Jupiter is composed primarily of hydrogen and helium but is also imbued with other heavy elements fundamental to the creation of terrestrial planets.\n\nBy studying the atmosphere on Jupiter we can get an unprecedented insight into its origins and most importantly on the origins of other planets in our solar system including Earth. Once Jupiter’s current construction is known, it will then be possible to work out how, when and potentially where in the Solar System the first planet formed. The spacecraft will hunt for oxygen (in the form of water) in Jupiter’s atmosphere, which may also help explain how Earth got its water.\n\nTo summarize, we can expect to learn a wealth of information about Jupiter’s inner workings in the months and years to come. In discovering Jupiter, we’ll be discovering a part of ourselves.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**6. Stem cell therapy is gaining popularity in India to treat a wide variety of medical conditions including leukaemia, Thalassemia, damaged cornea and several burns. Describe briefly what stem cell therapy is and what advantages it has over other treatments? (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Stem cells refer to class of undifferentiated cells that have ability to differentiate into various specialized cells. These cells have potential to develop into many cell types in body during early life and growth. In many tissues these cells work as a kind of internal repair system to replenish other cells.\n\nThis ability to repair and regenerate damaged cell is used in **stem cell therapy** for treatment of various diseases. In this therapy, stems cells are administered systematically and directly in high concentration in damaged tissues for self-healing. Stems cells for this purpose are obtained from the patient’s bone marrow, fat and umbilical cord tissue or blood. This therapy is being promoted as the next panacea for all ills.\n\n* Diseases that were earlier considered degenerative, incurable and irreversible are being treated with the help of stem cell therapy. The list includes diseases like diabetes, heart disease, spinal cord injuries, Parkinson's, Alzheimer's disease etc.\n* Blood stem cells are increasingly being used to treat diseases of the blood. Some methods of treatment like chemo therapy used in treatment of cancer destroys bone marrow also. Stem cell transplant can be used to replace such bone marrow.\n\nIndia is among the frontrunner in stem cell therapy. Clinical trials are being performed to treat genetic, metabolic and blood related conditions. Stem cell has the potential to replace expensive, painstakingly protracted and routinely ineffective conventional therapy for treating a multitude of acute and chronic ailments.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**7. India has achieved remarkable successes in unmanned space missions including the Chandrayaan and Mars Orbiter Mission, but has not ventured into manned space mission. What are the main obstacles to launching a manned space mission, both in terms of technology and logistics? Examine critically. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "India has been able to carry out unmanned spaced mission but lacks the full fledged capabilities in manned space missions. Although some developments have taken place in terms of technology and logistics, India is still facing some hurdles in launching manned space missions.\n\n**Technology**\n\n* India lacks the technology to carry heavy payloads into space.\n* Full capabilities in re-entry technologies are yet to be developed.\n* India could not get international cooperation in the field such as cryogenic technology at early stage.\n* ISRO is planning to launch manned space programme by 2021-24. Towards this end, it has unveiled a prototype of its first crew capsule (4 metre high module) designed to carry two people into low earth orbit.\n* India in 2017 launched the GSLV (Geosynchronous Satellite Launch Vehicle) Mark 3 from Satish Dhawan Space Centre. It carried a three ton payload, including “Crew Module Atmospheric Re-entry Experiment (CARE)”. However the third stage of cryogenic technology in GSLV is still not fully developed. GSLV Mark 3 will also be upgraded and tested to carry payloads upto 8 tonnes.\n* India is also working on Space Capsule Recovery Experiment-2 (SRE-2) that will demonstrate critical technologies required for recoverable launch vehicles.\n\n**Logistics**\n\n* India is depended mainly on single type of launch vehicle such as that of PSLV which hampers the capacity expansion of the programme.\n* India does not have its own global navigation system.\n* Funding and finance is essential to develop various equipments, technology  and new tools required in the coordination of a manned space programme. But ISRO is still waiting for the government approval and funding for a human space flight programme.\n\nSome scientists hold the view that private players have much more flexibility, freedom and risk taking abilities than the state owned agencies. Thus there should be more participation of private players in space programmes. India must realize that China launched its manned space mission to space in 2016 and will establish its permanent space station by 2022. Therefore India should also increase its footprints in manned space mission capabilities at the earliest.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**8. Not many years ago, river linking was a concept but it is becoming reality in the country. Discuss the advantages of river linking and its possible impact on the environment. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "India is endowed with vast natural resources distributed unevenly across the country. National Perspective Plan for river linking was initiated with the objective of transferring water from surplus basins to deficit basins. The river linking project has many advantages as listed below–\n\n* Transfer of water from surplus regions like Assam and Bihar will help in solving the perennial flood problem that plagues these regions.\n* As a corollary many drought affected areas will be able to access sufficient water for irrigation, drinking and other purposes.\n* River linking project will provide additional irrigation benefits. According to estimates, around 35 Mha of additional irrigation potential will be created.\n* It has also been estimated that around 34,000 megawatt of hydroelectricity would also be produced that could be used for irrigation and other purposes.\n* The wide network of inland navigation proposed by the government will also be facilitated by the initiative. This move will ease pressure on rail and road transport.\n* Inter-state water dispute will also be resolved to a great extent.\n\n**Possible impact on environment**\n\n* It is feared that construction of big dams and long canals will destroy natural vegetation and will disturb the ecological balance.\n* The project will also be detrimental to mangroves in the delta region of West Bengal and will have implications for richest fisheries in India.\n* It will inundate large tract of fertile agricultural land and make them unsuitable for agriculture.\n\nThe river link project is not without its disadvantages. The environmental angle needs to be taken into consideration such that minimum damage accrues to ecology and environment.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**11. One of the intended objectives of Union-Budget 2017-18 is to ‘transform, energize and clean India’. Analyze the measures proposed in the Budget 2017-18 to achieve the objective. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Budget in India is a socio-economic document that reflects the aims and aspirations of the government and people of India.\n\nThe initiatives in the Budget 2017-18 can be discussed under following heads –\n\n**1. Transforming India**\n\n* It concerns with those policies of the government that seek to transform the governance of the country and improve the quality of life of people.\n* The budget has focused on upgrading the infrastructure of railways, roads, rivers, airports, telecommunications and energy sector. But railways in India need comprehensive reforms as it is evident from recurrent accidents in different parts of the country.\n* Greater allocation for DeendayalAntyodaya Yojana is relevant in context of skilling India and reaping the benefits of demographic dividend in India.\n* Rationalisation of tribunals is a positive step towards securing rule of law and effective delivery of justice.\n* Tax administration is to be reformed through the strategy of RAPID (Revenue, Accountability, Probity, Information and Digitalisation). This strategy will help to plug tax avoidance at various levels and increase revenue of the government.\n\n**2. Energizing India**\n\n* There is focus on uplifting the conditions of various sections of society especially the youth and the vulnerable.\n* The conditions of farmers are to be improved through settling the arrears under the FasalBima Yojana, setting up Micro Irrigation Fund and widening the coverage of National Agricultural Market (e-NAM). However perishables are yet to be denotified from APMC acts by the states and model law to regulate contract farming has not come in public domain.\n* Mission Antyodaya will be strengthened to bring one crore households out of poverty by 2017. But there are no effective measures to better target the beneficiaries under this scheme.\n* Different initiatives for development of youth has been proposed such as SANKALP, next phase of STRIVE, extension of Pradhan Mantri Kaushal Kendras etc. But to energize youth of the country, robust IT infrastructure is a necessity which is hampering the learning outcomes in schools, colleges and skill development schemes.\n\n**3. Clean India**\n\n* It entails removing the evils of corruption, black-money and non-transparent political funding.\n* Digital economy is being strengthened through initiatives like JAM trinity, BHIM app, Financial Inclusion Fund, Amending Negotiable Instruments Act etc. But not much has been done to protect the digital payments and transactions from cyber frauds and thefts and accessibility to computers or mobiles is limited to few.\n* To bring transparency in the funding of political parties the limit of donation through cash has been fixed at Rs. 2000/- from one person and electoral bonds will also be issued in future.\n\nThe budget envisions to ‘transform, energize and clean India’ but it will not be materialized unless there is effective implementation of policies. Therefore the institutions to execute policies must be rejuvenated and a sound mechanism for the monitoring and evaluation of policies should also be established.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q4",
      "serial_no": "4",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**4. Why is Indian Regional Navigational Satellite System (IRNSS) needed? How does it help in navigation? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "**IRNSS:** NavIC (Navigation with Indian Constellation) is an independent and indigenous regional navigation satellite system developed by India. It is a set of 8 satellites which will be located in suitable orbital slots - geostationary or geosynchronous.\n\nIt makes India only the sixth country in the world to have its own navigation system.\n\nThis frees India from dependence on other countries for its navigation (GPS, GLONASS, Galileo etc.).\n\nGiven that it’s primary service area is India and the region extending up to 1500 km from its boundary, it’s expected to be more accurate (better than 20 m) and reliable. Also, this will help solidify India’s position as a regional power as NavIC will be open for use by India’s neighbours as well.\n\nFurther, it will help meet local user requirements of the positioning, navigation and timing services.\n\n**Navigation**\n\n* IRNSS will provide two types of navigation services:\n  + Standard Positioning Service – for all users.\n  + Restricted Service – an encrypted service only for authourised users.\n* The signals broadcast by IRNSS satellites will transmit navigation service signals (timing and position information) to the users.\n* This data will be used to give users visual and voice navigation assistance.\n* These will form the basis for variety of navigation applications:\n  + Land navigation – traffic management, tracking train’s movement, land survey, etc.\n  + Marine navigation – fishermen, merchant ships, port operations, disaster management, etc.\n  + Aerial navigation – civil aviation, military operations, etc.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**5. Why is India taking keen interest in resources of Arctic region? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "According to the Ministry of External Affairs, India’s interests in Arctic Ocean region are commercial, strategic, environmental and scientific. Pursuant to this, in 2013, India gained Observer status in the Arctic Council.\n\n* **Potential Natural Resources:** Arctic region holds oil and natural gas resources which can boost India’s energy security and diversify its energy imports especially when West Asia is under geopolitical turmoil. Arctic is also an abundant source for fishing.\n* **Potential for Newer Shipping Routes:** As global climate warms up and polar ice recedes, new paths between Asia, Europe and North America become open which can reduce cost of transportation for India’s exports and imports. For example, the Northern Sea Route, a mostly frozen seaway can become navigable throughout the year.\n* **Increased Vulnerability of Coastal Communities:** Melting of ice on large scale can make India’s coastal cities more vulnerable to sea level rise.\n* **Potential for Joint Research on Environmental Issues:** Joint research with countries like Norway can help India in better research on issues related to aerosol radiation, space weather, glacier cycles which are also mandate of Himadri Research Station.\n* **Geopolitical Importance:** While a treaty for Arctic, a global common, being negotiated, it is a strategic necessity to mould it in India’s favour. Also, India needs to make investments to match Chinese investments in Arctic.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**6. Define mantle plume and explain its role in plate tectonics. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Mantle plume is an upwelling of abnormally hot rock within the earth's mantle which carries heat upward in narrow, rising columns, driven by heat exchange across the core-mantle boundary. Eventually, the rising column of hot rock reaches the base of the lithosphere, where it spreads out, forming a mushroom-shaped cap to the plume. Heat transferred from the plume raises the temperature in the lower lithosphere to above melting point, and forms magma chambers that feed volcanoes at the surface. It is a secondary way through which earth loses heat. In 1971, geophysicist W. Jason Morgan developed the hypothesis of mantle plumes.\n\n**Role of Mantle Plumes in Plate Tectonics**\n\n* Mantle plumes transport primordial mantle material from below the zone of active convection; produce time-progressive volcanic chains; break up continents; and act as a driving force for plate tectonics.\n* The narrow conduits of deep-mantle material rise through the solid mantle before spreading out laterally in the upper asthenosphere. From there, they cause the lithosphere to swell and shear as the heat from the plume increases the temperature of lower lithosphere.\n* Mantle plumes are also thought to be the cause of volcanic centers known as hotspots and probably have also caused flood basalts.\n* As the plume remains anchored at the core-mantle boundary and it does not shift position over time, a string of volcanoes is created when the lithospheric plate moves above it. The formation of the Hawaiian Island and Emperor Seamount chain in the middle of the Pacific Plate are caused by mantle plume.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**7. What are the consequences of spreading of ‘Dead Zones’ on marine ecosystems? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "\"Dead Zone\" is a more common term for hypoxia, which refers to a reduced level of oxygen in the water in some parts of the world's oceans and large lakes. In March 2004, Global Environment Outlook Year Book, published by the UN Environment Programme, reported 146 dead zones in the world's oceans. One of the largest dead zones forms in the Gulf of Mexico every spring. Hypoxic zones can occur naturally but climate change, nutrients run-off from the land, and eutrophication are leading to algal bloom and causing further depletion of oxygen level in water. As a result dead zones are spreading at much faster pace.\n\n**Consequences of spreading dead zones on marine ecosystem:**\n\n* The reduced dissolved oxygen in ocean water results in loss of marine life thus the habitats which were teeming with life become biological desert.\n* Toxic algal blooms release toxins that can poison fish, molluscs and marine mammals like dolphins. Thus, affecting marine ecosystem by altering its food chain.\n* The reproductive problems emanate when the oxygen level depletes i.e. there is lower egg count and less spawning.\n* Slow moving bottom-dwelling creatures like clams, lobsters and oysters are unable to escape the dead zone and face extinction.\n* When fast moving marine species flee from the dead zones and occupy a new habitat, they cause overcrowding of their new habitats and affect the ecosystem services over there.\n\nIt is clear that the spread of dead zones can affect most marine ecosystems and have socio-economic ramifications due to human dependency on marine goods and services.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**5. Discuss the work of ‘Bose-Einstein Statistics’ done by Prof. Satyendra Nath Bose and show how it revolutionized the field of Physics. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Satyendra Nath Bose did path-breaking work on quantum mechanics in the early 1920s, using maths to describe the behavioural pattern of the bosons. Bose worked with Einstein providing the foundation for Bose-Einstein statistics and the Bose-Einstein condensate.\n\nBose figured out how a group of identical photons would behave. He sent his paper to Albert Einstein who recognized the value of his research work and extended it further under the name of Bose-Einstein Statistics. The particles such as photons that obey these statistics are called bosons.\n\nOne of the most dramatic effects of Bose-Einstein statistics is the prediction that bosons can overlap and coexist with other bosons. Fermions on the other hand cannot do this because they follow the Pauli Exclusion Principle (no two electrons in an atom can be at the same time in the same state or configuration). Because of this, it is possible for photons to become a laser and some matter is able to form the exotic state of a Bose-Einstein Condensate (BEC). A BEC is used to study quantum mechanics on a macroscopic level. Light appears to slow down as it passes through a BEC, allowing study of the particle/wave paradox. A BEC also has many of the properties of a superfluid (flowing without friction). BECs are also used to simulate conditions that might apply in black holes.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**16. With growing energy needs should India keep on expanding its nuclear energy programme? Discuss the facts and fears associated with nuclear energy? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Indian energy needs are growing rapidly in line with its ever increasing billion plus population and expanding economy. Indian energy demand grows at 4% annually, and is expected to increase from 700 million tonnes of oil equivalent (MTOE) in 2010 to 1,500 MTOE by 2030. In this, nuclear energy comes out as a clean source of energy for future.\n\nWith 6700 MW capacity under installation, nuclear energy currently provides 3% of India’s energy needs. It is projected by department of atomic energy that by 2050, 20-30 percent of Indian energy needs will be provided by nuclear energy.\n\n**Reasons why India needs to expand its nuclear energy programme:**\n\n* **Fossil Fuel Dependence:** With huge dependence on imported oil and associated foreign exchange payments, nuclear energy can reduce fossil fuel dependence.\n* **Environment Friendly:** Being low on CO2 emissions, nuclear technology helps in checking climate change thereby helping realizing India’s Nationally Determined Contributions to UNFCCC.\n* **Strategic Benefits:** With improved technological development and acceptance as responsible nuclear state, India will become part of global nuclear trade regime and also rightfully gain position in Nuclear Suppliers Group (NSG).\n* **Economic Dependence:** Reduced per unit cost with technological development and realization of thorium enabled production cycle.\n* **Agreements:** Strategic position as India partnered many countries in bilateral and multilateral agreements. (e.g. 123-USA, Reactor sully – France, Russia, Fuel Supply – Canada, Australia).\n\n**Fears associated with nuclear technology:**\n\n* **Safety Issues:** Historical accidents like Chernobyl and recent ones like Fukushima raise persistent doubt about human safety and its impact on environment. This has led nations like Germany and Japan to phase out use of Nuclear energy.\n* **Waste Management:** There is difficulty in the management of nuclear waste. It takes many years to eliminate its radioactivity and risks associated are high.\n* **Security:** Terrorist and other mischievous organizations can create global havoc by getting access to critical nuclear material or technology.\n\nWith Indian motto of ‘atoms for peace’, nuclear energy can act as a great catalyst for inclusive growth and development by providing much needed energy security, so that India should continue to expand nuclear energy programme.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_3_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**19. Data security has assumed significant importance in the digitized world due to rising cyber crimes. The Justice B.N. Srikrishna Committee Report addresses issues related to data security. What, in your view, are the strengths and weaknesses of the Report relating to protection of personal data in cyber space? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "The threat from cyber crime is multi-dimensional, targeting citizens, businesses, and governments at a rapidly growing rate. The Committee under the chairmanship of Justice B. N. Srikrishna was constituted to examine issues related to data protection, recommend methods to address them, and draft a data protection law. The objective was to ensure growth of the digital economy while keeping personal data of citizens secure and protected. The report inter alia presented a draft Personal Data Protection Act.\n\nSome of the Important Strengths and Weakness of the Report:\n\n* The Committee noted that consent is treated as one of the grounds for processing personal data.\n* One in three internet users across the world is children under the age of 18. A data protection law must sufficiently protect their interests, while considering their vulnerability, and exposure to risks online.\n* It discussed the principle where personal data must be collected for a specified purpose only.\n* One of the principles of data protection is that a person whose data is being processed should be able to influence the processing. This includes the right to confirm, access, and rectify the data.\n\n**Weakness**\n\n* Who owns the data of the individuals is a question not answered by the Committee as against the TRAI recommendation that ownership of data must rest with the individual.\n* Globally, the right to be forgotten refers to the right to erase data. Srikrishna panel, says “...data principal shall have the right to restrict or prevent continuing disclosure of personal data by a data fiduciary related to the data principal where such disclosure has served the purpose for which it was made or is no longer necessary; was made on the basis of consent... and such consent has since been withdrawn; was made contrary to the provisions of this Act or any other law made by Parliament or any State Legislature.”\n* On data breach, the Committee recommended that such a breach must first be reported to the Authority. This suggestion has been criticized and it is argued that it should be first reported to the subject of the breach instead.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_3_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**10. What is CyberDome Project? Explain how it can be useful in controlling internet crimes in India.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "CyberDome project is a technological research and development centre of Kerala Police Department, conceived as a cyber centre of excellence in cyber security, as well as technology augmentation for effective policing.\n\nIt envisages as a high tech public-private partnership centre of collaboration for different stakeholders in the domain of cyber security and handling of cyber crimes in a proactive manner.\n\nIndia has witnessed a 457% rise in cybercrime incidents under the Information Technology (IT) Act, 2000 from the year 2011 to 2016.\n\n### CyberDome project can be useful in controlling these internet crimes in India\n\n* The project can help in preventing cyber crimes through development of a cyber threat resilient ecosystem in the country to defend against the growing threat of cyber attacks. To effectively tackle cybercrime, the Government has collaborated with private sector and academia to conform rapidly changing technology world.\n* The Cyberdome will act as an online police patrol. Through its Anti-Cyber Terror Cell and a cybersecurity training unit, its officers will generate intelligence on various cyber threats in near real time and track fugitives online by monitoring their online activities, including social networking sites.\n* It will create a digital repository of stolen and lost vehicles and travel documents, track online payments to prevent money laundering and channelling of funds to dubious organisations and issue cyber security advisories.\n* Cyberdome would have centres for social media awareness, protection of children on the Internet, Internet monitoring and ICT (Information and Communication Technology) in service delivery.\n* Cyberdome in collaboration with the RBI, Banks, payment gateways and other wallet groups can tackle financial fraud.\n* Through its ransomware school, CyberDome can understand, analyse and mitigate ransomware infections, create standard operating procedures to deal with ransomware, creating awareness among the public as well as government departments about ransomware and its precautionary steps.\n* The Cyberdome is expected to enable sleuths to obtain vital leads in cases of cyber-related offences using advancements in the field of information technology.\n* Of late, Cyberdome has used social engineering as the lynchpin of its policing strategy to snoop on radical groups that use the net for extremist activities.\n* Cyberdome has made successful propaganda war against online games such as Blue Whale.\n* Of late, Cyberdome has launched a covert cyber-surveillance and infiltration programme to crack down on child pornography. Thus, Cyberdome project has great potential to control internet crimes and must be replicated at the national level.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_3_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**11. It is argued that the strategy of inclusive growth is intended to meet the objective of inclusiveness and sustainability together. Comment on this statement.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "**According to the World Bank, Inclusive Growth (IG)** refers to **'broad-based', 'shared'**, and **'pro-poor growth'**. It encompasses both the **pace** and **pattern of growth**, which is considered interlinked and therefore needs to be addressed together. **Inclusiveness, on the other hand,** is a concept that encompasses **equity, equality of opportunity, and protection in market and employment transitions** and is therefore an essential ingredient of any successful growth strategy.\n\n* **Rapid pace of growth** is unquestionably necessary for substantial poverty reduction, but for this growth to be **sustainable in the long run**, it should be **broad-based across sectors**, and **inclusive** of the large part of the country’s labour force.\n  + Thus, IG focuses on **productive employment** rather than **income redistribution** as a means of increasing incomes for excluded groups. Also, the focus is not only on **incremental productive employment growth** but also on **productivity growth**.\n* Growth can be **‘inclusive’ and “pro-poor”**, if and only if the incomes of poor people grow faster than those of the population as a whole, i.e., **inequality declines**. By focusing on inequality, the inclusive growth could lead to optimal outcomes for both poor and non-poor households.\n* Sustained, high growth rates and poverty reduction, however, can be realized only when the **sources of growth are expanding**, and an **increasing share of the labour force is included** in the growth process in an efficient way i.e. growth associated with **progressive distributional changes** will have a greater impact in reducing poverty than growth which leaves distribution unchanged.\n* The inclusive growth approach takes a longer-term perspective, where it is important to recognize the time lag between reforms and outcomes. Inclusive growth analytics is about policies that should be implemented in the short run, but for sustainable, inclusive growth in the future.\n  + **For Example:** The lag between the time when investments in education are made and the time when returns from improved labour skills are realised- this implies that the growth analysis must identify future constraints to growth that may not be binding today, but that may need to be addressed today in order to ensure sustainable and inclusive growth.\n* **Sustainable development** should be followed wherein we should not only be inclusive with respect to people but also bring the environment in its inclusion thus causing minimum depletion of resources and going for a circular economy.\n* In the past few years, the government is aggressively focusing on the strategy of inclusive growth in its various programs and policies.  \n  + **For Example,** Jan Dhan Yojana has focused on incorporating the unbanked masses into the financial sector and has increased financial inclusion statistics to more than 80%.\n\nIn the last few decades, India’s growth story has been phenomenal but the outcomes of this growth were not visible on the ground as India has performed badly in several social indicators as well as **Human Development Index**. Therefore inclusive growth is the idea to realize the dream of sustainable and qualitative development for present and future generations.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_3_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**9. Discuss different types of cyber crimes and measures required to be taken to fight the menace.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Cyber crime is a criminal activity thatinvolves computersor anynetworkdevicesthattargetindividuals, companies, and governments for direct financial gain or to sabotage or disrupt operations. Cyber crime is a major threat to sectors identified under Critical Information Infrastructure (CII) that include financial systems, air traffic control and telecommunications.\n\n**Different types of Cyber crimes**\n\n* **Malware,** short for malicious software, refers to any kind of software that is designed to cause damage to a single computer, server, or computer network. Ransomware, Spyware, Worms, viruses, and Trojans are all varieties of malware.\n* **Phishing:** It is the method of trying to gather personal information using deceptive e-mails and websites.\n* **Denial of Service attacks:** A Denial-of-Service (DoS) attack is an attack meant to shut down a machine or network, making it inaccessible to its intended users. DoS attacks accomplish this by flooding the target with traffic or sending it information that triggers a crash.\n* **Man-in-the-middle (MitM) attacks,** also known as eavesdropping attacks, occur when attackers insert themselves into a two-party transaction. Once the attackers interrupt the traffic, they can filter and steal data.\n* **Social engineering** is an attack that relies on human interaction to trick usersinto breaking security procedures to gain sensitive information that is typically protected.\n\n**Measures to be taken**\n\n* Real-time intelligence is required for preventing and containing cyber-attacks.\n* Periodical ‘Backup of Data’ is a solution to ransomware.\n* Using Artificial Intelligence (AI) for predicting and accurately identifying attacks.\n* Using the knowledge gained from actual attacks that have already taken place in building effective and pragmatic defense.\n* Increased awareness about cyber threats for which digital literacy is required first.\n* There is a need to secure the computing environment and IoT with current tools, patches, updates and bestknown methods in a timely manner.\n* The need of the hour isto develop core skillsin cybersecurity, data integrity and data security fields while also setting stringent cyber security standards to protect banks and financial institutions.\n\nOne of the highest numbers of cyber threats have been detected in India, and the country ranks second in terms of targeted attacks. Banking and Telecom are the most attacked sectors, but manufacturing, healthcare, and retail have also faced a significant number of cyber-attacks. Thus, there is an urgent need to take protective measures to tackle this menace.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_3_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**16. Describe the benefits of deriving electric energy from sunlight in contrast to the conventional energy generation. What are the initiatives offered by our government for this purpose?**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "India lying in the tropical belt has an advantage of receiving peak solar radiation for 300 days, amounting 2300-3,000 hours of sunshine equivalent to above 5,000 trillion kWh. India’s current installed solar power capacity, according to Central Electricity Authority, is 26025.97 MW which is 34% of total renewable energy sources i.e., 75055.92 MW till February 2019.\n\n**Benefits of deriving electrical energy from sunlight in contrast to the conventional energy generation**\n\n* **Energy Security**: India is dependent on imports to fulfill its energy demands, thereby incurring huge expenditure and uncertainty with regards to energy security. Thus, solar energy being cheap and easily available can fulfill the energy demands.\n* **Social Development**: The problem of power cuts and unavailability of electricity, especially in rural areas, leads to improper human development. Mostly energy demands are fulfilled by subsidized kerosene, leading to loss for exchequer.\n* **Environment Concern**: India’s large part of energy demand is fulfilled by thermal energy largely dependent on fossil fuels which causes environmental pollution. Solar energy is a clean form of energy resource, which can be a substitute.\n* In solar power energy overhead wires are not required, so no transmission loss. Solar energy conversion equipment has a longer life and needs lesser maintenance and hence provides higher energy infrastructure security.\n\n**Initiatives offered by the government**\n\n* National Solar Mission initiative of the Government of India and State Governments promotes ecologically sustainable growth while addressing India’s energy security challenge.\n* The Indian Renewable Energy Development Agency (IREDA) which provides term loans for renewable energy and energy efficiency projects.\n* National Institute of Solar Energy is created as an autonomous institution under MoNRE, which is an apex body for R&D in solar energy.\n* Establishment of solar parks and ultra-major solar power projects and enhancing grid connectivity infrastructure.\n* Promotion of canal bank and canal tank solar infrastructure.\n* Sustainable rooftop implementation of Solar transfiguration of India (SRISTI) scheme to promote rooftop solar power projects in India.\n* Suryamitra programme to prepare qualified workforce.\n* India also proposed the setting up of International Solar Alliance (ISA), a platform for the collaboration of sunshine countries in the domain of energy security.\n\nWith its pollution free nature, virtually inexhaustible supply and global distribution, solar energy is an extremely attractive energy resource. India, with its Intended Nationally Determined Contributions (INDCs) commitment of 100 GW of solar power out of 175 GW renewable energy by 2022, can surely benefit from this energy resource.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**18. Discuss the main objectives of Population Education and point out the measures to achieve them in India in detail.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "The total number of people living in a particular place, at a particular time, is known as a population. Population Education can be defined as a process of developing awareness and understanding of the population situation among people and making them more responsible towards managing the population.\n\n**Objectives of Population Education is to develop and understanding of:**\n\n* Demographic concepts and processes.\n* Influence of population trends on the various aspects of human life - social, cultural, political and economic.\n* Close interaction of population growth and the developmental process with particular reference to development programmes for raising the standard of living of people.\n* Evil effects of overpopulation on the environment and the concomitant dangers from pollution.\n* Scientific and medical advancement enabling to get an increasing control over famines, diseases and death and the imbalance thus created between death rate and birth rate.\n* Biological factors and phenomenon of reproduction which are responsible for continuance of the species.\n\n**Population Education in India:**\n\n* India became one of the first developing countries to come up with a state-sponsored family planning programme in the 1950s. A population policy committee was established in 1952. In 1956, a Central Family Planning Board was set up and its focus was on sterilisation. In 1976, GoI announced the first National Population Policy.\n* The National Population Policy, 2000 envisaged achieving a stable population for India. One of its immediate objectives is to address the unmet needs for contraception, health care infrastructure, and personnel and provide integrated service delivery for basic reproductive and child health care.\n* National Family Health Survey (NFHS) is a large-scale, multi-round survey conducted in a representative sample of households throughout India.\n* The beginning of population education in India can be traced to the third Five Year Plan (1961-66). Realising the potential of education in tackling the problems of growing rate of population, a Population Education Programme was launched in 1980 to introduce Population Education in the formal education system.\n\nThe family welfare program over the last five decades with holistic approach towards population control have made significant contributions, but the necessity for the intervention of educational efforts to bring appropriate social transformations so as to promote population stabilisation and ensure quality of life can never be denied. The universities and other educational institutions can play a vital role by providing adequate knowledge and necessary awareness in relevant areas.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_3_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**2. Distinguish between Capital Budget and Revenue Budget. Explain the components of both these Budgets.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "According to Article 112 of the Indian Constitution, the Union Budget of a year is referred to as the Annual Financial Statement (AFS). It is a statement of the estimated receipts and expenditure of the Government in a financial year (which begins on 01 April of the current year and ends on 31 March of the following year).\n\n**Objectives of Budget:**\n\n* Reallocation of resources\n* Reducing inequalities in income and wealth\n* Contributing to economic growth\n* Bringing economic stability\n* Managing public enterprises\n\n**Components of government budgets:**\n\n|  |  |\n| --- | --- |\n| **Capital Budget** | **Revenue Budget** |\n| * It includes the Capital Receipts and Capital Expenditure. | * It consists of the Revenue Expenditure and Revenue Receipts. |\n| * Capital Receipts indicate the receipts which lead to a decrease in assets or an increase in liabilities of the government. * It consists of:  * the money earned by selling assets (or disinvestment) such as shares of public enterprises, and * the money received in the form of borrowings or repayment of loans by states. | * Revenue Receipts are receipts which do not have a direct impact on the assets and liabilities of the government. * It consists of the money earned by the government through tax (such as excise duty, income tax) and non-tax sources (such as dividend income, profits, interest receipts). |\n| * Capital Expenditure is used to create assets or to reduce liabilities. * It consists of:  * the long-term investments by the government on creating assets such as roads and hospitals, and * the money given by the government in the form of loans to states or repayment of its borrowings. | * Revenue Expenditure is the expenditure by the government which does not impact its assets or liabilities. * For example, this includes salaries, interest payments, pension, and administrative expenses. |\n| * It is non-recurring in nature. It is usually a one-time expenditure for a long period of time. | * It is recurring in nature (on a yearly basis). |",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**8. Explore and evaluate the impact of ‘Work From Home’ on family relationships.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "The rising wave of the Covid-19 outbreak in India forced the corporate world in the country to opt for ‘work from home’ widely. Work from home was the only viable option to continue and sustain economic activities in the country to contain the spread of Covid-19.\n\n### Impact of Work from Home on Family Relationships\n\n* **Stronger Bonds:** While working from home a person spends more time with family, which helps in strengthening family bonds.\n* **Proper Attention to Children:** Work from home gives adequate time to parents to spend adequate time with their children, which is good for parent-children relationships.\n* **Better Take Care of Old People:** While working from home the young generation can better take care of their old parents and provide them with the requisite attention.\n* **Domestic Violence and Children Abuse:** According to an official data, National Commission for Women (NCW) registered an increase of at least 2.5 times in domestic violence complaints during the nationwide lockdown.\n* **Strained Marital Relations:** When a husband and wife spend extended periods of time together without leaving the house, the likelihood of disputes between them increases and already tense marital relations worsen.\n* **Disputes in family:** While working from home one shares the same workplace with other family members (wife, son, sister, brother) who may also be working from home. One may be sharing the same resources as internet, computer, Fan etc .If work timing or meeting time clash then it leads to arguments.\n* **Leads to Frustration**: Working from home makes some people frustrated due to lack of required infrastructure.\n* **Disturbed Domestic Chores:** Due to the same timing of work of both husband and wife it causes the negligence of routine domestic works which creates a situation of stress and tension between two.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**8. Explain the mechanism and occurrence of cloudburst in the context of the Indian subcontinent. Discuss two recent examples.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Cloudbursts are short-duration, intense rainfall events over a small area. According to India Meteorological Department (IMD), it is a weather phenomenon with unexpected precipitation exceeding 100mm/h over a geographical region of approximately 20-30 square km. In the Indian Subcontinent, it is generally observed in the Himalayan region.\n\nMechanism of cloudburst\n\nWhen moisture laden air moves the hilly terrain, it forms vertical column of cloud also known as cumulonimbus cloud. These clouds are generally associated with rain, thunder and lightning. These unstable clouds cause an intense rainstorm over a small area and locked in the ridges and valleys between the hills.\n\nOccurrence of cloudburst\n\nThe relative humidity and cloud cover is at the maximum level with low temperature and slow winds because of which clouds may get condensed at a very rapid rate and result in a cloudburst.\n\n**Recent incidents**\n\n* Amarnath Cloudburst in July 2022, which caused heavy casualties of pilgrims on yatra.\n* In August 2022, several people have been killed in destruction caused by cloudbursts and flash floods in different parts of Himachal Pradesh and Uttarakhand.\n\nWith rising occurrences of cloudburst every year, it has become necessary to install dense network of weather instruments, and computing capabilities especially for hilly regions.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**9. Discuss the types of organised crimes. Describe the linkages between terrorists and organised crime that exist at the national and transnational levels.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Illegal activities carried out at a large scale for profit through organisation and planning by powerful criminal groups are known as organised crime.\n\nSome major types of organised crime are smuggling, racketeering, drug and human trafficking, etc.\n\nOrganised crime can be broadly categorised as ‘traditional’ and ‘non-traditional’. The former includes activities such as extortion, contract killings, smuggling, etc., while the latter includes cybercrime, enterprise and political corruption, white collar crimes, etc.\n\nTerrorism is not classified as an organised crime since it is driven by a political and ideological agenda and not profit-making. Nevertheless, both organised crime and terrorism often complement each other.\n\nTerrorists primarily require two things for carrying out their activities — financing and logistical support, often provided by entities engaged in organised crime. Sometimes, even terrorists carry out activities that fall under the purview of organised crime. For example, extortion by Left Wing Extremists for financing their activities against the state.\n\nFurther, as showcased by the 1993 bombings in Mumbai, entities and individuals in organised crime also provide logistical support to terrorists such as smuggling of dangerous material(s), providing human resources, communication network(s) and information, arranging financial help etc.\n\nThus, organised crime and terrorism share close linkages at both national and transnational levels and pose a significant threat to the security of the country.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**10. What are the maritime security challenges in India? Discuss the organisational, technical and procedural initiatives taken to improve the maritime security.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "India has more than 7000 km long maritime border shared with seven nations. Instruments of maritime security protects the territorial sovereignty of nation from possible marine threats.\n\n**Challenges-**\n\n* Issues of smuggling and human trafficking across the marine border.\n* Issues of cross border terrorism.\n* Infiltration of illegal migration.\n* Issues of piracy in maritime trade.\n* Maritime environmental hazards.\n* Some Initiatives taken by India-\n\n**Organisational-**\n\n* India launched security and growth for all **(SAGAR) policy** to integrated collaboration with Indian ocean region nations.\n* India introduced the establishment of **integrated theatre command.**\n* India set up an **International fusion centre (IFC)** for Indian ocean region in Gurugram.\n* Recently quad launched Indo-pacific partnership for maritime domain awareness **(IPMDA)** for better coordination and awareness.\n* India is part of various organisations and dialogue like **IONS, IORA and India- EU maritime** dialogue.\n\n**Technical-**\n\n* Mission based deployment of naval ships and aircrafts. Like, INS Vikrant, Nuclear Submarines and project 75I etc.\n* India is working on **digital cargo and bay arrangement optimization** to enhance efficiency of maritime security.\n* India introduced advanced Electronic Warfare System **‘Shakti’** in Indian Navy.\n* India used advance electronic and digital surveillance over the marine border.\n\n**Procedural-**\n\n* Being signatory of United Nations Convention on the Law of the Sea **(UNCLOS)**, India adheres all its rules and regulations.\n* India follows the procedure of operational interactions with friendly nations via joint exclusive economic zones **(EEZ)** surveillance.\n\n### Way forward\n\n* Swift coordination and collaboration of various security institution is much needed. It can enhance the efficiency in maritime security services.\n* Multilateral information sharing is key to prevent marine threats. So, there should be an **integrated multilateral data sharing platform.**\n* Best practices of other marine nations should be shared among all friendly nations holistically.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**12. Do you think India will meet 50 percent of its energy needs from renewable energy by 2030? Justify your answer. How will the shift of subsidies from fossil fuels to renewables help achieve the above bjective? Explain.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "India at the COP 26th meeting of the United Nations Convention on Climate Change (UNFCCC) committed to the 5-point agenda programme. One of them is to meet 50% of its energy requirements from renewable energy by 2030.\n\nTo reach the above commitments India has already achieved few targets:\n\n* India has overachieved its commitment made at COP 21- Paris Summit by already meeting 40% of its power capacity from non-fossil fuels.\n* India is also one of the world’s largest producers of modern bioenergy.\n* Today, India is the world's third largest producer of renewable energy, with 40% of its installed electricity capacity coming from non-fossil fuel sources.\n* India's massive UJALA LED bulb campaign is reducing emissions by 40 million tonnes annually.\n\nHowever, there are a few challenges in achieving the target:\n\n* To meet the above target India will need massive funding. BlombergNEF (BNEF) report says that only to meet wind and solar energy targets India will need $223 Billion.\n* In the short-term rising interest rates, a depreciating rupee and high-inflation create challenges for the financing of renewables.\n* Even, to complete the targets Indian government needs to cut down its taxes for almost 2 lakh crores by 2030 which will effect the other sectors like education, health and infrastructure.\n\nFossil fuel subsidies by the Union government have fallen 742% since 2014 but the subsidies on coal, oil and gas increased by nine times in 2021-22. Still, the Fossil fuel subsidies in India nine times higher than renewable energy. So, there is no complete shift to subsidies on renewable energy sources.\n\nAlthough, the shift of subsidies from fossil fuels to renewables will help in subsidies for E- vehicles and raising taxes on fossil fuels will help in achieving the above objective because giving subsidies to renewable sources will make it look cheaper and this will also work against the fossil-fueled incumbents that are preventing new renewable energy entrants access to the market. For example, giving subsidies for E- vehicles and raising taxes on fossil fuels will help in achieving levels needed by 2030 as it will contain global warming to the Paris goal of 1.5-2C.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**15. Launched on 25th December, 2021, James Webb Space Telescope has been much in the news since then. What are its unique features which make it superior to its predecessor Space Telescopes? What are the key goals of this mission? What potential benefits does it hold for the human race?**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "The James Webb Space Telescope (sometimes called JWST or Webb) is a large infrared telescope with a 6.5-meter primary mirror. It was successfully launched from French Guiana on 25th December 2021. The telescope is the result of an international collaboration between NASA, the European Space Agency (ESA) and the Canadian Space Agency.\n\n**Features of James Webb Telescope over other Telescopes**\n\n|  |  |  |  |\n| --- | --- | --- | --- |\n| **Features** | **James Webb Telescope** | **Hubble Telescope** | **Herschel Space Observatory Telescope** |\n| Wavelength | Observes in Infrared range | Observes in Ultra-violet and visible part of spectrum. | Observes in Infrared range |\n| Coverage | 0.6 to 28 microns | 0.8 to 2.5 microns | 60 to 500 microns. |\n| Mirror Size | Diameter: 6.5 meter | Diameter: 2.4 meter | Diameter: 3.5 meter |\n\n* The James Webb Telescope and the Herschel Telescope is orbiting L2 region while other previous telescopes were launched into low earth orbit. It will help in better image capturing because of different wavelengths.\n* The size of mirror of James Webb telescope is much larger than other telescopes which will help in collecting larger area as compared to other.\n* James Webb Telescope is expected to go beyond the range of Hubble Telescope which will help in revealing stars and galaxies 13.7 billion years ago.\n\n**Key Goals**\n\n* Search for the first galaxies that formed after the Big Bang.\n* Determine how galaxies evolved from their earlier formation until now.\n* Observe the formation of stars from the first stages to the formation of planetary systems.\n* Measure the physical and chemical properties of planetary systems and investigate the potential for life in such systems.\n\n**Potential benefits of James Webb for Human Race**\n\n* The Webb telescope offers opportunity to understand the formation and growth of earlier galaxies.\n* It will help to detect possibilities of life on other planets. The detection of water and methane present in atmosphere of exoplanets can be done by infrared wavelengths.\n* It will be helpful in watching the birth of stars as the infrared light from the stars can penetrate through the dust.\n* It will help in studying black holes form different angle. It will provide valuable data related to temperatures, speed, chemical composition of the black hole.\n* It will also help to observe the atmospheres of extrasolar planets which are present beyond our solar system.\n\nJames Webb telescope is the successor of the Hubble Telescope. The characteristics of the telescope will aid in learning about the mass, age, history and composition of ancient galaxies. It is expected that it will provide broad range of investigation in fields of astronomy ad cosmology.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**16. What is the basic principle behind vaccine development? How do vaccines work? What approaches were adopted by the Indian vaccine manufacturers to produce COVID-19 vaccines?**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "A vaccine is a biological product that can be used to safely induce an immune response that confers protection against infection and disease on subsequent exposure to a pathogen. The essential component of most vaccines is one or more protein antigens that induce immune responses that provide protection.\n\n**Basic Principle Behind Vaccine Development**\n\n* To **induce protection against a pathogen by mimicking** its natural interaction with the human immune system.\n* Vaccines **induce the immune system** to produce an **immunological memory** based on **T and B lymphocytes.**\n* This memory helps to **produce a rapid and effective response** to exposure to the targeted pathogen.\n\n**Working of Immune System**\n\n* When a pathogen does infect the body, our **immune system gets triggered** and the pathogen is attacked and destroyed.\n* The subpart of a pathogen that causes the formation of antibodies is called an **antigen.**\n\n**Working of Vaccines**\n\n* Vaccines contain **weakened or inactive parts** of an antigen that triggers an immune response within the body.\n* This weakened version of antigen will **prompt the immune system to respond** much as it would have on its first reaction to the actual pathogen.\n\n**Approach Adopted to Develop India’s First Indigenous COVID-19 Vaccine**\n\n* **COVAXIN**  \n  + Developed by the **Bharat-Biotech.**\n  + It is an **inactivated vaccine** which is developed by inactivating the live microorganisms that cause the disease.\n  + It is developed using **Whole-Virion Inactivated Vero Cell** derived platform technology.\n* **COVISHIELD**  \n  + Developed by the **University of Oxford** in collaboration with **Swedish-British drugmaker AstraZeneca.**\n  + **Serum Institute of India (SII)** is the manufacturing partner in India.\n  + It is based on a weakened version of a **common cold virus or the adenovirus** that is found in **chimpanzees.**\n  + This **viral vector** contains the genetic material of the **SARS-CoV-2 spike protein** (protrusions) present on the outer surface of the virus that help it bind with the human cell.\n\nIn a historic achievement, India’s vaccination drive has surpassed the **200-Crore milestone in July 2022.** India has always supported the research, development and manufacturing of COVID-19 vaccines under the **“Make-in-India”** and **“Make-for-World” Strategy,** embarked on the use of cutting-edge technologies like CoWIN.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**19. What are the different elements of cyber security? Keeping in view the challenges in cyber security, examine the extent to which India has successfully developed a comprehensive National Cyber Security Strategy.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Cyber security means the protection of cyberspace including critical information infrastructure from attacks, damage, misuse and economic espionage. It also includes the set of technologies and practices designed to prevent various types of cybercrimes.\n\nThere are certain key elements of cyber security such as:\n\n* **Application Security:** It includes measures that are taken during an application’s development process to protect it from threats emerging from flaws in the app design, development, deployment, etc.\n* **Information security:** It is related to protecting information from unauthorized access to avoid identity theft and protect privacy.\n* **Network Security:** It includes activities to protect the network's usability, reliability, integrity and safety.\n* **Disaster Recovery Planning:** It is a process that includes performing risk assessment, establishing priorities and developing recovery strategies in case of a cyber-attack.\n* **End-user awareness:** This includes the dissemination of information and raising awareness about the various facets of cybersecurity among the larger public\n\nChallenges related to cyber security are centred around certain key issues such as:\n\n* An increase in cyber-attacks on critical infrastructure has been witnessed in recent times.\n* The lack of adequate necessary infrastructure and human resources trained in dealing with cybersecurity-related issues.\n* Inadequate focus on cyber security by the private sector on developing preparedness for dealing with cyber-attacks.\n* The country's expanding digital ecosystem and inadequate infrastructure and procedures render large amounts of data vulnerable to cyber-attacks.\n* Further, India is not a signatory to the Budapest Convention which seeks to address cybercrimes by improving investigative techniques and increasing cooperation among nations.\n\nIndia has adopted a multi-faceted National Cyber Security Strategy to deal with cybercrime.\n\n* The Information Technology Act, passed in 2000 and amended in 2008, deals with the mitigation of cybercrime and related issues.\n* The constitution of specialised agencies dealing with cybercrime such as the Indian Computer Emergency Response Team (CERT-In), National Critical Information Infrastructure Protection Centre (NCIIPC) and Indian Cyber Crime Coordination Centre (I4C).\n* Other government initiatives related to spreading awareness about and mitigating cybercrime-related threats are the Cyber Surakshit Bharat Initiative, National Cyber Security Coordination Centre (NCCC), Cyber Swachhta Kendra and Information Security Education and Awareness Project (ISEA).\n* A National Cyber Security Policy was implemented by the government in 2013 for dealing with cybercrimes.\n* Further, in 2020, the National Cyber Security Strategy was conceptualised by the Data Security Council of India (DSCI) headed by Lt General Rajesh Pant. This is yet to be implemented by the Centre.\n\nThus, with the changing nature of cybercrimes, India has also made efforts at meeting the challenges emanating from them. However, more needs to be done to effectively address the threats posed by cybercrimes.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q3",
      "serial_no": "3",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**3. Bring out the socio-economic effects of the introduction of railways in different countries of the world.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Railways are one of the most significant inventions in human history, as they transformed transportation, communication, and trade across the world.\n\nKey socio-economic effects of the railways:\n\n* **Economic Growth**: Railways **drove industrialization through efficient transportation,** fueling manufacturing and economic growth.\n  + In the 19th century UK, railways drove industry growth, boosting textiles and coal mining, resulting in increased economic prosperity.\n* **Urbanization:** The railways often **led to the growth of urban centers and the emergence of new towns** and cities along railway lines.\n  + The late 19th-century Transcontinental Railroad in the US boosted cities like Chicago and Denver, attracting people with improved economic opportunities.\n* **Agricultural Transformation:** Railways boosted rural-to-urban agricultural transport, cutting spoilage, costs, and expanding farmers' market reach.\n  + In late 19th century Argentina, railways enhanced beef and wheat transport, fueling agricultural growth and exports.\n* **Trade and Market Access:** Railways **expanded access to distant markets,** both domestically and internationally.\n  + Railways in early 20th century China facilitated trade with Europe, America, and Japan, expanding market access.\n* **Technological Advancements:** The railways spurred advancements in engineering, materials, and logistics, benefiting multiple industries.\n  + Germany's InterCityExpress trains have spurred railway innovation and shaped transportation tech.\n\nRailways have significantly shaped nations' socio-economic landscapes, fostering growth, connectivity, and industrialization.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**7. Why is the South-West Monsoon called ‘Purvaiya’ (easterly) in Bhojpur Region? How has this directional seasonal wind system influenced the cultured ethos of the region?**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "The **South-West Monsoon, active from June to September**, delivers substantial rainfall to India. When these monsoon winds encounter various mountain ranges, they alter course, creating **easterly 'Purvaiya' winds in the Bhojpur region.** This distinct wind pattern significantly shapes **Bhojpur's cultural identity, spanning parts of India and Nepal.**\n\n**Influence of Purvaiya on Cultural Ethos of Bhojpur:**\n\n* **Agriculture and Festivals:** Purvaiya starts the planting season and is celebrated with festivals like Teej.\n* **Rituals and Beliefs:** People worship rain gods like **Indra and Parjanya** for good harvests. Madhushravani involves worshiping Vishahara and Gosaun.\n* **Traditional Cuisine:** Purvaiya enables the **growth of rice, vegetables, and fruits**, influencing the region’s cuisine. Also, special dishes like **Pua are made during this season.**\n* **Folklore:** ‘Purvaiya’ appears in proverbs, songs, and poems that express the winds’ importance and emotions. Proverbs like “**Purvaiya chale to khet khile”** and folk songs like ‘Birha’ are examples.\n\nTherefore, **Purvaiya** winds are essential to Bhojpur’s culture, shaping its **traditions, rituals, and daily life.**",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_2_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**20. ‘Sea is an important Component of the Cosmos.’ Discuss in the light of the above statement, the role of the IMO (International Maritime Organisation) in protecting environment and enhancing maritime safety and security.**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Seas are incredibly important for the earth considering their rich biodiversity and for humas considering the rich resource pool and providing ways for transport. A specialised agency of the United Nations, the International Maritime Organisation (IMO) works to improve the safety and security of international shipping and prevent pollution from ships.\n\n**Environment protection**\n\n* **Ballast Water Management Convention:** Guidelines for management, treatment, and discharge of ballast water that is held in the tanks of ships to stabilise them, were decided and standardised by IMO.\n* **MARPOL Convention:** It is an international convention that prevents pollution caused by ships such as oil spillage, chemical pollution, etc.\n* **Greenhouse Gas Emissions:** Stringent emission limits of sulphur and nitrogen oxide are fixed for ships. These help in reducing pollution especially in coastal areas.\n* **EEXI and CII:** The Energy Efficiency Existing Ship Index (EEXI) and the Carbon Intensity Indicator (CII) have been adopted by IMO to look into decreasing the environmental cost of shipping industry.\n\n**Maritime safety and security**\n\n* **ISPS Code:** The International Ship and Port Facility Security (ISPS) Code lists measures to enhance security of ships and port facilities.\n* **SOLAS Convention:** The International Convention for the Safety of Life at Sea (SOLAS) ensures that ship’s construction, equipment and operation are compatible with their guidelines.\n* **STCW Convention:** The International Convention on Standards of Training, Certification, and Watchkeeping for Seafarers (STCW) ensures a standard training and certification for seafarers to achieve a basic level of competency.\n* **Search and Rescue (SAR):** The SAR Plan by IMO ensures global availability of search and rescue services saving lives and improving the overall safety of maritime navigation.\n\nThe International Maritime Organisation (IMO) plays a major role in protecting environment and enhancing maritime safety and security, functioning under the ambit of various conventions and exercising various codes.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**5. Introduce the concept of Artificial Intelligence (Al). How does Al help clinical diagnosis? Do you perceive any threat to privacy of the individual in the use of Al in healthcare?**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "Artificial intelligence (AI) is the epitome of information technology excellence in the world right now. It is the closest that we have come to developing a human-like intelligence in a computer and it is based on processing a plethora of data.\n\n**AI in clinical diagnosis**\n\n* **Comprehensive Analysis:** AI can help process a large amount of data and based on previous medical history it can provide a comprehensive analysis of the patient’s health.\n* **Early Detection**: Patterns in data are easily detectable by AI. Through data sets of thousands of people, AI can predict a disease that is possible for a particular individual with particular symptoms.\n  + For example, AI has been reported to recognize patterns in people with family history of heart disease and suggest which ones of them were at risk.\n* **Helping Hand:** Rather than replacing doctors, AI can help by supplementing their efforts and making the decision easier to take.\n* **Monitoring:** AI based wearable devices can help monitor the levels of various parameters of health of an individual.\n  + For example, monitoring of blood pressure by smart watches.\n\n**Threats of privacy**\n\n* **Big Data:** AI becomes ‘intelligent’ by processing huge amounts of data. People's consent becomes necessary, but it is generally not adhered to.\n* **Data Breach:** With big databases comprising individual’s medical records, the value of security goes up significantly as the data breach can lead to serious repercussions.\n\nThe advent of Artificial Intelligence continues to cause massive changes throughout the world in all sectors. Healthcare has already been revolutionised by technology but its better utility depends on proper redressal of concerns.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q17",
      "serial_no": "17",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q.17 What is regional disparity? How does it differ from diversity? How serious is the issue of regional disparity in India? (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "### Approach\n\n* Define regional disparity and diversity.\n* Highlight the differences between regional disparity and diversity.\n* Discuss the issue of regional disparity in India.\n* To conclude,suggest measures to address the issues of regional disparity.\n\n### Introduction\n\n**Regional disparity** refers to the uneven distribution of economic resources, development, infrastructure, and opportunities across different regions within a country. **Diversity** refers to the variety of cultural, linguistic, geographical, and social attributes that exist within a population or region.\n\n### Body\n\n**Key differences between Regional Disparity and Diversity:**\n\n|  |  |  |\n| --- | --- | --- |\n| **Aspect** | **Regional Disparity** | **Regional Diversity** |\n| **Focus** | Economic and developmental inequalities (income, education, infrastructure) | Cultural, ethnic, and social variations |\n| **Causes** | Colonial legacy, Resource distribution, Policy biases. | Natural evolution of communities, migration, trade |\n| **Impact** | Leads to socio-economic challenges (poverty, unemployment, lack of services). | Enhances creativity, social cohesion, and innovation. |\n\n**Seriousness of Regional Disparity in India :**\n\n* **Economic Imbalances:** The per capita income of India's five richest states is nearly 338% higher than that of the poorest states\n* **Educational Disparity:** According to the 2011 Census, Kerala has a literacy rate of 96.2%, while Bihar's literacy rate is only 61.8%.\n* **Healthcare Access:** There are only 0.36 hospitals for one lakh people in rural areas whereas it is 3.6 hospitals per one lakh population in urban areas\n* **Transportation and Connectivity:** Developed regions have better transportation networks and connectivity, facilitating trade and mobility.\n* **Digital Divide:** According to the NSSO data, only 24% of rural Indian households have access to the Internet, compared to a 66% penetration in cities.\n* **Skewed Impact on Migration:** As of 2011 census, Uttar Pradesh and Bihar were the largest source of inter-state migrants while Maharashtra and Delhi were the largest receiver states.\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_1_Q17_IMG_1.png)\n\n### Conclusion:\n\nThe government has introduced several initiatives to address regional disparity in India, including the **Backward Regions Grant Fund, Pradhan Mantri Gram Sadak Yojana, and the National Rural Livelihoods Mission**. Addressing these disparities is vital for promoting balanced development and ensuring that all regions can share in the benefits of economic progress and opportunities.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_3_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**Q6. What is the technology being employed for electronic toll collection on highways? What are its advantages and limitations? What are the proposed changes that will make this process seamless? Would this transition carry any potential hazards? (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "ScienceAndTechnology"
    },
    "solution": {
      "explanation": "### Approach\n\n* Introduce the answer with a brief description of electronic toll collection on highways.\n* Briefly describe key technologies like FASTag, GNSS, RFID, and ANPR.\n* Highlight benefits such as reduced congestion, faster transactions etc.\n* Mention challenges like infrastructure issues and digital divide.\n* Mention proposed changes like GNSS lanes.\n* Discuss risks such as cybersecurity threats and technical failures.\n* Conclude suitably.\n\n### Introduction\n\n**Electronic toll collection** on highways employs technologies like **FASTag and Global Navigation Satellite System (GNSS).** It is estimated that India could save Rs 12,000 crore annually in fuel and man-hours by switching to **100% FASTag-based toll collection.**\n\n**Technology Employed**\n\n**RFID (Radio Frequency Identification):** Tags (eg. **FASTag**) attached to vehicles enable automatic toll deductions as they pass through toll plazas.\n\n* **GPS (Global Positioning System):** Tracks vehicle locations in real-time to calculate tolls based on distance travelled.\n* **ANPR (Automatic Number Plate Recognition):** Captures vehicle registration plates for seamless toll payments without stopping.\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_3_Q6_IMG_1.png)\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_3_Q6_IMG_2.png)\n\n**Proposed Changes for a Seamless Process:**\n\n* **Satellite-Based Toll Collection System:** GNSS Tolling collects fees without stopping vehicles at toll booths.\n* **On-Board Units (OBUs):** Owners will install non-transferable OBUs in their vehicles, potentially factory-fitted in new cars, similar to FASTag stickers.\n* **Multi-Lane Free Flow (MLFF) Technology:** Combines **RFID, ANPR, and GNSS** for toll charging while vehicles are in motion.\n* **Toll Aggregation System:** A unified national platform to streamline toll payments across states and highways.\n\n**Potential hazards** include cybersecurity risks from hacking and data breaches, as well as inequities for low-income individuals lacking access to electronic payment methods.\n\n### Conclusion\n\nWhile electronic toll collection technology offers numerous benefits, **careful implementation and addressing potential hazards** are essential for a seamless transition, ensuring fairness and security for all users.",
      "explanation_format": "markdown"
    }
  }
]