[
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_1_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**8. To what extent globalisation has influenced the core of cultural diversity in India? Explain. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Globalisation refers to the increased interconnectedness across the countries of the world whether economically, culturally or technologically. It has a particularly profound effect on the cultural diversity of a country. For India, its influence can be explained as following:\n\n* **Family structure —**Increasing urbanization as a consequence of globalization has resulted in migration of people from rural areas, resulting in the disintegration of the joint family system. A new trend of nuclear families with one or maximum two children has emerged in India.\n* **Role of Women —**As a result of globalization, women in India have become more aware of their rights and are now stepping out of homes to pursue not only schooling but higher education and jobs. With patriarchy’s influence decreasing, women are taking leading roles in various walks of life.\n* **Role of caste is decreasing —** with increasing urbanization as a result of globalisation, not only are caste barriers breaking at workplace but also at areas of living-people belonging to all caste work and live together. On the other hand, class discrimination is increasing.\n* **Lifestyle —**Whether it be in attire, food habits or taste in music, there has been an attempt to imitate the West. Sarees, Salwar-Kameez for women has given way to skirts and pant, jeans and shirts. Similarly for men, traditional dhoti-kurta has been replaced by shirts and trousers. Even in food habits, junk food like pizzas, burgers, pasta are the preferred choices of the youth today in India.\n* **Language —**English today is becoming the favoured mode of communication among the people of India over their mother tongues.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**2. Women empowerment in India needs gender budgeting. What are the requirements and status of gender budgeting in the Indian context? (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Gender budget is concerned with gender sensitive formulation of legislation, programmes and schemes to address gender disparities.\n\nThe rationale for gender budgeting arises from recognition of the fact that national budgets impact men and women differently through the pattern of resource allocation. Women, constitute 48% of India’s population, but they lag behind men on many social indicators like health, education, economic opportunities, etc. Hence, they warrant special attention due to their vulnerability and lack of access to resources. The way Government budgets allocate resources, has the potential to transform these gender inequalities. In view of this, Gender Budgeting, as a tool for achieving gender mainstreaming, has been propagated.\n\nTherefore number of schemes, programmes specific to women education, women health and skill training should have more weightage then partial allocation of funds for gender specific issues.\n\n**Status of Gender Budget in India**\n\nGender Budget Statement (GBS) was first introduced in India Budget in 2005-2006. It comprises of two parts.\n\n* Part A reflects women specific schemes i.e., those which have 100% allocation for women.\n* Part B reflects Pro-women schemes i.e., those where at least 30% of allocation is for women.\n* India’s Gender Budgeting efforts stand out globally because they have not only influenced expenditure but also revenue policies (like differential rates in property tax rates).\n* Gender Budgeting efforts in India have encompassed knowledge building and network; institutionalize the process, capacity building and chance capability.\n* Gender Budgeting Cells (GBC) as an institutional mechanism has been mandated to be set up in all Ministries/Departments. But there are only a few **‘big budget’** women exclusives schemes of Ministry of Women and child Development like the **Nirbhaya Fund** and **Beti Bachao, Beti Padhao** campaign.\n\nEven though India has made significant strides in gender budgeting, it still leaves a lot to be achieved for real empowerment of women, towards which government should work earnestly.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_3_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**18. ‘Terrorism is emerging as a competitive industry over the last few decades.” Analyse the above statement. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "In recent years, with the emergence of new terrorist organizations like ISIS, Boko Haram etc. terrorism has become a competitive industry. Like mafia organizations, where one-upmanship is often based on who has the most guns, money or local power, terrorist groups too have a pecking order.\n\nThe current competitive market in terrorism means that groups are trying to distinguish each other through the practice of more memorable violence (like the Charlie Hebdo attacks or the Peshawar attacks in December 2014). They need to do so because this is the only way in which they can be heard, become popular enough to attract recruits and distinguish themselves from other similar groups. In order to do so the terrorist groups are trying to out-do each other in the intensity and scope of violence and bloodshed they can cause so that more people can identify with them and join them. For example- while some years back, Al-Qaeda was the most dreaded terrorist group of the world, this position has now been overtaken by ISIS. One of the reasons for this can be because ISIS encourages lone-wolf attacks which are easier for its followers to carry out without actually travelling to join the group to fight in combat.\n\nVarious terrorist organizations are also in competition with each other to get control of various natural resources such as oil reserves in Middle East countries, cultivation of Opium, arms dealing etc.\n\nCompetition over establishing their ideologies all around the world has also instigated terrorist organization for example multiple groups are fighting with each other in Syria. So in recent time terrorism has become a competitive industry that has spread its influence all over the world.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_1_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**18. The women’s questions arose in modern India as a part of the 19thcentury social reform movement. What were the major issues and debates concerning women in that period?  (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "In the 19th century, the problems of women in India invited the attention of Western humanitarian thinkers, Christian missionaries and Indian socio-religious philosophers. Many issues related to women prevalent during 19th century were discussed thoroughly.\n\n* The socio-religious philosophers protested evil practices such as Sati, child marriage, prohibition of widow remarriage, polygamy, dowry and the Devadasi system.\n* Their views were strengthened when Christian missionaries exposed the evils of such social customs.\n* Further, some of the enlightened British officials in India and England also initiated measures to remove these social evils.\n* Pandita Rama Bai, Savitribai Phule, Tarabai Shinde, Anandibai Joshi and Sarojini Naidu and many other enlightened women came forward to liberate the rest of women.\n* The practice of Sati was prohibited officially in 1829 in Bengal with the active participation of Raja Ram Mohan Roy and then in Madras in 1830.\n* Reformers reinterpreted the Sashtras in favor of widow remarriage. In 1855 Ishwar Chandra Vidhyasagar started a vigorous campaign in favor of widow remarriage.\n\nTo summarize, the issues of women in the 19th century are mainly related to the social upliftment of women in Indian society. Efforts were on to empower women that included social reforms and economic self-reliance.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_3_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**19. Mob violence is emerging as a serious law and order problem in India. By giving suitable examples, analyze the causes and consequences of such violence. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Over the past few years, there have been increasing incidents of loss of life and property due to mob violence – whether it be in Jharkhand over rumours of child kidnapping, in UP and Rajasthan by cow vigilantes, in Kashmir by violent crowds or over reservation by Jats in Haryana. Mob violence can be seen as a reflection of the displacement of responsibility by the state, which blames people for taking law into their own hands, and by citizens, who justify their actions on state inaction.\n\n**Causes for Increasing Mob Violence**\n\n* Motivated rumours spread through social media which acts as an anonymous force multiplier.\n* Climate of impunity - Mob violence and vigilantism happens because criminals expect to get away with it. State deterrence is not perceived to be credible, especially when policemen are rendered as mere by-standers at the scene of violence.\n* General erosion of law and order situation - inadequate response to societal disorder, and its inability to aggressively prosecute those involved in vigilante killings further encourages mob violence.\n* Silence by society – People who are mute witnesses to such incidents, are just as responsible when they stay away from expressing their disapproval to such incidents for the fear of being caught in the cross-fire.\n\n**Consequences of increasing Mob Violence**\n\n* There is deficit of justice when incidents of lynching across states happen, without those responsible being held accountable.\n* There is perversion of democracy, which confers upon the people an absolute monopoly on violence.\n* Mob Violence threatens the very existence of dignified and meaningful existence in India enshrined in one of the Fundamental rights i.e. **“Right to Life”** (Art 21).\n\nTherefore, there is need for comprehensive police reforms and efficient criminal justice delivery system which acts as a deterrence to people from resorting to mob violence in the name of justice.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**8. “Caste system is assuming new identities and associational forms. Hence, caste system cannot be eradicated in India”. Comment. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "**Introduction**\n\n* Caste refers to a broad hierarchical institutional arrangement along which basic social factors like birth, marriage, food-sharing etc are arranged in a hierarchy of rank and status. These sub-divisions are traditionally linked to occupations and decide the social relations with respect to other upper and lower castes.\n* The traditional hierarchical ordering of castes was based on the distinction between ‘purity’ and ‘pollution’. While the manifestation of the order has changed to a large extent in the recent times, the system itself has not changed much.\n  + For example- even though untouchability and caste-based discrimination is barred under the Constitution of India, occupations like manual scavenging have the majority of workers from lower castes.\n\n**New identities and associational forms**\n\n* **Political:**In contrast to the older structure, various caste communities have asserted themselves by forming political parties based on caste identities. For example-\n  + Bahujan Samaj Party. Political mobilization based on caste has been rising.\n  + Lingayats’ demand to be considered as a minority community.\n* **Economic:**Development policies targeting the backward castes and scheduled have benefitted only a section of the population. These sections have emerged as the elite and this has created a division within the backward castes. Also, the welfare policies have led to social stigma among the castes which are not included. These policies have strengthened the caste-based mobilization. For example:\n  + Dominant castes like Marathas, kapus and patidars have been demanding reservation.\n  + Socially empowered and landholding communities like Jats have also mobilized themselves and have demanded reservation.\n* **Social:**Under the impact of globalization and technological advancement, the strict codes of marriage and inheritance have diluted with more inter-caste marriages taking place. Caste groups like Khap Panchayats have been brought under the scrutiny of the judiciary. The expression of social exclusion and maintaining the caste-based division by the communities has however not vanished but has changed to become more subtle. For example-\n  + The matrimonial advertisements are frequent in the newspapers that especially demand brides and grooms from particular communities.\n  + Even religions that do not follow caste systems like Muslims and Christianity have observed caste-like discrimination. Dalits who have converted to Christianity have separate graveyards in States like Kerala.\n\n**Conclusion**\n\n* Considering that these divisions offer solidarity and psychological strength to various marginalized groups, even if the caste-based discrimination is diffused through the legislative enforcement the divisions of identity will be difficult to erase.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**9. ‘Despite implementation of various programmes for eradication of poverty by the government in India, poverty is still existing’. Explain by giving reasons. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Poverty is a social and economic condition in which a part of the society is unable to fulfill its basic requirements. Reducing poverty has become an international concern as SDG 1 targets to end poverty in all its forms everywhere.\n\nRemoval of poverty has been a prime focus of Indian policy makers. Integrated Rural Development Program (IRDP) initiated in early 1980s was one of the early poverty alleviation programmes. Since then a large number of programmes and schemes have been launched, but they have not been able to give the desired results. Reasons for existence of poverty in India are:\n\n* Numerous already functional poverty alleviation programmes work in silos.\n* There is no systematic attempt to identify people who are below poverty line; to determine and address their needs; and enable them to move above the poverty line.\n* There are cases of corruption in identification of beneficiaries, and there is also a lack of authentic data at every level.\n* A typically low administrative capacity, coupled with problems of implementation at State level has often resulted in the under utilization of funds.\n* Leakage at different levels has led to diversion of resources meant for deprived ones.\n* These programmes have focused on top to bottom approach, but such approach lacks coordination in decision making and causes clogging of funds and asymmetry in distribution.\n\nPoverty eradication in a country with a huge population like India needs to involve programmes and policies with bottom up approach, technological interventions, and a mix of innovative ideas like Universal Basic Income.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**18. ‘Women’s movement in India has not addressed the issues of women of lower social strata.’ Substantiate your view. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Though efforts were made to uplift the status of women prior to independence, the women’s movement in India gained prominence in 1970s and 80s. These movements have tried to bring the women specific issues in the public domain.\n\nHowever, it is found that these have not been able to address the issues of the women of lower social strata, belonging to SC, ST, minorities, and BPL families.\n\n* It is being seen that activists within the movements are urban, western, and middle class. Therefore, the movement is being considered a Western product. It has little to do with the lives of thousands of poor, rural, underprivileged women all over India.\n* Women continue to have unequal access to land and other resources. Compensation policies in case of displacement are inevitably discriminatory towards women of lower strata due to multiple reasons such as lack of awareness, education etc. Women from these sections also find it more difficult to get loans.\n* Recently, several movements have raised the gender issues through temple entry movement, triple talaq, etc. But temple entry movements are restricted to the specified places only, and triple talaq especially in hinterland or rural areas, go unnoticed.\n* Sexual and domestic violence is mainly perpetrated against the women from lower caste and poor women but this issue has not acquired centre-stage in the discourse of women movements.\n\nIssues of women agricultural labourers (e.g. fair wages etc.), women domestic workers and women manual scavengers has not been raised by the women movement prominently.\n\nHowever, there is also a counter view that the urban, middle-class women are one of the participants in the movement. It is rather the poor women which are the backbone of the movements, exemplified the presence of poor women in the anti-alcohol agitation in Andhra Pradesh, and other parts of India. Similarly, the movement to protect the environment was started by poor women in Reni village of Uttarakhand and thereafter, it spread to other parts of the country.\n\nBut there are substantial evidences to prove that women movements have neglected the lower strata women. The National Federation of Dalit Women (NFDW), formed in 1995, has forced women’s movements in India to address the caste question seriously. Thus there is an urgent need of women movements to be more inclusive and just, embracing the cause of poor and vulnerable women.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**19. ‘Globalization is generally said to promote cultural homogenization but due to this cultural specificities appear to be strengthened in the Indian Society.’ Elucidate. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Globalization is a process in which the world becomes a global village as national and regional economies, societies, and cultures get integrated through the network of trade, communication, migration and transportation. The pace of globalization has accelerated in India after the adoption of the policies of liberalization, privatization & globalization in the 1990s.\n\nGlobalization is leaving its footprints on almost every aspect of Indian society such as language (English), cuisine, clothing, etc., and thus leading to homogenization in many respects. There is an increasing tendency towards ‘glocalisation’ of culture which refers to the mixing of the global with the local culture.\n\nLiberal ideas of individualism are permeating the Indian society; joint families are giving way to nuclear families; live-in relationships are proliferating; celebration of Valentine’s Day, Mother’s Day; consumption of pizza, burger, chowmein etc.; wearing jeans and tops; cropping up of MNCs; popularity of Hollywood movies, Bhangra pop, Indi pop, etc. are some of the homogenizing influences of globalization on Indian society.\n\nHowever, globalization is not simply about homogenization, but it is also strengthening cultural specifities in India.\n\n* A large segment of populace feels insecure by the inroads of globalization and are trying to preserve their cultural traditions and practices.\n* Indian classical dance and music has got fillip in the recent years with the efforts of organization like SPIC MACAY and others.\n* Local customs, and festivals are being observed by some tribal groups, especially in North-east India more zealously than before.\n* The Indian culture has also spread its impact globally. Yoga traditions and practices are not only being practiced by Indians, but people across the globe are embracing them.\n* Indian system of Ayurveda is being promoted by a large section of society in the backdrop of the ills of western system of medicine and cure. For example profuse use of ‘Patanjali’ products by the middle and lower middle classes of India.\n\nHowever, there are also negative reactions to the process of globalization. Revival of caste, race and cultural identity at times leads to chauvinistic tendencies and may hurt the peace and harmony of the society. Excessive emphasis on cultural specifities, as a reaction to globalization may lead to protectionism, proliferation of orthodox ideas, and fundamentalism.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_1_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**20. ‘Communalism arises either due to power struggle or relative deprivation’. Argue by giving suitable illustrations. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "According to historian Bipan Chandra “communalism is the belief that because a group of people follow a particular religion, they have as a result, common social political and economic interests.” The majority community alleges that minorities have an anti-national approach while the minority points to the insecurity they are facing which often collides and trigger tensions.\n\nCommunalism is a modern phenomenon which took its origin in the British colonial period and gained momentum at the time of freedom struggle and reached its heights at the time of partition. Its fundamental causes are secular like competition for share in political power or government jobs and a feeling of relative deprivation. Religion is not its fundamental cause but becomes an instrumental cause because it has great mobilizing power.\n\n**Example – The Bhiwandi communal riot (1970)**\n\nThe struggle for political power and a sense of relative deprivation creates communal problems. Bhiwandi in Maharashtra was a centre of powerloom industry with minority community’s domination in ownership and labourers. Some members of minority community having amassed much wealth wanted to get a hold in the political set up of Bhiwandi, challenging the traditional leadership in Municipal administration. This led to a major riot in 1970.\n\nThe practice of mixing up religion with politics or using religion for the sake of political and economic gains is a reason for conflict between communities.\n\nThe progress of one community is viewed with unpleasantness and the economic collapse of the opposite side is gladly welcomed in a communally charged atmosphere. The vested interest groups having economic and other anti-social motives trigger communal conflicts in order to gain through a riot.\n\nReligion, when deliberately used as a tool for attaining power, both political and over resources, leads to the growth of communalism. The rising trend of communalism and the violent aftermath that follows it is a major threat to the integrity of India. So, efficient and effective measures must be adopted against the evil of communalism and checking its spread on the social fabric of India.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_4_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**5. (a) Suppose the Government of India is thinking of constructing a dam in a mountain valley bound by forests and inhabited by ethnic communities. What rational policy should it resort to in dealing with unforeseen contingencies? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Constructing a dam in a mountain valley entails many challenges. A comprehensive rehabilitation policy would ensure that unforeseen contingencies which bug many development projects are avoided. The following points of action should constitute the rational policy in dealing with contingencies.\n\n**Transparent Rehabilitation, Resettlement:** Government must implement resettlement packages making the ethnic communities/tribals materially better off to counter the narrative that development and modernization is disastrous for tribals, who cannot cope with the change. Land distribution, compensation for loss of houses, forest produce and grazing land and other such resettlement measures should be implemented thoroughly without prejudice.\n\n**Maintain transparency, ensure economic welfare:** The oustees must be provided complete information regarding the dam, submergence and subsequent displacement due to them. Project authorities and state government must rehabilitate the oustees with sustainable non-land based livelihoods where needed. The various problems associated with displacement are compounded several times over for oustees who are also otherwise specially vulnerable, variously by class, caste, gender or age. Such vulnerabilities should factor in rehabilitation packages.\n\n**Public Hearing:** From the inception of planning of dam, through various stages of displacement and resettlement, it is to be expected that those likely to be negatively affected by the projects would be consulted and kept informed in such a way (public hearing, social audit) as to enable them to best rebuild their lives. Bureaucratic lassitude and insensitivity should not be tolerated.\n\n**Ensure Tribal welfare:** The Forest department must proactively involve the people in the forest villages about possible submergence and displacement. Tribal people share the problems of other rural people but they are even more dependent on forests and common property resources, their documented legal rights on cultivable lands are even more tenuous, their skills for diversified livelihood not based on forests or land are even more rudimentary, and their ability to negotiate with state officials and courts even more weaker.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q3",
      "serial_no": "3",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**3. Examine the linkages between the nineteenth century’s Indian Renaissance and the emergence of national identity.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Nineteenth century witnessed significant **changes in Indian polity and society** consequent to the expansion and consolidation of British imperialism in India which **made Indians realise that their interests were sacrificed** in order to promote the interests of the British authority.\n\nThe **impact of modern western culture and consciousness of defeat by a foreign power** gave birth to a new awakening. The **modern educational systems** familiarised the educated classes with the **ideas of equality, liberty and nationalism**. They were impressed by modern science and the **doctrines of reason and humanism**. Thoughtful Indians who were product of modern education began to look for the strengths and weaknesses of their society aimed at **giving back to the nation its lost identity**.\n\nThis new cultural project, which partly manifested itself through the social and religious reforms was encoded in the phrase **‘Indian Renaissance’**. It marked a period of transition in values, transformation in social sensibilities and rebirth in cultural creativity.\n\nA defining feature of the movement was an **inquiry into the past** and an assessment of the traditions to overcome contemporary problems. Ram Mohan Roy’s use of Hindu scriptures in his debate with his opponents on Sati, or Ishwar Chandra Vidyasagar’s widow remarriage campaign, or Narayana Guru’s advocacy of universalism sought to eliminate social obscurantism, religious superstition and irrational rituals. The common feature that they all shared was the **urge to transform the existing social and cultural conditions**, ranging from irrational religious practices and rituals to the oppressive state of women’s lives.\n\nRenaissance ‘purified’ and ‘rediscovered’ **an Indian civilisation that was conformant with the European ideals** of rationalism, empiricism, monotheism and individualism. It was meant to show that **Indian civilisation was by no means inferior to that of the West**, rather in one sense, in its spiritual accomplishments it was even superior to it.\n\nEvidence of this search for a superior national culture could be found in the **development of patriotic regional literature**, in the **evolution of new art forms**, in the **search for purer forms of classical music** and in the **construction of new ideals of womanhood**. The literary movement led by Bankim Chandra Chattopadhyay, Tagore, Iqbal and Subramaniya Bharati provided leadership with imagination and fervor.\n\nThe movement, thus, not only talked of beauty and nationalism but also revealed to its followers India in terms of its spirit, its philosophy, its arts, its poetry, its music and its myriad ways of life. The sense of pride in the spiritual essence of Indian civilisation, as opposed to the material culture of the West, motivated Indians to confront the colonial state in a newly emerging public space. This, in other words, provided the **ideological foundation of modern Indian nationalism** that developed in the late nineteenth century.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**12. Assess the role of British imperial power in complicating the process of transfer of power during the 1940s.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "### Introduction\n\nBritain never wanted to leave India but the promise to the Indian National Congress of independence in return of Indian resources and army during World War Two; the post war financial and political exhaustion; change in political power at the centre (Labour Party) whose ideology favoured the Congress party; increasing global pressure and the inability to crush Indian leaders’ will and efforts finally led to the Indian independence. However, Britain did succeed in making the process of transfer of power so complicated and hard that India still suffers from them.\n\n### Cabinet Mission\n\n* **Sir Stafford Cripps** was responsible for drafting the Cabinet Mission Plan, which proposed **a complicated system** for India with **three tiers- the provinces, provincial groupings and the centre**. The centre’s power was confined to foreign affairs, defence, currency and communication only.\n* **Three major groups** of provinces: **Group A**, to include the **Hindu-majority** provinces; **Group B**, containing the **Muslim-majority** provinces **(western Pakistan)**; and **Group C**, to include the **Muslim-majority** Bengal **(eastern Pakistan)**.\n* Even though both Nehru and Jinnah eventually refused to accept it, **Lord Wavell** authorised a **cabinet with Nehru as the Interim Prime Minister** which enraged Jinnah who in turn resorted to direct action of sparking **riots and massacres**.\n\n### Partition\n\n* In **July, 1947** the British Parliament passed the **Indian Independence Act** which provided for the **demarcation of India and Pakistan** by midnight of August 14–15, 1947, in just one **month**. **Two Nations Theory** was an important factor here and fuelled **communalism**.\n* The task of demarcating the boundaries was given to a **British lawyer, Sir Cyril Radcliffe** who had never visited the country before and was clueless about the social and political consequences of his decision. **Two boundary commissions** were set up for it.\n* During partition, there was a large-scale **communal violence and forced migration of people**, probably the biggest in history.\n\n### Autonomy to Princely States\n\n* The **British paramountcy** on the princely states and all the **existing treaties of** Britain with the princely states before the independence ended in 1947.\n* As princely states were not a part of the British India, they became independent and had the **option to either merge with India or with Pakistan or to stay independent**.\n* Even after the efforts of **Lord Mountbatten, Nehru** and **Patel**, few princely states like **Kashmir, Junagadh** and **Hyderabad** posed some serious challenges in the already troubled times.\n\n### Conclusion\n\nIt was hard to let go of the main resource supplier and the market consumer but when the odds were not in favour of Britain, it gave independence to India but made sure to create some contentious issues while leaving India. A lot of current day problems like issue of enclaves with Bangladesh (later resolved through The Constitution 100th Amendment Act, 2015), the migration issue, Kashmir issue between India-Pakistan etc. have their roots in the complications created by the British imperial power during the 1940s.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**19. What are the continued challenges for Women in India against time and space?**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Nearly one-sixth of the world’s women live in India and many of them had adorned high offices like that of President, Prime minister, Speaker of the Lok Sabha, Leader of the Opposition, yet there are innumerable women who rarely step outside their homes.\n\nChallenges faced by Indian women emanates from **Hegemonic patriarchy**, which is prevalent in Indian society.\n\n* It means the idea that discrimination against women appears to be common sense to such an extent that not only men but even women also become the supporter and perpetrator of the very notion which discriminates against them.\n\n**This leads to various problems like:**\n\n* Oppression against women starts right from the womb: **Female infanticide**.\n  + This can be reflected in poor child sex ratio, i.e. 919/1000 according to census 2011.\n* Girls are the worst sufferer of **the vicious cycle of poverty and malnutrition**.\n  + This is augmented by a lack of education and reproductive rights.\n* **Motherhood penalty:**\n  + The primary responsibility of taking care of family and bringing up the child is still on the women.\n  + This includes unpaid care work such as childcare, elderly care, and household work.\n  + Many women due to family pressures have to retreat from the workforce.\n* **Declining female labour force participation rate (LFPR)**\n  + Despite increasing levels of education and declining fertility rates, the current female LFPR is 23.7%.\n* **Commodification of women**  \n  + The women are either shown as docile homemakers or they are shown as sex symbols trying to convince the public at large to buy the product.\n* **Pink collarisation of jobs**\n  + The women are mostly deemed fit for “pink-collar jobs” only, such as teachers, nurses, receptionist, babysitter, lecturer etc. which have been stereotyped for women.\n  + This denies them opportunities in other fields\n* **Glass ceilings**  \n  + Women in India face artificial barriers like stereotypes, media-related issues, informal boundaries, which prevent them from advancing upward in their organization into management-level positions.\n  + This can be reflected in an increasing wage gap between men and women.\n* **Sexual harassment at the workplace**  \n  + #Metoo movement shed light on numerous instances of sexual harassment at the workplace.\n  + However, due to the slow judicial system, justice hasn’t been delivered to these women.\n* **Lack of political participation of women**  \n  + Indian Parliament currently has 11.8% women representation, and state assemblies have only 9%.\n  + Even though the 73rd constitutional amendment act mandates 33% of panchayat seats to be reserved for women.\n  + However, The dichotomy between representation and participation can be reflected by the prevalence of “Sarpanch Pati”.\n\n### Way Forward\n\n* Indian Society doesn’t need better laws but better implementation.\n* Reservation in parliament for women must be implemented as soon as possible.\n* The government must empower women through Self-help groups so that they can become financially independent.\n* Affirmative action should be pursued by the government to induct more and more women into positions of authority.\n* Supreme court judgement of decriminalizing adultery and homosexuality, have reaffirmed women’s right to sexual autonomy.  \n  + However, Society has a larger responsibility to disassociate itself from the stigma attached to women’s sexuality.\n* Women’s issues are not a political problem but a social issue, Hence it requires a cultural revolution.  \n  + Movies like Padman and Toilet will help in challenging the hegemonic patriarchy.\n  + Apart from it, Beti Bachao Beti Padhao initiative is a step in the right direction.\n\nIn order to improve the condition of Indian women, society must remember words of J.L. Nehru: “India To awaken the people, it is the woman who must be awakened. Once she is on the move, the family moves, the village moves, the nation moves”.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**20. Are we losing our local identity for the global identity? Discuss.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Indian society is represented by a set of local cultural traits like local languages, different food choices, dressing styles, classical music, family structure, cultural values, etc. There has been a growing sense of insecurity among the Indian masses regarding the gradual degradation or loss of our local identity. This gradual loss of local identity is popularly attributed to globalization that creates a global culture in which the local identity is amalgamated to bring a homogenous culture throughout the world.\n\nThis sense of insecurity is not baseless and is supported through the following facts:\n\n* **Loss of local languages for English:** Under the growing trends of convert culture in education and servicebased economy, English education has developed rapidly at the cost of several vernacular languages.\n* **Loss of classical music for Pop and Jazz culture:** The changing taste of music among Indian youth has put a question mark over the survivability of traditional classical music in India.\n* **Loss of collective identity for individualism:** With rise in metropolitan of Indian population, the individualism is growing and the social relations are now based on commercial benefits.\n* **Loss of joint family structure for nuclear family system:** Economic migration and the choice for individual space have broken the joint structure of family in India. At this junction, the old-aged and children are depriving of the required care.\n* **Loss of moral education for advanced commercial education:** The growing disorientation between morality and higher education is the greatest demolition of our identity.\n* **Degradation of the institution of marriage:** The growing acceptance to the live-in-relationship has questioned the sanctity of the institution of marriage in our society. This represents the dominance of western culture and the Indian way of living.\n* **Changing style of clothing:** With the rise in corporate culture, the Indian dressing style has remained merely an occasional stuff that too in cultural occasions only.\n* **Loss of traditional food choice:** With the rise of chain restaurants and hotels, the food choice of Indian youth has inclined towards the Italian and Chinese fast foods. This has caused foods that are comparatively healthy and rich in nutrients.\n* **Deadline of cultural values:** In the have of freedom of speech, the traditional values of moral decency, respect to elders, following the rituals etc. are all declining.\n* Loss of indigenous system of medication like Ayurveda, Yoga etc.\n\nDespite these facts, another dimension of thoughts about globalization points to the universalization of our local beliefs and cultural values rather than demolition. This dimension is also supported equally through various facts like:\n\n* **Indian festivals are now being celebrated all across the world:** The most significant example is the Diya stamps issued by UNO to celebrate Diwali. Even a local religious festival of Chhath Puja is celebrated in Silicon Valley, USA.\n* **Observance of International Yoga Day on 21st June:** This has popularized the Yoga throughout the globe.\n* Observance of World Hindi Day on 10th January and organization of World Hindi Conference.\n* ISKCON foundation has spread the practice of Bhakti Yoga in different Western countries. This promotes religious tourism in our country.\n* Indian classical music is being liked all across the world and it is appreciated at Berklee school of music. SPIC MACAY, an NGO has promoted the Indian classical music and culture among youth across the world.\n* Taj Mahal is among the seven wonders of the world.\n\nThus, culture is an ever-evolving entity which constantly changes through diffusion and amalgamation. Of course, we should embrace our cultural identity and values and it is our duty to preserve our cultural identity, however, globalization is not a matter to worry and infusion of global identity should be welcomed.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_2_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**2. The central administrative tribunal which was established for redressal of grievances and complaints by or against central government employees nowadays is exercising its power as an independent judicial authority. Explain.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "A new Part XIV-A was added to the Constitution by the 42nd Amendment Act of 1976. This part is titled as ‘Tribunals’ and consists of Article 323A which empowers the Parliament to provide for the establishment of administrative tribunals for the adjudication of disputes relating to recruitment and conditions of service of public servants.\n\nConsequently, the Central Administrative Tribunal (CAT) was established by an Act of 1985. The Principal seat of CAT is at New Delhi with additional benches in different states. The CAT has been given original jurisdiction in relation to recruitment and all service matters of public servants covered by it.\n\nThe Central Administrative Tribunal (CAT) acts as an independent judicial authority i.e. it performs the duties free of influence or control by other actors.\n\n* Article 323A enables the Parliament to take out the adjudication of disputes relating to service matters from the civil courts and the high courts and place it before the administrative tribunals.\n* CAT is of statutory origin, as opposed to Supreme Court and high courts which have direct origin from the Constitution. Nevertheless, the 1985 Act, by establishing CAT, has opened a new chapter in the sphere of providing speedy and inexpensive justice to the aggrieved public servants.\n* The members of CAT are drawn both from judicial as well as administrative streams so as to give the Tribunal the benefit of expertise both in legal and administrative spheres.\n* CAT is free from technical rules of Indian Evidence Act, 1872 and procedural shackles of the Code of Civil Procedure, 1908 but it has been vested with the powers of Civil Court in respect of some matters including the review of their own decisions and are bound by the principles of natural justice.\n* Recently, the Delhi High Court has held that the CAT can exercise the same jurisdiction and powers, as a High Court, in respect of its contempt proceedings. Thus, it gave more power to act as an independent judicial authority.\n* In another case, the CAT has taken a swipe at Delhi High Court because during June vacations the High Court has heard briefly a case which was originally pending before the tribunal.\n\nHowever, the Central Administrative Tribunal still cannot be called truly independent judicial body because\n\n* the Tribunal members do not enjoy powers like other judges who hold constitutional posts, and\n* it is dependent on the executive for appointing members of the tribunal and their funding.\n\nThus, it can be fairly argued that the tribunal which was formed for grievance and complaints redressal has although evolved into a judicial body but it cannot be called entirely independent.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_2_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**10. Too little cash, too much politics, leaves UNESCO fighting for life.’ Discuss the statement in the light of US’ withdrawal and its accusation of the cultural body as being ‘anti-Israel bias’.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "UNESCO was created in 1945 with the firm belief that, forged by two world wars in less than a generation, political and economic alliances were not enough to build world peace. In this sense, peace must be established on the basis of humanity and our moral and intellectual solidarity with one another.\n\nThe announcement of the US to withdraw from this cultural body has once again highlighted the politicization of its activities and limitation of funds-\n\n* At the heart of its problems is a financing crisis since 2011, when UNESCO voted to admit Palestine as a full member state and Washington responded by halting payment of its annual $80 million in dues.\n* Since then, Israel has regularly complained over resolutions on cultural sites in the West Bank and Jerusalem, arguing that they are worded to delegitimize the Jewish state. Israel’s foes say it uses U.S. support to deflect bona fide criticism.\n* Without U.S. money, UNESCO, which employs around 2,000 people worldwide, has been forced to cut programmes, freeze hiring and fill gaps with voluntary contributions. Its 2017 budget was about $326 million, almost half its 2012 budget.\n* Other major contributors such as Japan, Britain, and Brazil delay funds, sometimes citing objections to the body’s policies.\n* Japan, for example, has threatened to withhold dues over the inclusion of the 1937 Nanjing Massacre in the body’s “Memory of the World” programme.\n* Russia and Ukraine have been at odds over Crimea, with Kiev accusing Moscow of trying to legitimise its annexation of the territory through UNESCO.\n\nThe fact is that UNESCO was all about solidarity and creating a climate for peace between countries, but nations now use their dues/funds to influence programmes. The preservation of shared human heritage needs a concerted effort involving all countries, for this, nations should sacrifice zero-sum game of politics.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_2_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**12. Parliament’s power to amend the constitution is limited power and it cannot be enlarged into absolute power”. In light of this statement explain whether parliament under Article 368 of the constitution can** **destroy the Basic** **structure of the constitution by expanding its amending power?**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Article 368 of the Indian constitution gives the parliament the power to amend by way of addition, variation or repeal any provision of the constitution in accordance with the procedure laid down by the law. The power to amend the constitution is necessary to overcome the challenges and to meet the demands for the nation’s growth and development.\n\nHowever, in the process of amending the constitution under Article 368, the Parliament at times have breached the constitutional limits by transgressing the areas related to federal relation between Union and States, issues of Individual liberty and to a certain extent misused Article 368 itself. This is evident from amendments like 25th and 42nd Constitutional amendment Acts which has threatened the principle of constitutionalism.\n\nTherefore, the Supreme Court intervened to create a harmonious balance between fundamental rights and the Directive Principles which eventually led to the emergence of the doctrine of ‘basic structure’ of the constitution.\n\nThe emergence and the application of the doctrine of ‘basic structure’ can be seen in light of following **Supreme Court judgments**:\n\n* ***Kesavananda Bharati Case (1973):*** The Supreme Court held that Parliament’s power to amend the constitution is limited as it cannot alter the ‘basic structure’ of the constitution.\n  + A limited amending power is one of the basic features of the constitution and, therefore, the limitations on that power cannot be destroyed.\n  + Parliament cannot, under Article 368, expand its amending power so as to acquire for itself the right to repeal or abrogate the Constitutional provisions which threatens the basic features or the Constitution itself.\n* ***Minerva Mills v/s Union of India Case (1980):*** The Supreme Court struck down clauses (4) and (5) of Article 368 inserted by 42nd Amendment, on the ground that these clauses destroyed the essential feature of the basic structure of the constitution.\n* ***Chandra Kumar v/s Union of India (1997):*** The judgment held that every provision of the Constitution was open to amendment provided the basic foundation or structure of the Constitution was not damaged or destroyed.\n\nThus, Parliament is restricted in its power to amend the Constitution so that the soul of Constitution as envisaged by founding father of India remains intact. It is to be noted that, the doctrine of basic structure does not undermine the legislative competence of the parliament, rather it helps in maintaining the supremacy of the constitution and upholding the constitutional spirit.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_2_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**19. ‘The long-sustained image of India as a leader of the oppressed and marginalised nations has disappeared on account of its new found role in the emerging global order.’ Elaborate.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "As the founding member of the **Non-Alignment Movement (NAM),** India propagated its vision among the newly independent countries of the colonized world to not align with any of the power blocks as these newly independent countries were weak in terms of military, economics and development aspects.\n\nThese ideas of **Non Alignment, Peaceful Cooperation and Co-existence, End of Imperialism and Colonialism** have made India one of the leaders of the marginalized nations.\n\nThe leadership and idealistic credentials of India was sustained and can be seen:\n\n* During the cold war era.\n* Upholding the interests of the smaller economies in Doha round of WTO.\n* Supporting the cause of vulnerable nations during the Climate change negotiations.\n\n**Shift in India’s approach towards its strategic foreign policy perspective:**\n\n* **Economic Development** is now a major agenda of India’s growth as a world power, which is now reflected in India’s foreign policy.\n* This trend was observed in **NAM Summit Havana 2006,** where India focused on anti-terrorism, nuclear disarmament, energy security, investing in Africa and such issues which are vital to India’s growth and doesn’t resemble priorities of developing or marginalized countries.\n* India has actively supported the cause of developing and marginalized nation in Climate Change negotiations by thrusting on **“differentiated responsibility”** but recently diluted its stand in Paris negotiations.\n* India has also been **blamed** for interfering in the internal affairs of neighbouring countries, for instance, **Nepal**, which led to friction in relations between the two nations.\n* In regional forum **SAARC**, India has hard pressed its agenda of boycotting Pakistan, which resulted in the non-functioning of **SAARC**, which may result in delaying of development projects of SAARC in our smaller neighbouring nations.\n* India’s involvement in **QUAD**, its focus on **Indo Pacific Regional Growth** and **countering China** has became its top priority.\n\nThese inferences are pointing towards shift in India’s approach from the leader of the oppressed countries to a great power in its own terms. India’s approach is shifting from **Idealism to Realism** and is **prioritizing its national interests over the collective interests of the developing countries**.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_3_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**6. What is India’s plan to have its own space station and how will it benefit our space programme?**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "A space station is a large artificial satellite designed to be occupied for long periods and to serve as a base for scientific observation. Recently, India has announced its plan to build its own space station, as a carry forward of the Gaganyaan mission, which will be the first Indian manned mission to space.\n\n### India’s Plan toward own Space Station\n\n* The proposed space station is envisaged to weigh 20 tonnes and serve as a facility where astronauts can stay for 15-20 days.\n* It would be placed in lower Earth’s orbit at around 400 km above the earth.\n* The time frame for launch is 5-7 years after the Gaganyaan mission which is expected to take place in 2022.\n* The Gaganyaan mission would equip the ISRO with the necessary technology required for creating space platforms.\n\n### Space station’s benefit toward the space programme\n\n* It would help to sustain Human Space Mission in the future for a longer period of time.\n* Space platforms can be used to perform Microgravity experiments. It would help in scientific and technological developments such as innovations related to water purification and biotechs.\n* It will help in Deep space exploration like the study of other galaxies.\n* The indigenous Space station would enhance India’s image in the international sphere. It would increase\n* India’s position as a space power.\n* India can earn revenue from the commercial engagements with other countries from its space prowess.\n\nIndia should increase its engagement with the private sector and research institutions in order to create human resources and innovative products for its growing space economy.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**8. Has caste lost its relevance in understanding the multi-cultural Indian Society? Elaborate your answer with illustrations.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "The caste system was originally intended to organise the society on the basis of occupation. Caste became an arrangement to pass on the skills acquired to the posterity.\n\n* Each caste had their own distinct customs, assumptions, values, communicative styles which coexisted simultaneously.\n* But, gradually the caste system rigidified and it became hereditary and a symbol of status and pride.\n* Sanskritisarion was one factor which predominantly encouraged homogenisation of cultural values, aided by modernisation.\n\n### Caste and its relevance\n\n* The development activity of the state and the growth of private industry have affected caste indirectly through the speeding up and intensification of economic change. The modern industry created all kinds of new jobsfor which there were no caste rules.\n* Urbanisation and the conditions of collective living in the citiesmade it difficultforthe caste-segregated patterns of social interaction to survive.\n* Modern educated Indians attracted to the liberal ideas of individualism and meritocracy, began to abandon the more extreme caste practices. However, it was in the cultural and domestic spheres that caste has proved strongest.\n* Endogamy, or the practice of marrying within the caste, remained largely unaffected by modernisation and change. Even today, most marriages take place within caste boundaries, although there are more intercaste marriages.\n* Since the 1980s, we have also seen the emergence of explicitly caste-based political parties. The policies of reservation and other forms of protective discrimination are instituted by the state in response to political pressure.\n* A new casteism has emerged, which is characterized by the success of certain selected privileged castes. The benefits of capitalism, after 1991, has not percolated down to castes which are deprived of education or marked by poverty.\n\nOne of the most significant yet paradoxical changes in the caste system in the contemporary period is that it hastended to become ‘invisible’ for the upper caste, urban middle and upper classes. For the so-called scheduled castes and tribes and the backward castes – the opposite has happened. Forthem, caste has become alltoo visible.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**9. COVID-19 pandemic accelerated class inequalities and poverty in India. Comment.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "The COVID-19 pandemic was unprecedented. From the perspective of the economy both rural and urban areas have been impacted adversely. According to the IMF, the pandemic is having particularly adverse effects on economically more vulnerable people, including younger workers and women.\n\n### Aggravating Inequality\n\n* **Rich got Richer:** The pandemic’s economic impact was “unequal among unequals”. While the poor were struggling and had to incurOut of Pocket expenditure to arrange theirfood and health requirements,the wealth of billionaires increased by 35% during the lockdown and by 90% since 2009 (Oxfam report).\n* **Informal Labourers:** Around 90% of India’s workforce is employed in the informalsector who are not provided with employment and social security. About 400 million people are expected to slip into poverty due to the impacts of the pandemic, mostly belong to informal sectors (ILO).\n  + The economically worst hit were India’s millions of migrant workers, who were seen walking hundreds of kilometresto their homes. Reliant on their daily wagesforsurvival and without immediate assurances, they were left without any assistance.\n* **Digital Divide:** Closing down of schools had wide social and health implications. It also brutally exposed the deep digital divide in the country.\n  + According to ASER, among enrolled children, around 62% live in families that own at least one smartphone making education among poor inaccessible.\n  + Closing down of schools also deprived the less privileged students of key nutrients. They provided mid-day meals which also served as an incentive, especially among families of first-generation learners.\n* **Women:** India already had a low labour force participation rate for women due to a couple of factors such as restrictive cultural norms and the gender wage gap. The COVID-19 pandemic has made their situation more dismal. Unemployment for women has risen by 15% during the pandemic from a pre-lockdown level (Oxfam).\n\nThe COVID-19 pandemic revealed the need for serious attention for policymakers with regard to public health service provision, economic support for the vulnerable, and inequality mitigation.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_1_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**10. Do you agree thatregionalismin India appearsto be a consequence ofrising cultural assertiveness? Argue.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Regionalism is a sense of identity and purpose among a section of population residing in a particular geographicalspace characterized by unique and common language, culture, history etc. In country like India, having vast diversity and culture, regionalism seems inevitable.\n\nOften it has been argued that regionalism in India is a result of rising cultural assertiveness. To an extent, this istrue because cultural components do interpretregionalismby way of cultural heritage,myths, folklore,symbolism and historical traditions. Nevertheless, apart from socio-cultural factors, there are other determinants as well.\n\n* **Historical factors:** Colonial policies formed the foundation of regionalism in India. Differential attitudes and treatment by the British towards princely states and those ofthe presidencies encouraged regionalisttendencies among them.\n* **Geographical isolation:** Sometimes geographical isolation and continuous neglect of a region give rise to the feelings of separatism and regionalism among the inhabitants of the region. The ‘insider-outsider complex’ in North- eastern states is the result of geographical isolation.\n* **Economic underdevelopment:** Despite being rich in natural resources some regions remain economically underdeveloped. These types of regional imbalances in development also lead to the rise of regionalism in some regions. Creation of Jharkhand, Chhattisgarh is an example.\n* **Political and administrative factors:** Sometimes political parties, particularly regional parties and local leaders, fuel and exploit the regional sentiments to capture power.\n* **Linguistic aspirations:** These have remained a formidable basis of regionalism in India. Post-Independence, widespread agitations against Hindi as national language in southern states,showsthe crucial role of language in the emergence of Regionalism.\n\nAlthough, socio-cultural factors motivate regionalism, other factors such as socio-economic and political also play a crucial role in it. The accommodation of multiple aspirations of a diverse population is necessary.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_2_Q13",
      "serial_no": "13",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**13. The strength and sustenance of local institutions in India has shifted from their formative phase of ‘Functions, Functionaries and Funds’to the contemporary stage of ‘Functionality’. Highlightthe critical challenges faced by local institutions in terms of their functionality in recent times.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "“When the panchayat raj is established, public opinion will do what violence can never do.” – Mahatma\n\nGandhi Local Self Government is the management of local affairs by such local bodies who have been elected by the local people. The history of local institutions in India goes back to 1952 when the **Community Development Programme** (CDP) was introduced.\n\n**Formative Years of Local Institutions**\n\n* In the developing phase of the local institutions, the debate was around what functions shall be allotted to these institutions, who will execute these functions and how the funds will be mobilised for their implementation.\n* In 1957, Balwant Rai Mehta Committee reviewed the working of the CDP. The committee suggested a threetier PRIs, namely, Gram Panchayats at the village level, Panchayat Samiti at the block level, and Zilla Parishad at the district level.\n* In 1977, Ashok Mehta Committee recommended compulsory power of taxation and in 1985 the GVK Rao Committee recommended assigning an role with respect to planning, implementation and monitoring of rural development programmes.\n* The Gadgil Committee in 1988 made comprehensive recommendations on local institutions. Based on its recommendations, 73rd and 74th Constitutional Amendments were passed.\n  + It provided a three-tier system for local government and assigned them constitutional status.\n  + Gram Sabha is the foundation of the Panchayati Raj system.\n  + All members of local bodies shall be directly elected by the people and seats shall be reserved for SC/ST and women at all three levels.\n  + State Election Commission to supervise elections.\n  + Endowment of power and functions, such as preparation of plans for economic development and social justice.\n  + Formation of State Finance Commission every 5 years to review the financial provisions of local bodies.\n* The above amendments have been able to address the functions, functionaries and funds debate. However, in recent times strength and sustenance of local bodies are facing functionality related issues.\n\n**Functionality related challenges**\n\n* **Structural Deficiencies:** PRIs suffer from structural deficiencies i.e. inadequate secretarial support and lower levels of technical knowledge which restricted the aggregation of bottom-up planning.\n* **Adhocism:** There is a presence of adhocism i.e. lack of clear setting of agenda in Gram Sabha, Gram Samiti meetings and no proper structure.\n* **Proxy Representation:** Though women and SCs/STs have got representation in PRIs through reservation mandated by 73rd amendment, proxy representation, for example, in case of women through Panch-Pati, acts as a major hurdle.\n* **Overlapping Functions:** The issue of ambiguity in the division of functions and funds has allowed concentration of powers with the states and thereby restraining the elective representatives who are more aware and sensitive to the ground level issues to take control.\n\nLocal institutions have been able to strengthen democracy at the root level. But as the institutions have evolved, new challenges have emerged. Their rectification will require raising awareness among masses and their representatives, clear demarcation of responsibility and a system of accountability.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_2_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**16. “The incidence and intensity of poverty are more important in determining poverty based on income alone”. In this context analyse the latest United Nations Multidimensional Poverty Index Report.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "According to the World Bank, Poverty is pronounced deprivation in well-being, and comprises many dimensions. It includeslow incomes and the inability to acquire the basic goods and services necessary forsurvival with dignity.\n\nA common method used to estimate poverty is based on the income or consumption levels and if the income falls below a given level, then the household is said to be poor. According to the World Bank population living under $1 income/day is considered poor. Similarly in India, as per the Rangarajan committee (2014), the poverty line is estimated as Monthly Per Capita Expenditure of 1407 Rs. in urban areas and 972 Rs. in rural areas.\n\nBased on income, incidence of poverty is measured by the poverty ratio, which is the ratio of the number of poorto the total population. Butthe extent of poverty is not equal among the poors. Intensity of poverty estimates the depth of poverty by considering how far, on average, the poor are from that poverty line.\n\nHowever, these income based estimates, offer a quantity based assessment by simply counting the poor below the poverty line, and remain limited at the qualitative level.\n\n**UN’s Multidimensional Poverty Index (MPI)**\n\n* MPI is based on the idea that poverty not just depends on income and an individual may lack several basic needs like education, health, etc.\n* The UN’s MPI presents quantitative as well as qualitative aspects of poverty. It uses three dimensions viz., Education, Health and living standard and gives score between 0-1.\n* According to MPI report 2020, around 1.3 billion people are still living in multidimensional poverty.\n* In 2019, the burden of multidimensional poverty disproportionately falls on children-half of multidimensionally poor were below 18.\n* India was ranked 62nd among 107 countries with an MPI score of 0.123 with 27.9% head count.\n* In 2019, around 19.3% of Indian population is vulnerable to multidimensional poverty.\n* The report mentions that India lifted as many as 270 million people out of multidimensional poverty between 2005-06 and 2015-16.\n* MPI also reflects that COVID-19 is having a profound impact on the development landscape.\n\nThe MPI methodology shows aspects in which the poor are deprived and helps to reveal inter connections among those deprivations. Thus enabling policymakers to target resources and design policies more effectively. The MPI methodology can be, and often is, modified to generate national measures of Multidimensional Poverty that reflect local cultural, economic, climatic and other factors.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_3_Q15",
      "serial_no": "15",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**15. COVID-19 pandemic has caused unprecedented devastation worldwide. However, technological advancements are being availed readily to win over the crisis. Give an account of how technology was sought to aid management of the pandemic.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "The lockdown imposed worldwide during COVID-19 pandemic brought almost all the world to standstill. It impacted our lives, both personal and professional. However, the advancement in technology helped to manage almost all kinds of stuff even during this pandemic.\n\n**Ways in which technology helped during COVID-19 pandemic**\n\n* **Enabling Distance Learning Features for students**: Since educational institutions remained shut during the pandemic, there was a major concern on delivery of education. But the online platforms like websites, YouTube and mobile applications helped students and teachers to interact and ensure education is not interrupted even during this pandemic.\n* **Online Entertainment**: Entertainment is considered very necessary to remove stress. During pandemic, since individuals cannot move out freely for entertainment, therefore, online platforms acted as a major boost for their entertainment. With theatres remaining shut, Over the Top (OTT) platforms such as Amazon Prime Video, Hotstar, Netflix, etc. helped both producers and consumers to run the entertainment industry.\n* **Contactless Delivery of Essentials**: Online shopping which was earlier predominant in urban areas became very common even in rural areas during this pandemic. Easy searching of items on the web, placing of order with ease and timely delivery at doorstep have built consumer confidence in online shopping. Thus, technology ensured delivery of essentials like medicines, electronic items, grocery, etc. via contactless mode during this pandemic.\n* **Robotics**: Doctors and nurses were also feared of getting infected with corona during medical diagnosis or performing normal procedures. Robots have eased their work by cleaning infected areas and by delivering food to quarantined individuals.\n* **Work from Home (WFH) Facility**: The work from home option available to employees has ensured smooth running of business activities. 4G technology, smart phones, better Internet, data privacy security, virtual meetings, cloud conferencing, etc. have assisted professionals in adopting work from the home scenario with ease.\n* The Access to COVID-19 Tools (**ACT**) **Accelerator** is a pioneering international teamwork to fast-track development, production, and equitable access to COVID-19 tests, treatments, and vaccines.\n* ‘**Aarogya Setu**’, a mobile app utilizing Bluetooth technology, algorithms and artificial intelligence, was developed to bring the people of India together in a determined fight against COVID-19.\n* **Co-WIN** or the COVID-19 Vaccine Intelligence Network, which is an extension of electronic Vaccine Intelligence Network (eVIN), is a digitalized tech platform for effectively rolling out and scaling up of the COVID Vaccine Distribution System mechanism at national level to reduce wastage and make the most effective use of vaccine supply and cold chain network.\n* AI enabled **MyGov Corona Helpdesk** helped improve our outreach and engagement during the pandemic and made a marked difference to society.\n* The Centre for Augmenting War with COVID-19 Health Crisis (**CAWACH**) encouraged Bangalore based start-up to bring out a mobile app for detection of possible infection in an asymptomatic individual and risk assessment of COVID 19 infected individuals, called Lyfas COVID score.\n\nThus, we notice that during the COVID-19 period technology innovations helped in tackling the epidemic in a timely and systematic manner. Technology will not only ease one’s life but also generate new opportunities for society and also prove a cornerstone to deal with such pandemics, if any, in near future.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_4_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**5. What are the main factors responsible for gender inequality in India? Discuss the contribution of Savitribai Phule in this regard.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Gender inequality refers to the unequal treatment or perceptions of individuals based on their gender. It arises from differences in socially constructed gender roles. It is women who have always been at the receiving end.\n\nGender inequality in contemporary India is the result of multiple factors which can be broadly classified as Cultural, Historical, Social, and Economic.\n\n* **Cultural**: India has a long evil tradition of favouring boy child over a girl. Several ancient scriptures like Manusmriti justified the preference of boys over girls. It led to a rise in evil practices like femicide which is still prevalent.\n* **Historical**: Frequent invasion of India from the ancient times pushed women downward in the social rank. During the medieval times, “veil” culture came in vogue confining women to walls of the house.\n* **Social**: The culmination of cultural and historical factors has a long term effect on the mindset of the society. In Indian society, females are being considered as a secondary gender. It stigmatised women and they were regarded as mentally and physically weak.\n\n* Women were not allowed to study and get an education.\n* Speaking of women in public is still considered a taboo.\n* The chastity and purity of women are considered as a matter of dignity and honour.\n\n* **Economic**: The inadequate economic growth and widespread poverty has always prevented women from breaking social barriers. They were not allowed to work and left dependent on their male counterpart and nothing empowers a woman more than her financial independence.\n\nSavitri Bai Phule was the social reformer of the 19th century who worked in the field of women empowerment. To understand the gravity of her contribution, It is important to know the milieu in which the young Savitri grew up. Public education was yet to emerge and there were only a few missionary schools which were “open to all”. Brahmins were the only caste group that received an education and could take a lead in setting up schools.\n\n* In 1848, she with her husband Jyotirao Phule started their school at Bhide Wada (Maharashtra). It was India’s first girls’ school.\n* She also initiated two educational trusts – **The Native Female School**, Pune and **The Society for Promoting the Education of Mahars, Mangs and Etceteras** – which came to have many schools under them.\n* In 1852, Savitribai started the **Mahila Seva Mandal** to raise awareness about women’s rights.\n* She published **Kavya Phule** (1854) and **Bavan Kashi Subodh Ratnakar** in 1892. In her poem, **Go, Get Education**, she urges the oppressed communities to get an education and break free from the chains of oppression.\n* The Phule couple started a home for the prevention of infanticide in their own house, for the safety of pregnant, exploited Brahman widows and to nurture their children.\n* In 1890 when Jyaotirao passed away. Defying all social norms, she lit his funeral pyre.\n* She initiated the first **Satyashodhak marriage** – a marriage without a dowry, Brahmin priests or Brahmanical rituals in 1873.\n\nSavitribai was always at the vanguard of women social reforms. Her achievements were diverse and numerous, but they had a singular effect – posing a brave and pioneering challenge to the caste system and patriarchy.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_1_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**19. What is Cryptocurrency? How does it affect global society? Has it been affecting Indian society also?**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "A cryptocurrency is a digital currency designed to work as a medium of exchange through a computer network that is not reliant on any central authority, such as a government or bank, to uphold or maintain it. It is a digital or virtual currency that is secured by cryptography, which makes it nearly impossible to counterfeit or double-spend.\n\n**Cryptocurrency affects society in following ways:**\n\n* Bringing the next level of globalisation as the cryptocurrency is digital currency and easily available across the international borders.\n* Emergence of one currency for the countries of the world which are decentralised and not related to any country. This may make fiat money redundant in the future.\n* Cryptocurrencies are way cheaper to use to execute international transactions making transactions faster and accurate, there are less chances of fraud. It has made it easier for entrepreneurs to reach international markets.\n* However, it takes away the sovereign power of issuing currency. Thus, making economic policy of the government ineffective. It also makes capital more volatile posing risk to macroeconomic stability.\n* Use of cryptocurrency by terrorist organisations, drug cartels etc. negatively impacts the global society and the anonymity of its use has potential to increase crime.\n\nIndia is the largest receiver of remittances. However, people lose money on conversion, processing charges, and switching to crypto will help people to get rid of these expenses. But in the era of digital currency, those who are not able to afford technology are devoid of such digital currency. In 2018, The RBI issued a circular preventing all banks from dealing in cryptocurrencies. This circular was declared unconstitutional by the Supreme Court in May 2020. Recently, the government has announced to introduce a bill to create a sovereign digital currency and simultaneously ban all private cryptocurrencies.\n\nBlockchain and crypto assets will be an integral part of the Fourth Industrial Revolution, Indians should not be made to simply bypass it. The framework on cryptocurrencies should be developed which will require global partnerships and collective strategies.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_4_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**5. “Refugees should not be turned back to the country where they would face persecution or human right violation”. Examine the statement with reference to ethical dimension being violated by the nation claiming to be democratic with open society.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "The United Nations defines ‘refugee’ as a person who owing to well-founded fear of being persecuted for reasons of race, religion, nationality, membership of a particular social group or political opinion, is outside the country of his nationality and is unable or unwilling to avail himself of the protection of that country.  \nUnder international human rights law, the principle of non-refoulement guarantees that no one should be returned to a country where he/she would face torture, cruel, inhuman or degrading treatment or punishment and other irreparable harm. This principle applies to all migrants at all times, irrespective of migration status.  \nHuman rights are undeniable rights to life, liberty and opportunity to realise one’s potential. Turning back the refugees violates their basic human rights. Most refugees suffer without any fault of their own. It goes against all ethical principles to deny them opportunity to escape violence and persecution.  \nCountries often do not provide refuge for reasons of limited resources, security threats and primary responsibility towards their citizens. However, with this, they violate their responsibility as members of the global community. Besides, many refugee crises are the products of the western world. They should take historical responsibility for their actions.  \nIt sets wrong example for future in dehumanising refugees and refusal to recognise their suffering. Subsequently, this leads to decline in values like care, empathy and compassion in the society.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**10. Given the diversities among tribal communities in India, in which specific contexts should they be considered as a single category?**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "* Government of India Act 1935 included members of the community living or dependent on the forest, in a single category called Scheduled Tribe (STs).\n* The tribals in India have a very broad diversity ranging from matriarchal khasis of the Meghalaya and patriarchal tribes of the Rajasthan and Gujrat. They also differ on the basis of the origin like African origin Siddis of Gujarat and indigenous tribes of Andaman and Nicobar like sentinels.\n* Apart from the constitutional and legal provisions to include STs in a single category, there are several socio-economic grounds which binds them in a single category. Like:\n  + They are usually geographically isolated.\n  + They follow similar religious practices like tattoo, amulets, and Jewlery and belief in magic.\n  + Usually, they worship their common ancestors and nature worship is common among them.\n  + They are mostly dependent on the forest for their livelihood and have unanimity with nature for a well-balanced environment.\n  + Their social structure is less stratified compared to caste and have egalitarian structure.\n  + They have an animistic belief system.\n  + Most of them are territorial groups and dedicated to their own tribe and culture.\n  + Most of them are practicing primitive occupations like shifting cultivation, etc.\n  + They have most indigenous political organization i.e., the council of the elders like sabhas and samitis of the vedic period.\n  + Their society is usually self-reliant and self-sufficient.\n  + Most of them are different from mainstream society.\n* Dr. Ambedkar had also advocated their distinct socio-religious and cultural practice and demanded to include them in a separate, single and distinct category.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_1_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**18. Analyse the salience of ‘sect’ in Indian society vis-a-vis caste, region and religion.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Sects and Cults are a **smaller group of faith that follows either a traditional religion** or has its fundamentals in a different religion.\n\nSects are **subgroups from a single faith or religion**, such as Christianity, Hinduism, Islam, Buddhism, and others.\n\nSects can also **refer to religious groups that have separated themselves** from an established religion and now follow their own rules.\n\nOn the other hand, a cult is a social group that follows unusual religious, philosophical, spiritual beliefs to attain a common interest or goal in life.\n\n#### **Salience of ‘sect’ vis-a-vis Caste:**\n\nSects encourages its members to work for a common vision of brotherhood, equality and goals. Sects frequently form when society is undergoing rapid transformation.\n\nOwing to the rising socio-economic status of the sub-caste in India, they are asserting their dominance in political and socio sectors. E.g. Gujjjar, Jats, Patidhar etc.\n\nEven though the position of sub-sectors have improved, yet the practice of homogeneity, culture are still prevailing which cannot be said to be modernizing.\n\n#### **Salience of ‘sect’ vis-a-vis Region:**\n\nSects also emerges from geographic aspects e.g. hill tribes like gaddis are nomadic in their practice, also, the shiekh are Muslim Community found in the north Indian states. There are four main sections in Shaikh e.g. siddiqi, farooq, usmani, abbasi.\n\nVarious sects emerged in Maharashtra due to experience of inequality in the observance of religion on the part of various sections of the society, invasion of Muslims and the political predominance acquired by the Muslim rulers over Hindu society.\n\n#### **Salience of ‘sect’ vis-a-vis Religion:**\n\nHinduism is divided into **four major denominations:** Va ishnavism, Shaivism, Smartism and Shaktism. The denominations differ primarily in the god worshipped as the Supreme One and in the traditions that accompany worship of that god.\n\nMuslims are divided into several sects based on their understanding of Islamic law (fiqh) and Islamic history. On the basis of sect, Muslims are divided into two parts- Sunni and Shia.\n\nBuddhism was divided into two sects namely Mahayana and Hinayana.\n\nChristians are divided into two sects - the Catholics and the Protestants. The former may be considered as the traditionalists and the latter the reformists. The two are divided mainly on the question of the authority of the Church.\n\nIndian society is the result of a journey from the Indus civilization to today’s globalized world.\n\nIn this journey, it has gone through many transformations under the influence of the outside world and reform movements within society. However, what is unique and appreciable is the fact that it has managed to adopt and accept various features while preserving its past.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_3_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**20. Naxalism is a social, economic and developmental issue manifesting as a violent internal security threat. In this context, discuss the emerging issues and suggest a multilayered strategy to tackle the menace of Naxalism.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "Naxalism is considered as the biggest security threat to the country. The term Naxalism derives its name from the village Naxalbari of West Bengal. The Naxal Movement started in 1967 under the leadership of Kanu Sanyal and Jagan Santhal as a rebellion against the local landlords over a land dispute. The movement was spread across the eastern Indian and in less developed states like Odisha, Chhattisgarh, and Andhra Pradesh.\n\n**Emerging Issues**\n\n* The Forest (Conservation) Act, 1980 deprives tribal to depend upon forests produces and there is a massive displacement of tribal population due to developmental and mining projects.\n* The administration fails to provide essential services to the people of Naxalite affected regions such as education, freedom, sanitation, and food. There is a confusion over tackling Naxalism as a social issue or as a security threat.\n* Some villages suffer with infrastructural problems such as communication and connectivity. There is absence of technical intelligence to fight with Naxalites.\n* Lack of political participation by the tribal community and the inability of political authority to provide avenues for structural uplift to the deprived sections.\n\n**Strategy to Tackle the Menace of Naxalism**\n\n**Social Dimensions**\n\n* Aspirational District Programme deals with Left Wing Extremism (LWE) in a holistic manner for ensuring rights and entitlements of local communities and improvement in governance and management.\n* Security Related Expenditure (SRE) Scheme is implemented by the Central Government to reimburses needs of security forces like ex-gratia payment to the family of civilians/security forces killed/injured in LWE violence, compensation to Left Wing Extremist cadres who surrendered in accordance with the surrender and rehabilitation policy.\n* The government should initiate more dialogues between the Naxalites and the government officials. Equal participation in casting votes and contesting elections can make the conditions better.\n* Providing access to the basic resources such as forests, education, sanitation, and food. There is a need to emphasis on rehabilitation and resettlement of the affected population.\n\n**Economic Dimensions**\n\n* Removing economic disparity could contribute to tackle the growth of Naxalism.\n* Generation of more employment with higher wages will help the people of that region in uplifting their skills.\n* There is a need of coherent national strategy to be implemented by Central Government to end Naxalism.\n\n**Developmental Dimensions**\n\n* Road Connectivity Project for LWE affected areas (RCPLWE) is implemented for further improving road connectivity in LWE affected States.\n* LWE Mobile Tower Project is implemented to improve mobile connectivity in the LWE areas.\n* The concern of infrastructure needs to be addressed in the Naxalite affected regions.\n\nIndia has made little success tackling Naxalism, but the root causes have not been addressed yet. The central and the State Governments should continue to work together and come up with common strategy.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q11",
      "serial_no": "11",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**11. What are the main features of Vedic society and religion? Do you think some of the features are still prevailing in Indian society?**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "The **Vedic period**, spanning from approximately **1500 BCE to 600 BCE**, stands as a significant milestone in the annals of Indian history. It influenced India’s society and religion.\n\nSome major features were:\n\n* **Ritual Sacrifices (Yajnas):** Rituals with mantras for deities and benefits.\n* **Varna System:** Roles in society based on **skills and aptitude**, later becoming the caste system.\n* **Concept of Dharma:** Moral and ethical concept for different life stages and roles.\n* **Philosophical Texts (Upanishads):** Texts on concepts like the **self (Atman), the ultimate reality (Brahman), and the path to enlightenment (Moksha).**\n* **Concepts of Samsara and Karma:** Ideas of the cycle of **birth, death, and rebirth** and the law of cause and effect, first ritualistic, then spiritual.\n\nIn modern India, the Vedic legacy remains:\n\n* **Rituals and Festivals:** Vedic rituals, like **Diwali,** are part of culture and spirituality.\n* **Philosophy:** Vedic philosophy influenced schools of thought, like **Vedanta and Yoga. Satyamev Jayate** is from the Mundaka Upanishad.\n* **Natural Elements:** Reverence for natural elements and sacred rivers, like the **Ganges**, is ingrained in culture.\n* **Celebrations and Dance Forms:** Classical dance forms like **Bharatanatyam and Odissi** depict stories from Vedic texts.\n* **Ayurveda and Medicine: Ayurveda**, an ancient medicine system based on Vedic knowledge, is practiced in India.\n\nHowever, some factors have reduced Vedic traditions:\n\n* **Urbanization and Modernization**: It shifted priorities from traditional practices of agricultural and pastoral practices, which were **integral to Vedic society.**\n  + Technology, including the **internet and social media**, exposed people to a wider range of ideas.\n* Globalization: Exposure to **global cultures and ideas** led to more cosmopolitan lifestyles and worldviews.\n\nThe interplay between **ancient traditions and contemporary influences** shows India’s ability to adapt while preserving its heritage. This reflects its cultural richness and its capacity to evolve and embrace change.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q16",
      "serial_no": "16",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**16. Why did human development fail to keep pace with economic development in India?**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "The divergence between economic development and human development in India can be attributed to several complex and interconnected factors:\n\n* **Income Inequality:** Persistent income inequality in India disproportionately benefits the wealthy, hampering equitable access to healthcare, education, and basic services for a significant portion of the population.\n* **Education Disparities:** Despite economic growth, India faces education related challenges like high dropout rates, inadequate infrastructure, and poor quality, limiting human capital development and workforce participation.\n* **Healthcare Inequities**: Unequal healthcare access, especially in rural areas, contributes to high disease burdens and child mortality rates, impacting human development indicators, compounded by limited access to clean water and sanitation.\n* **Gender Disparities:** Gender inequality in India restricts women's access to education, healthcare, and economic opportunities, while gender-based violence and discrimination further hinder their development.\n* **Social Exclusion**: India's caste system and social hierarchies historically marginalize communities, limiting their opportunities and affecting human development outcomes.\n* **Inadequate Social Safety Nets:** India's welfare programs often fall short in addressing the needs of vulnerable populations, offering limited protection against poverty and malnutrition.\n* **Environmental Degradation:** Unsustainable development and environmental degradation for economic growth have long-term consequences, with climate change, pollution, and resource depletion threatening well-being.\n* **Governance Challenges:** Weak governance, corruption, and inefficient bureaucracy can hinder the effective implementation of policies and programs.\n\nHowever, India has **achieved significant growth** over the years in social, economic, and political life and human development has also been catching up with the pace of economic development eg. in 1990, India's HDI score was 0.429, which increased to 0.633 by 2021.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_1_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**19. Why is caste identity in India both fluid and static?**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "The caste system in India is a system of **social stratification, social restriction** and a basis for affirmative action in India. It exhibits **both fluid and static elements** due to social ,economic and **historical** reasons .\n\n**Features of Indian caste system:**\n\n* **Caste is Innate:** Caste system in India is characterized by **absolute rigidity** and immobility. It is the caste that determines one’s status in life.\n* **Hierarchical Social Structure**: The caste structure of the society is hierarchy or system of **subordination** held together by the relations of superiority and inferiority.\n\n**Fluid aspect of Caste Identity:**\n\n* **Inter-caste Marriages:** In recent decades inter caste marriages have become more common particularly in **urban areas**.\n* **Urbanization and Migration**: Urbanization and migration to cities have created more **heterogeneous** and **cosmopolitan environments** overshadowing caste identities.\n* **Education and employment:** Legislation like the **Right to Education (RTE)** and **affirmative action** have ensured a better educational level, as exemplified by individuals like **President Ram Nath Kovind,** who rose to the highest office in the country despite coming from a Scheduled caste background.\n\n**Static aspect of Caste Identity:**\n\n* **Historical Roots:** Caste identity in India has historical roots dating back thousands of years, and it continues to persist in the **collective conscience** of the masses.\n* **Traditional Occupations:** In some rural areas , people still continue to follow **hereditary occupation** associated with caste.\n* **Caste Association:** Organisation based on caste still acts as a **pressure group.**\n\nThus caste in India is a **complex interplay** of fluid and static elements .To overcome caste barriers various **social awareness programmes** should be carried out along with the legislative and **constitutional measures.**",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**19. What are the internal security challenges being faced by India? Give out the role of Central Intelligence and Investigative Agencies tasked to counter such threats.**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "A sovereign nation's foremost responsibility is the safety of its citizens from external as well as internal challenges. Since independence, India has tackled various internal security challenges including insurgency, militancy and externally induced rebellions.\n\n**Internal security challenges for India**\n\n* **Separatist Movements:** Separatist feelings have been present ever since the birth of our nation and still continue to be a cause of misery for law and order. For example, Nagaland separatism, Kashmiri separatism etc.\n* **Communalism:** The contentions between the two major religious groups have often led to brewing of hatred and fights. This further fuels separatist tendencies. Hate among groups makes our citizens easy targets to be motivated for terrorist activities.\n* **Illegal Migration:** Over the years, illegal migration has led to a lot of associated problems such as demographic change and increased unemployment thereby straining the nation’s resources.\n* **Left-Wing Extremism:** It is noticed in the central and eastern parts of India and is marked by Marxism or Maoism as its political ideology. Socio-economic disparities and land alienation are the factors responsible for its emergence.\n\nVarious intelligence and investigative agencies work in India with different mandates of performing actions.\n\n* **National Investigation Agency (NIA):** It is the premier counter-terrorism law enforcement agency of India, investigating offences that affect the sovereignty, security and integrity of India.\n* **Narcotics Control Bureau (NCB):** It is the apex body to coordinate between various narcotics and drug law enforcement agencies. It works to prevent drug trafficking across India.\n* **Directorate of Revenue Intelligence (DRI):** This is the body dealing with intelligence of smuggling of contrabands and investigating cases related to it. It also looks to prevent proliferation of black money and money laundering.\n* **Intelligence Bureau (IB):** It is the apex intelligence body responsible for collecting information within the country and executing counter-terrorism operations. It deals with matters of domestic intelligence and internal security.\n* **Research and Analysis Wing (R&AW):** It took the operations of handling foreign intelligence from Intelligence Bureau. It now collects foreign intelligence, conducts counter-terrorism operations and advises Indian policymakers.\n* **Central Bureau of Investigation (CBI):** It is the premier investigating police agency made on the recommendation of the Santhanam Committee. It carries out investigation and also acts as the point of access for the Interpol.\n\nInternal security is imperative for the growth of a nation. Indian Intelligence and Investigative Agencies are the unsung heroes of our nation and have done a great deal in securing our lives.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q5. Why do large cities tend to attract more migrants than smaller towns? Discuss in the light of conditions in developing countries. (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "### Approach\n\n* **Define Migration and give few data.**\n* **Mention the factors that attract migrants to larger cities**\n* **Conclusion**\n\n### Introduction\n\nMigration is the movement of people from one place to another in pursuit of improved job opportunities and living conditions. According to the **Periodic Labour Force Survey**, rural-to-urban migration accounts for **18.9%** of total internal migration in India.\n\n### Body\n\n**Factors that Attract Migrants to Larger Cities**\n\n* **Infrastructure and Services:** Larger cities provide better infrastructure, including transportation, housing, and utilities, making them more appealing to migrants.\n* **Education and Healthcare:** Urban areas typically have better educational institutions and healthcare facilities, which attract families looking for improved services and quality of life.  \n  + For example, people from Bihar and Jharkhand migrate to states like **Delhi and Kolkata** in search of better education and healthcare opportunities.\n* **Economic Opportunities:** As compared to smaller towns, larger towns provide better work opportunities like higher wages, and diverse employment sectors compared to smaller towns.  \n  + In India, the **Migration Survey (2020-21) indicates** that about **22% of internal migrants** moved for economic reasons, from states like **Uttar Pradesh and Bihar to Maharashtra and West Bengal respectively.**\n* **Cultural and Social Amenities:** The availability of cultural, recreational, and social amenities in cities like the **internet and increased exposure** to social media enhances the overall living experience, making urban areas more attractive.\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_1_Q5_IMG_1.png)\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_1_Q5_IMG_2.png)\n\n### Conclusion\n\nThe sphere of influence in migration defines the geographical areas that supply migrants to specific destinations. Recognizing these spheres enables policymakers to tackle migration challenges and create more balanced regional strategies.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q7",
      "serial_no": "7",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q.7 What is the concept of a 'demographic winter'? Is the world moving towards such a situation? Elaborate. (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "### Approach:\n\n* Begin by defining demographic winter.\n* Explain the concept of demographic winter, highlighting its causes.\n* Conclude by summarizing its incidence and a brief on how to address it.\n\n### Introduction\n\nThe term \"Demographic Winter\" refers to a significant decrease in birth rates, accompanied by an aging population with a dwindling working-age population. This trend is observed in many nations.\n\n### Body:\n\n**Causes of Demographic Winter**\n\n* **Low Fertility Rates:** The global fertility rate has declined from about 5 children per woman in 1960 to approximately 2.3 in 2021.\n  + Fertility rates of many developed countries have gone below the replacement level (2.1).\n  + Countries like Japan (1.26), South Korea (0.78), and Italy (1.24) have some of the lowest fertility rates in the world.\n* **Aging Population:** By 2020, around 9% of the global population was aged 65 or older, projected to rise to about 16% by 2050.\n  + In Europe, more than 20% of the population is already over 65.\n* **Changing Family Structures:** Societal shifts, including delayed marriage and childbearing, as well as a rise in single-person households, contribute to lower birth rates.\n* **Economic Pressures:** High living costs, housing prices, and job insecurity discourage families from having more children.\n\n### Conclusion\n\nDemographic Winter in developed regions requires comprehensive policies on family support, workforce participation, and increased immigration to sustain economic growth and social systems.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q8",
      "serial_no": "8",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q.8 Distinguish between gender equality, gender equity and women's empowerment. Why is it important to take gender concerns into account in programme design and implementation? (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "### Approach:\n\n* Begin by giving a brief of the connection between these terms.\n* Explain the concepts in detail and move on to explaining how gender specific concerns can improve programme designs.\n* Conclude by summarizing the importance of these concepts and how they must be considered while creating and implementing a programme.\n\n### Introduction\n\nGender issues are critical to achieving social justice and sustainable development. With India ranking 108 (out of 198 countries) on the Gender Inequality Index (GII) 2022, there is a long path ahead for us.\n\n### Body\n\n**The Difference**\n\n|  |  |  |\n| --- | --- | --- |\n| **Concept** | **Definition** | **Focus** |\n| **Gender Equality** | All individuals have equal rights, responsibilities, and opportunities. | Equal access to resources and treatment. |\n| **Gender Equity** | Acknowledges distinct needs and challenges of different genders. | Fair treatment and tailored opportunities for equal outcomes. |\n| **Women's Empowerment** | Seeks to enhance women’s strength in various areas. | Control over their lives through confidence and resources. |\n\n**Accounting for Gender in Programme Design and Implementation**\n\n* **Equity**: Gender specific programmes ensure equity in resource dispersal and development of society.\n* **Tailored Solutions**: Designing programmes while considering gender differences ensures that solutions are not ‘one size fits all’, but rather catering to niche groups.\n* **Less Wastage/ Focused Delivery of Funds**: Gender specific programmes can ensure funds are used for catering to specific purposes that they are needed in.\n* **Ensuring Long Term Growth**: Investing on females specifically has shown to contribute more to the society at large as per World Bank data.\n\n### Conclusion\n\nThese three concepts of equality, equity, and women's empowerment are foundational to creating inclusive programs. Incorporating gender concerns into program design not just ensures fairness but also enhances effectiveness and sustainability of initiatives.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q12",
      "serial_no": "12",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q.12 How far is it correct to say that the First World War was fought essentially for the preservation of balance of power? (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "### Approach:\n\n* Start the answer by briefly talking about the First World War.\n* Give the causes of First World War with a focus on ‘preservation of balance of power’ as a cause and other factors as well.\n* Conclude Suitably.\n\n### Introduction:\n\n**World War I (WW I), lasted from July 1914 to November 1918,** was fought between the Allied Powers and the Central Powers. While it is often argued that the war was fought to preserve the balance of power in Europe, this perspective only partially explains the complex conditions that led to the conflict.\n\n### Body:\n\n**Balance of Power as a Cause:**\n\n* **European Alliances:** Aiming at counterbalancing the power of each other.\n  + **Triple Entente:** Comprised of France, Russia, and the United Kingdom.\n  + **Triple Alliance:** Consisted of Germany, Austria-Hungary, and Italy which sought to maintain their dominance in Europe.\n* **Changing Power Dynamics:**\n  + **Germany’s Rise:** Germany’s rapid industrialization and military expansion was seen as a threat by the other powers.\n    - After war, **winner punished and weaken Germans both financially and territorially and strengthened its weak rival France.**\n  + **Decline of Empires:** Creation of power vacuums and instability due to the weakening of the Ottoman and Austro-Hungarian Empires.\n\n**Other Factors:**\n\n* Competitive Imperialism: Before WWI, Africa and parts of Asia were points of contention among the European countries because of their raw materials.\n  + The increasing **competition for the market (Africa) and desire for greater empires** led to an increase in the confrontation that helped push the world into World War I.\n* **Military mobilisation as a strength of nation:** By 1914, Great Britain and Germany both greatly increased their military buildup and navies.\n  + This rise in militarism promoted the idea of mass mobilization as a nation's strength, leading countries into war. Example: **German mass mobilisation towards the Russian border provoked Russia against Germany.**\n* **Nationalism:** The rise of nationalist sentiments **(race/ethnicity as the basis of the nation) across Europe fueled tensions and territorial disputes.** Example: The desire of the Slavic peoples in Bosnia and Herzegovina to be part of Serbia instead of Austria-Hungary.\n\n### Conclusion:\n\nWhile the preservation of the balance of power was a significant factor in the outbreak of the First World War, it was not the sole cause. Nationalism, imperialism, economic rivalry, and domestic pressures also played crucial roles.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_1_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**Q.18 Despite comprehensive policies for equity and social justice, underprivileged sections are not yet getting the full benefits of affirmative actions envisaged by the constitution. Comment. (Answer in 250 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "SocialIssues"
    },
    "solution": {
      "explanation": "### Approach\n\n* Define affirmative action and its significance.\n* Discuss the existing affirmative policies in India.\n* Highlight the key challenges for its effective implementation.\n* Suggest measures to improve the effectiveness of affirmative action.\n* Conclude Suitably.\n\n### Introduction\n\nAffirmative action refers to a set of policies and practices aimed at increasing the representation and opportunities of historically marginalized and disadvantaged groups in various sectors, including education, employment, and politics.\n\n### Body\n\n**Existing Affirmative Action Policies in India**\n\n* **Political Representation:**\n  + **Articles 330, 332**, and **243D** reserve seats for SCs and STs in Parliament, State Assemblies, and Panchayats, respectively.\n* **Education and Employment Opportunities:**\n  + **Articles 15(4)** and **16(4)** allow reservations in government jobs for disadvantaged groups.\n  + The **Right to Education Act, of 2009** ensures free, compulsory education for children aged 6 to 14, reducing barriers for underprivileged sections.\n* **Holistic Development:**\n  + **The National Food Security Act (NFSA)** ensures access to subsidized food grains for vulnerable populations.\n  + **Pradhan Mantri Awas Yojana** provides affordable housing for urban and rural poor\n  + **Skill India Mission** enhances the employability of youth from disadvantaged backgrounds.\n\n**Key Challenges**\n\n* **Elite Capture:** Dominance of wealthy individuals in reserved categories limits benefits for the truly marginalized.\n* **Caste-Based Politics:** Politicization of reservations can cause conflicts and hinder implementation.\n* **Corruption:** Mismanagement and corruption divert benefits away from intended recipients.\n* **Awareness:** Lack of knowledge about reservation benefits leads to underutilization.\n* **Social Stigma:** Persistent biases hinder the integration of marginalized communities.\n* **Resistance:** Critics argue reservations compromise meritocracy, sparking backlash and social tensions.\n\n**Potential Reforms:**\n\n* Enforce penalties for non-compliance with reservation norms.\n* Introduce income criteria to benefit the economically disadvantaged.\n* States can sub-classify SCs within the 15% quota.\n* Launch awareness campaigns on inclusion and discrimination.\n* Consider socio-educational status for equitable distribution.\n* Include religious minorities, transgender individuals, and the disabled in affirmative action policies.\n\n### Conclusion\n\nThe affirmative action policy serves as a crucial tool for fostering a strong and inclusive society in India, but its effectiveness hinges on its ability to genuinely uplift the most marginalized sections of society.",
      "explanation_format": "markdown"
    }
  }
]