[
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_1_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**18. Present an account of the Indus Water Treaty and examine its ecological, economic and political implications in the context of changing bilateral relations.**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "Indus Water treaty was signed in 1960 by then Prime Minister Jawaharlal Nehru and then Pakistan President Ayub Khan, the treaty allocates 80% of water from the six-river Indus water system to Pakistan. India got control over the rivers Beas, Ravi and Sutlej whereas Pakistan got control over Indus, Chenab and Jhelum. India could use the water from Indus, Chenab and Jhelum for non consumptive purposes. A Permanent Indus Commission solves disputes arising over water sharing. The Treaty also provides arbitration mechanism to solve disputes amicably.\n\n**Its implications in changing bilateral relations**\n\n* About 65% area of Pakistan, including the entire Punjab province, is a part of the Indus basin. The water from Indus is important for the country for irrigation, drinking and other purposes. India’s decision to abrogate the treaty would affect Pakistan severely. Pakistan may face drought-like conditions.\n* To deter India from employing its water leverage, the anxiety of Chinese retaliation has been invented. The main Indus stream and the Sutlej, originated in Tibet and collect their main water in India.\n* India at present enjoys a moral high ground because it respects all its treaties with the neighbouring countries. The decision to abrogate the treaty would make other smaller neighbours uneasy.\n* The China may take similar actions in future in case of conflict. Indus originates in China and if the country decides to divert the Indus, India would lose over 35% of its river water.\n* The treaty has been brokered by World Bank. Abrogating the treaty may lead to Pakistan taking India to international dispute settlement agencies.\n* It would affect India’s chances of diplomatically isolating Pakistan.\n* India may face environmental challenges if it decides to scrap the treaty and starts building dams etc. Since river flows through earthquake prone region.\n\nHence, before taking a decision on such an important international treaty with huge diplomatic, environmental and security repercu-ssions, India should weigh in all pros of cons and take a practical view.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2016_PAPER_2_Q18",
      "serial_no": "18",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2016",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**18. Evaluate the economic and strategic dimensions of India’s Look East Policy in the context of the post Cold War international scenario. (2016)**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "India started following the ‘Look East Policy’ in the early 1990s when at the end of the cold war it sensed a change in the locus of world economic power from ‘west’ to the ‘east’. It focused on strengthening ties between India and the ASEAN countries by increasing economic and commercial ties. Over the years, it also focused on strategic and security aspects in the East and South East Asia region. Eg: South China Sea.\n\nUnder the strategic thrust of this policy, India firmed up strategic relations with the countries of ASEAN and East Asia through extensive consultations on regional and global security issues and consistent cooperation in defence sector. India’s strategic vision for the East extends to the whole of Asia-Pacific region as India has manifested both its willingness and capability to play a critical role in the emerging strategic dynamics and architecture for this region.\n\nThe Free Trade Agreement (FTA) between ASEAN and India has helped in deeper economic integration. ASEAN is India's fourth largest trading partner. Further, RCEP and FTA for Investments and Services will bolster economic engagements between the two. With the economies of India and the ASEAN growing and their energy needs going up, maritime security and enhanced cooperation in combating terrorism and piracy also become concern areas.\n\nIndia further bolstered its Look East Policy with the announcement of the ‘Act East Policy’ in 2014, through which it seeks to revive and reinvigorate its relationship with ASEAN and expand beyond the region to encompass Koreas, Australia, New Zealand, Bangladesh as well as countries in the Far East. Now, instead of merely ‘looking’, India is ‘engaging’ and ‘acting’ with East.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_2_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**9. ‘China is using its economic relations and positive trade surplus as tools to develop potential military power status in Asia’. In the light of this statement, discuss its impact on India as her neighbour. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "China has emerged both as an economic and a military powerhouse. It has a trade surplus with most of the countries in Asia including India. China’s economic initiatives like One Belt One Road (OBOR) and Maritime Silk Road (MSR), though promoted primarily as economic initiatives have strategic undertone.\n\n**Possible impact of China’s rise on India are–**\n\n* China could emerge as a direct military threat to India as has been seen in the recent Doklam standoff and other border disputes.\n* In face of rising assertion in the international affairs, China could hamper India’s interest in multilateral forums like UNSC and those initiated by Beijing like Asian Infrastructure Investment Bank.\n* Growing economic cooperation between China and Pakistan could be seen as a policy to contain India. This is evident from China Pakistan Economic Corridor (CPEC) which has potential to emerge as a threat to India.\n* China’s deepening relation with South Asian countries, where China is involved in infrastructure building, poses significant challenge to India’s position in the region. At present China has more say in this region where India had strong hold in the past.\n\nChina’s rising economic influence in Asia will allow Beijing to spread its influence in the entire region, which could be used to India’s detriment. In face of these challenges, India’s policy response must focus on building indigenous military power and forging regional cooperation at the same time.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2017_PAPER_2_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2017",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**19. The question of India’s Energy Security Constitutes the most important part of India’s economic progress. Analyse India’s energy policy cooperation with West Asian countries. (2017)**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "Indian economy is one of the fastest growing major economy in the world. To sustain the high economic growth of around 8% in the coming decades, energy security is of paramount importance to India. Despite India’s efforts to develop its domestic energy capacity, it is dependent on imports for 80% of its oil needs, of which roughly 55% is sourced from the Persian Gulf region and more than 80% of gas supplies. This highlights the need for energy policy cooperation with the resource rich West Asian countries. Consequently, India has adopted a ‘Look West’ or ‘Link West’ policy in this regard.\n\nSaudi Arabia is India’s second largest source of oil. Iraq is also a major source of Indian energy imports. Further, the energy imports from Iran picked up in the recent past after the easing of sanctions by US. India has also enhanced its bilateral engagement with countries like Oman and UAE and also at institutional level with GCC (Gulf Cooperation Council).\n\nThough countries such as Saudi Arabia, Kuwait, Iran, Iraq and Qatar will continue to be its major suppliers of oil and gas, India is trying to walk the diplomatic tight rope in West Asia by partnering with Israel in its Leviathan natural gas filed in the East Mediterranean Sea.\n\nIndia’s energy relation with West Asian countries are intricately related with the Central Asian countries. Thus India has developed Chabahar port in Iran to access the Central Asian energy market. Besides energy infrastructure projects like TAPI gas pipeline and International North South Corridor will have ripple effects on the India’s energy engagements with the West Asian Nations.\n\nIndia’s energy policy engagement with the West Asian region is also related to providing maritime security in the region as most of the shipping vessels pass through Persian Gulf and Indian Ocean. Other major powers like China have increased its footprint in the region. Thus India must also take stock of this geopolitical game in order to secure its own energy security.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_2_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**6. “Policy Contradictions among various competing sectors and stakeholders have resulted in inadequate ‘protection and prevention of degradation’ to environment.” Comment with relevant illustrations. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "Public Policy involves balancing the interest of various competing stakeholders and sectors. This at times leads to policy contradiction among various sectors and stake holders causing inadequate ‘protection and prevention of degradation’ to environment.\n\nFollowing illustrations clearly illustrate this:\n\n1. **Sardar Sarovar Project -** While farmers in arid areas of Gujarat and Rajasthan as well as the industrial sector welcomed this project, there was strong resistance from the tribals who were displaced and were critical of the inadequate rehabilitation process. This project has been criticised for environmental damage like loss of forests and terrestrial biological diversity – thus displaying the contradictions between two imperatives of environmental protections and developmental needs.\n2. **In Ken Betwa link project -** This project is immensely beneficial meeting the irrigation and drinking water need of the Bundhelkahnd region. However, project is criticised due to its adverse impact on the ecology of both the rivers and damaging biodiversity - by submerging parts of Panna National Park.\n3. **Bt cotton -** The seed manufacturer, Monsanto, wants to enhance its revenue by increasing the area under cultivation of BT Cotton crop. Similarly, farmers also prefer to use these seeds for increasing production and hence their income. There is also arguement that GM crops can fulfil India’s nutritional needs. However there are various reported environmental consequences of Genetically Modified (GM) crop – such as possibility of emergence of super pest; super weeds as well as potential health hazards of GM crops.\n\nGiven the above examples, various sectors and their stake holders need to work in coordination - keeping in mind the developmental and environmental issues for present as well as future generations.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_2_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**9. “India’s relations with Israel have, of late, acquired a depth and diversity, which cannot be rolled back.” Discuss. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "The diplomatic relations between India and Israel were established in 1992. Since then especially during Kargil war when Israel’s MOSSAD helped India’s RAW by providing critical intelligence inputs, relations between both countries have gained strength both in depth and diversity.\n\n* During the Indian Prime Minister 25 visit to Israel last year, both countries signed many important agreements such as setting up of India-Israel Technological Innovation Fund, cooperation in space technology, Water Conservation in India, Three Year Work Program in Agriculture 2018-2020 etc.\n* The rise of Islamic extremist terrorism brought together both the countries against the global threat of terrorism.\n* Barak 8 is jointly developed by Israel Aerospace Industries (IAI) and India's Defence Research & Development Organisation (DRDO) which is capable of protecting sea vessels and ground facilities from aircraft and cruise missiles.\n* India is the Israel's seventh largest trading partner and number three arms supplier.\n* Reasons for Israel’s affinity towards India are -Ideological Compatibility, Economic Partnership, National security and counter-terrorism, Cultural and People to People Ties.\n\nIndia’s evolving ties with Israel are based on pragmatism and emerging global scenario and the mutual dependency and trust have move to that extent from where it cannot be roll back. However, based on the value of democracy, secularism and human rights, India has generally conducted its Israel policy with careful attention to the sensitivities of Palestinians and advocated for peaceful and democratic resolution of Palestine issue.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_2_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**10. A number of outside powers have entrenched themselves in Central Asia, which is a zone of interest to India. Discuss the implications, in this context, of India’s joining the Ashgabat Agreement, 2018. (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "In a quest for global supremacy, Central Asia has become a part of the ‘New Great Game’ between regional and world powers. Being rich in energy and mineral resources, it acts as transit corridor for regional and global trade. Also control over Central Asian hinterland provides strategic supremacy over peripheral regions such as Persian Gulf.\n\nAs a result, major powers like US have military bases in region while China through Belt and Road Initiative is building connectivity projects to Europe through the region. But India also has huge stake in the region as it is important for India’s ambition as regional power, securing energy and trade transit needs. Its importance is evident from India’s joining the Ashgabat Agreement.\n\n**Joining Ashgabat Agreement will:**\n\n* Enable India to utilize the existing transport and transit corridor to facilitate trade and commercial interactions with the Eurasian region through better integration with Eurasian Economic Union and Shanghai Cooperation Organization.\n* Increase scope of Chabahar to become a vital gateway and the shortest land route to Central Asia.\n* Provide access to high-value minerals of Central Asia.\n* Increase India’s trade with Central Asia which is currently over $1 billion - only 0.11% of Central Asia’s trade.\n* Sychronize the existing trade corridors with International North–South Transport Corridor (INSTC) – complimenting India’s efforts for enhanced regional connectivity and accessibility.\n\nTherefore, Ashgabat Agreement acts as a India‘s doorway to Central Asia - thereby providing accessibility for trade, energy security and strategic balance to global power politics.\n\n**Additional Information**\n\nAshgabat Agreement - A multimodal international agreement aiming at the establishment of Transport and Transit corridor between Uzbekistan, Turkmenistan, Oman and Iran and enhance connectivity within the Eurasian region.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2018_PAPER_2_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2018",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**19. What are the key areas of reform if the WTO has to survive in the present context of ‘Trade War’, especially keeping in mind the interest of India? (2018)**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "World Trade Organization (WTO) officially commenced in 1995 after replacing the General Agreement on Tariffs and Trade (GATT). WTO intends to supervise and liberalize international trade. But recent trade wars, initiated by USA with China, India and other countries, evoke the need of reform in WTO if it has to survive in the present context. The key areas of reforms are:\n\n* **Dispute Settlement System:** There are suggestions regarding bringing transparency, shortening of time frames, permanent panel body, special and differential treatment for developing countries etc. India can benefit from the reforms if proposals specific to developing countries are accepted\n* **Reducing Trade Costs:** Though WTO has come out with Trade Facilitation Agreement (TFA) in this regard, but it mainly addresses the trade of goods. India being a major service provider would benefit if reforms are carried out in trade facilitation of services. It is expected that there are considerable economic benefits from the better movement of people across borders.\n* **Modalities of Negotiations:** Some progress has been made, as the ‘single undertaking’ nature of negotiations is all but discarded. There are proposals to make them more flexible.\n\nIndia is one of the prominent members of WTO and is largely seen as leader of developing and under developed countries. More than 40% Indian economy is exposed to international trade. If we want to achieve a double-digit growth over a sustained period and create jobs, our external trade has to grow at more than 15% a year, which is not possible in an uncertain trading environment. Therefore, India should call upon all WTO members, including the US, to undertake a systemic reform in the above-stated crucial areas of the WTO’s functioning.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_1_Q1",
      "serial_no": "1",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "1",
      "paper_number": 1
    },
    "content": {
      "question_text": "**1. Highlight the Central Asian and Greco-Bactrian elements in Gandhara art.**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "Gandhara art is a style of Buddhist visual art that developed between the 1st century BCE and the 7th century CE in what is now northwestern Pakistan and eastern Afghanistan. The region came under the political influence of a variety of kingdoms which resulted in the emergence of a mixed school of art. The sculptural tradition in Gandhara had the confluence of Bactria, Parthia and the local Gandhara tradition. However, the real patrons of this school of art were the Scythians and the Kushanas, particularly Kanishka.\n\n**Features of Gandhara art borrowed from Greco-Bactria:**\n\n* The Gandhara school drew upon the anthropomorphic traditions of Roman religion and represented the Buddha with a **youthful Apollo-like face**, dressed in garments resembling those seen on Roman imperial statues. Its significance lies in the fact that until then **Buddha** was not **represented in a human-like figure**.\n* **Wavy hair in a top knot,** sometimes a moustache on the face, **urna** (a dot or third eye) between the eyebrows, **elongated earlobes**, garment with thick pleats usually covering both shoulders, and muscular formation of the body are other resembling features.\n* Other motifs and techniques that Gandhara school incorporated from classical Roman art, include vine scrolls, cherubs bearing garlands, tritons, and centaurs.\n* The images having physiognomic features depicting **symbolic expression** such as of calmness, sharp outlines, smooth surface, **expressive images** etc. are the centre point of attraction.\n\nGandhara art not only assimilated the features of Hellenistic art but also borrowed many West Asiatic and **Central Asiatic features** such as:\n\n* Disc-shaped attribute behind the head of Buddha was associated with solar deities of ancient Persian and Greek art.\n* Figures with conical and pointed caps on their heads resemble the Scythian caps of similar design.\n* The regular depiction of fire worship in the Gandhara art, a trait which was probably derived from Iranian sources.\n\nThe foreign elements imbibed in the Gandhara art not only placed it on a high pedestal of artistic achievements but also made possible the naturalistic depiction of the human form for the first time in the Indian art history.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2019_PAPER_2_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2019",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**20. “What introduces friction into the ties between India and the United States is that Washington is still unable to find for India a position in its global strategy, which would satisfy India’s National self-esteem** and ambitions” Explain with suitable examples.",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "In 2016, the United States designated India as ‘major defence partner’, a status unique to India. However, recently, the US foreign and economic policies have started to appear against India’s self-esteem and ambitions. There are several issues that introduce friction into what US considers its global strategy and what India envisages as its self-esteem and ambitions.\n\n* **West Asia:** The US’ West Asia policy is aligned in line with that of Israel and Saudi Arabia which stands adversarial to that of Iran. But for India, a strong, united and peaceful Iran holds significance not only for its oil imports but also for the Chabahar port and International North-South Transport Corridor (INTC) that will enable India to have a reach to Central Asia and counter China’s Belt and Road Initiative (BRI). However, this stands opposed to the US policy of restricting Iran’s influence in the region. The US has pulled out of the Joint Comprehensive Plan of Action (JCPOA) nuclear agreement and subsequently imposed sanctions under Countering America’s Adversaries Through Sanctions Act (CAATSA) on Iran.\n* **Afghanistan:** Political development in Kabul have always had its implications in New Delhi. Situation in Afghanistan also poses security risks for India given Pakistan’s close proximity to the Taliban. This is more so given India’s huge investments in Afghanistan to bring peace and stability there. But the US policy has moved to focus on its withdrawal of troops. Any peace deal with the Taliban, an insurgent body, will legitimise the terrorist activities and hurt India’s interests.\n* **Russia:** India’s strategic relations with Russia have historically been very significant and useful given Russia’s veto power at the Security Council. Russia is also the major defence partner of India. It is also emerging as a major option to meet India’s energy requirements. But, as bequeathed by the Cold War, the US considers Russia as its adversary and it has brought Russia under the CAATSA. This stood opposed to India’s defence deals with Russia involving the S-400 missile systems.\n* **Trade relations:** Being a developing country, India wants to bring millions of its masses out of poverty and to have a strong economic footprint globally. The US is a major trade partner in this context and it Generalised System of Preferences (GSP) has been a useful mechanism for India. But the US’ policy to bring back jobs home and to restrict China’s growth trajectory has negative fallout on India. The US has accused India of not opening the Indian economy for American trade by means of tariffs, intellectual property regulations, subsidies, etc. and has clamped tariffs on Indian exports to America.\n\nMoreover, the USA’s National Defense Strategy 2018 marked Russia and China as its central challenge and for the US India is an ideal balancer against rising China. In this context, India must convince the US that a strong India is in concurrence with the US’ interest. Besides, India must follow **strategic hedging** i.e. simultaneous engagements with major powers because in international relations, there are no permanent friends or permanent enemies, only permanent interests.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_2_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**19. Quadrilateral Security Dialogue (Quad) is transforming itself into a trade bloc from a military alliance, in present times Discuss.**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "Quadrilateral Security Dialogue (Quad) is the informal strategic dialogue between India, the USA, Japan, and Australia. The Quad was established, primarily as a strategic bloc, to counter China’s aggressive stance in the South China Sea. However, Quad’s shared objective to support a “free, open and prosperous” Indo-Pacific region, is also forming the basis of a trade agreement and turn it into a major trade bloc.\n\n**Is Quad Transforming into a Trade Bloc?**\n\n* **India-Pacific Ocean Initiative (IPOI):** The IPOI is an open, non-treaty-based global initiative that aims at practical cooperation in seven thematic areas which also include Maritime Resources; Capacity Building and Resource Sharing; Science, and Trade Connectivity and Maritime Transport. Australia and Japan have agreed to lead IPOI pillars on Maritime Ecology and Connectivity respectively.\n* **Free and Open Indo Pacific (FOIP):** Japan’s FOIP builds around ‘two continents’, Asia and Africa, and ‘two oceans’, Pacific and Indian. Japanese FOIP endorses cooperation with countries who share the common vision of a free and open Indo-Pacific.\n* **Blue Dot Network:**It is a multi-stakeholder initiative led by the USA along with Japan and Australia to bring together governments, the private sector, and civil society to promote high-quality, trusted standards for global infrastructure development. It could directly counter China’s Belt and Road Initiative (BRI).\n* **Supply Chain Resilience Initiative (SCRI):** As COVID-19 and trade tensions between China and the United Statesthreatened globalsupply chains, Japan mooted the Supply Chain Resilience Initiative (SCRI) as a trilateral approach to trade,with India and Australia asthe key-partners. SCRI is a directresponse to individual companies and economies concerned about Chinese political behaviour and the disruption that could lead to the supply chain.\n\n**Challenges Remain**\n\n* **Integration:** All the trade associated initiative launched by the QUAD nations are independent. There is a need for a joint push in the domain of trade and economy.\n* **Lack of Cooperation:** The Quad nations have so far not been able to iron out their trade-related difference. For example, India still does not have a Free Trade Agreement with Australia and the USA.\n* **Need for Clear Vision:** The Quad nations need to better explain the Indo-Pacific Vision in an overarching framework with the objective of advancing everyone’s economic and security interests.\n  + This will reassure the littoral Statesthat the Quad will be a factor for the regional benefit, and a far cry from Chinese allegations that it is some sort of a military alliance.\n\nQuad member countries agreed that a free, open, prosperous, and inclusive Indo-Pacific region will serve the long-term interests of all countries in the region and of the world at large. However, there is a need to put the military component and the economic component together.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2020_PAPER_2_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2020",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**20. What is the significance of Indo-US defence deals over Indo-Russian defence deals? Discuss with reference to stability in the Indo-Pacific region.**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "India’srelationship with the US on defence and strategic issues hasstrengthened asreflected in IndoUS proximity in the security architecture of the Indo-Pacific region. In 2014, the US emerged as the top arms supplier to India, pushing Russia to the second position.\n\n**Russia: A Traditional Partner**\n\n* Russia has been a longstanding and time-tested partner. India has longstanding and wide-ranging cooperation with Russia in the field of defence.\n* Military-technical cooperation has evolved to involve the development and production of advanced defence technologies and systems, such as BrahMos.\n* However, India desires to diversify its defence imports. There is also dissatisfaction in India with post-sales services and maintenance offered by Russia.\n\nThe 21st century has seen the rise of a relentless China. China’s assertive, and bullying attitude is most evident in the Indo-Pacific region where it is challenging the sovereignty of ASEAN countries thus also threatening free sea.\n\nAn engaging feature of the current global situation is the transformation of the Sino-Russian relationship from enmity to entente. The changed scenario has an impact on India and the USA.\n\n**USA: India’s New Best Friend?**\n\n* India has steadily developed important military ties with the US as their interests in the Indo-Pacific are being threatened by China’s expansionist policies.\n* The US supports India’s desired role as a “net security provider” to preserve maritime transportation routes in the Indo-Pacific region.\n* Thus, India and theUS have signed a number of defence dealswhich also includesfourfoundational agreements viz., LEMOA, COMCASA, BECA, and GSOMIA. They enable interoperability of assets, provide each other logistic support, and allow sale of sensitive weapons.\n* The US has also sold weapons like Apache, P-8I aircraft which have enhanced India’s defence capabilities.\n* QUAD which is an informal strategic forum between US, India, Japan, and Australia has a shared objective to support a “free, open and prosperous” Indo-Pacific region.”\n* However, the US support doesn’t come without a rider. It has also frowned on the S-400 deal which India has signed with Russia and has also threatened to impose sanctions on India under CAATSA.\n\nIn the last two decades, the US and India defence relations have strengthened due to sustained efforts from both the countries to iron out differences and agree on protocols in working together against common threats. But, India needs to balance relations with its two defence partners by considering its concerns associated with China and Pakistan over security issues.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_2_Q3",
      "serial_no": "3",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**3. How have the recommendations of the 14th Finance Commission of India enabled the States to improve their fiscal position?**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "The Fourteenth Finance Commission was constituted by the President under Article 280 of the Constitution in 2013 to make recommendations for the period 2015-20. Dr. Y. V. Reddy was appointed the Chairman of the Commission. Finance Commission is a constitutional body created to address issues of vertical and horizontal imbalances of federal finances in India.\n\n**The 14th Finance Commission enabled the States to improve their fiscal position in the following ways:**\n\n* **Share in Centre’s Divisible Pool:** The commission recommended an increase in the share of States in the Center’s divisible tax pool to 42% from 32% at present. This will enhance the states autonomy in deciding their expenditure priorities.\n* **Centrally Sponsored Schemes:** The Commission also recommended eight centrally sponsored schemes (CSS) to be delinked from support from the Centre. Thus, States will be sharing a higher fiscal responsibility and autonomy to implement development initiatives.\n* **Taxation:** The Commission has recommended that tax devolution should be the primary source of transfer of funds to States. This would increase the flow of unconditional transfers and give States more flexibility in their spending.\n* **Grants:** Transfers were proposed including grants to rural and urban local bodies, a performance grant along with grants for disaster relief and revenue deficit. These transfers total to approximately 5.3 lakh crore for the period 2015-20.\n* **Compensation:** The commission recommended compensating States fully for three years in case of revenue loss after GST implementation. The Commission suggested that 100% compensation be paid to the States in the first, second and third years, 75% compensation in the fourth year and 50% compensation in the fifth and final year. It also recommended the creation of an autonomous and independent GST compensation fund through legislative actions\n\nThe Finance Commission recommendations will reform the State finances which will assume greater significance for macroeconomic management as the fiscal deficit of State governments reached unsustainable levels. After the recommendations, States will get autonomy in deciding their expenditure priority, which will enhance the spirit of “balancing wheel of fiscal federalism”.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_2_Q13",
      "serial_no": "13",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**13. Analyse the distinguishing features of the notion of Right to Equality in the Constitutions of the USA and India.**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "Both the United States and India are the largest democratic countries in the world, based on federalism, in their political structure. Democracy can only thrive and flourish where the individuals in society are treated equally and without discrimination. Thus, it was necessary to incorporate provisions in the Constitution to remove the hurdle of existing social and economic inequalities and enable the diverse communities to enjoy the rights and liberties guaranteed under the Constitution.\n\nThe right to equality means the absence of legal discrimination on grounds of caste, race, religion, sex, and place of birth and ensures equal rights to all citizens.\n\n* **Right to Equality in India:** In India, Chapter III named as “Fundamental Rights” was added in the Constitution by the Constituent Assembly. The Constitution follows both the British model of ‘Equality before Law’ and American model of ‘equal protection of law’ (Article 14). It also provides for both civil-legal as well as socio-economic equality. It also highlights substantive equality. The Constitution also provides for affirmative action to ensure equality (Article 16). It focuses on ensuring equality of outcomes along with equality of opportunity. The right also prevents discrimination and abolishes untouchability (Article 17).\n* **Right to Equality in the US:** The original Constitution did not prevent discrimination. The US derived Right to Equality from Declaration of Rights and the Bill of Rights. It was inserted in the Bill of Rights through fourteenth Amendment in year 1868. The US follows the concept of ‘equal protection of law’ which highlights the equal treatment under equal circumstances. The right majorly emphasises on civil and legal equality.\n\nThe Right to Equality is considered a basic feature of both the Constitutions and plays a key role in achieving social and economic justice in our society where upliftment of certain classes is considered necessary for our country to flourish. The emphasis is on the fundamental unity of individuals by providing equal opportunities and treatment to all.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_3_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**5. How is S-400 air defence system technically superior to any other system presently available in the world?**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "The S-400 Triumf is a mobile, surface-to-air missile system (SAM) designed by Russia. It is the most dangerous operationally deployed modern long-range SAM (MLR SAM) in the world, considered much ahead of the US-developed Terminal High Altitude Area Defence system (THAAD). India is engaged with Russia for the purchase of five S-400 Missile Systems.\n\n**Why S 400 is different from others:**\n\n* S-400 Triumf is considered one of the world’s most advanced air defence systems that can simultaneously track and neutralize a range of incoming objects spanning aircraft, missiles and Unmanned Aerial Vehicles (UAV).\n* Each system has four different types of missiles for up to 40 km, 120 km, 250 km and maximum range of 400 km and up to 30 km altitude. The different ranges and varying altitudes create a layered air defence net.\n* Unlike S-400, the American THAAD is a one-dimensional missile system as it can fire only one type of missile upto a range of 150-200 km and Patriot has a range of 180 km.\n* THAAD cannot intercept a fighter jet while S-400 can.\n* The deployment time for S-400 and Patriot is 5 minutes and 25 minutes respectively.\n* The maximum target speed of S-400 is 4.8km/sec as compared to 1.38km/sec of Patriot.\n\nEven though buying S-400 from Russia attracted criticism from the US under the CAATSA agreement, the purchase of the much-awaited S-400 for India was inevitable keeping its volatile neighbors in mind.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2021_PAPER_3_Q6",
      "serial_no": "6",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2021",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**6. Explain the purpose of the Green Grid Initiative launched at World Leaders Summit of the COP26 UN Climate Change Conference in Glasgow in November, 2021. When was this idea first floated in the International Solar Alliance (ISA)?**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "The Green Grid or the One Sun One World One Grid (OSOWOG) initiative was announced at COP-26, Glasgow by India and the UK. The initiative is aimed at accelerating the development and deployment of interconnected electricity grids across continents, countries, and communities, and improving energy access of the poorest through mini-grids and off-grid solutions. The idea for the single global solar grid was first outlined at the International Solar Alliance in 2018, by the Prime Minister of India.\n\n**The Green Grid Initiative aims:**\n\n* To speed up the process of decarbonising energy production.\n* To create an international network of global interconnected solar power grid to ensure 24×7 supply of green power.\n* To help in increasing investment in R&D centers by pooling skill, technology and financial resources.\n\n**As good as it sounds, the implementation of the Green Grid has to counter the following challenges:**\n\n* The creation of global transmission infrastructure involves huge financing.\n* For connecting with the Green Grid, a global cooperation between the countries is needed.\n* As the grid will pass through several geographical locations, it will be sensitive to the security risks emanating from terror organisations.\n\nThe Green Grid initiative is a transformational new programme, with the goal of making universal access to renewable energy a reality. It will ensure that clean power is the most affordable and reliable option for all countries to meet their energy needs efficiently by 2030.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_2_Q19",
      "serial_no": "19",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**19. How will I2U2 (India, Israel, UAE and USA) grouping transform India's position in global politics?**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "I2U2 stands for India, Israel, the UAE and the US. It is also referred as the ‘West Asian Quad’. I2U2 was initially formed in 2021 to deal with issues concerning maritime security, infrastructure and transport.\n\n**Role of I2U2 to Transform India’s Position in Global Politics**\n\n* **Ties with West Asia**   \n  + India will have more freedom to interact **with Israel and its Gulf partners because of I2U2 grouping.**\n  + The **Abraham Accord** will help India to close the gap between Israel and the Gulf countries.\n* **Crude Oil and Defence**   \n  + UAE and Saudi Arabia are India’s one of the **top oil exporters.** And Israel is India’s **important defence partner.**\n* **Success of India’s Foreign policy in West Asia**   \n  + India has successfully balanced its **diplomatic ties with Israel and Gulf Countries**, despite the Israel’s missile attack on **Gaza Strip and West Bank.**\n  + I2U2 grouping will further **deepen India’s** ties with both UAE and Israel.\n  + Also, it will also help India to project itself as a **strong bridge** between the Israel and Arab world.\n* **India and USA**   \n  + Now, India and the US have **two platforms to engage** with each other in Indo-pacific region, i.e. **QUAD and I2U2 group.**\n  + It further strengthens India’s role as **net security provider** in Indian Ocean Region.\n* **Food Security**   \n  + USD 2 billion will be invested to create a number of **Integrated Food Parks around India** along with modern climate technologies.\n  + It will **aid in food insecurity** in South Asia and the Middle East.\n* **Foreign Direct Investment (FDI)**   \n  + It is a boost to Comprehensive Economic Partnership Agreement signed between India & UAE, which is the highest contributor of FDI to India from Gulf.\n* **Clean Energy**   \n  + **A hybrid renewable energy project of wind and solar power** along with battery energy storage technology, will be established in Gujarat.\n  + It will **reduce the energy scarcity in South Asia** through grid network.\n\nThe I2U2 group makes lot of sense in West Asia and South Asia geopolitics. For India, it leverages its good relations with Israel, the Gulf and the USA to further build economic and diplomatic relations. But there is need for confidence building measures between Israel and Arab world as both of them don’t trust each other. Here, India can act as a communication channel to build trust among Israel and Arab world.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_2_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**20. 'Clean energy is the order of the day.' Describe briefly India's changing policy towards climate change in various international fora in the context of geopolitics.**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "India’s climate change policy has undergone a significant change over the years, from seeking energy security to taking initiative in the field of clean energy at a global level, the country’s diplomatic stand at the Conference of Parties reflects its pro-environment outlook. By accepting the net-zero commitments, India has reiterated its stand that its policy on climate change is based on the principle of common but differentiated responsibilities.\n\nIndia, since ancient times, has always promoted harmony with nature. This can be further evidenced by the country’s commitment to the Paris Accord and the acceptance of the net-zero targets, proving that India is aware of clean energy’s significance.\n\nIn this context, the five-point agenda of Panchamrit for dealing with climate change, including ambitious targets related to the use of renewable energy for meeting the country’s energy requirements, reduction in carbon emissions and intensity in its economy and achieving the target of net-zero, are a clear statement by India of its commitment towards clean energy as well as its intent for taking a leading role in the same.\n\n* India’s geopolitical and global outlook, based on the constantly evolving global environmental challenges, can be witnessed by the country’s diplomacy at the United Nations Framework Convention on Climate Change (UNFCCC).\n* India does not agree to the imposition of legally binding targets since it requires strategic autonomy to (a) pursue its domestic developmental agenda and (b) identify the method required to commit to targets related to climate change and clean energy.\n* India, keeping the ambition of enhancing its global profile and power ambitions, has moved away from a reactionary to a participatory approach. This can be seen with India’s change in position from its response to the Kyoto Protocol commitments as compared to the Paris Agreement.\n* Further, keeping in line with its diplomatic endeavours globally and the recognition of clean energy’s significance, India has taken a leading role along with other major global players in several international initiatives such as the International Solar Alliance (ISA), the One Sun, One World and One Grid programme and the Lifestyle for Environment (LiFE) Movement.\n* Further, India has also raised its concerns regarding the reluctance of the developed nations in sharing the necessary technologies with the developing nations to enable them to effectively deal with climate change.\n\nThus, India has modified its climate change policy according to the developments taking place on a global scale and has taken initiatives in mitigating issues arising out of climate change while keeping in mind its geopolitical objectives.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2022_PAPER_4_Q5",
      "serial_no": "5",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2022",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**5. (a): Russia and Ukraine war has been going on for the last seven months. Different countries have taken independent stands and actions keeping in view their own national interests. We are all aware that war has its own impact on the different aspects of society, including human tragedy. What are those ethical issues that are crucial to be considered while launching the war and its continuation so far? lllustrate with justification the ethical issues involved in the given state of affair.**  **(b): Write short notes on the following in 30 words each:**  **(i) Constitutional morality**  **(ii) Conflict of interest**  **(iii) Probity in public life**  **(iv) Challanges of digitalization**  **(v) Devotion to duty**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "**(a):**In the history of humankind, war is one of the catastrophic instruments created by mankind itself. All around impact of war is not just limited to this generation but its hazardous impacts extend to next generations.\n\nWe are witnessing that how Russia – Ukraine war seriously impacting the all-possible corners of society by the way of gross human rights violation, disruptions in global demand supply chain, wastage of precious resources, widespread painful migration.\n\nTo avoid this type of episodes, nations should take collective stands and action keeping in view their own collective global interest rather than independent stands and individual national interest.\n\n**Possible ethical issues while launching the war and its continuation**\n\n* **Ethical Issues of Human rights-** In war time there is gross violation of human right. Women, children and other vulnerable section faces unprecedented hardships. For example, Human genocide, heinous massacre and brutality against women and children comes under the worsen form of human right violation.\n* **Ethical dimensions of rights of future generation and present generation-**Cost of present generation war is paid by next generation. For ex- Hiroshima -Nagasaki bombing in second world war. The ethical concern here is why the cost of present generation should be paid by coming future generation?\n* **Issues of accountability and answerability-** In war time, who is accountable and answerable to whom, there is no fix criteria.\n* **National interest vs Global interest –**There is grave ethical concern is that nations put their own individual national interest over collective global interest.\n* **Individual Aspiration vs Collective Aspiration-**Individual aspirations of political peers override the collective aspirations of millions of masses.\n* **Means vs Ends**– For gaining territorial and expansion ends nation use wrong means of war, border conflict etc. It led to dangerous consequences which impacts all corners of society and even next generations.\n* **Issues of proportionate vs disproportionate dimension of war**- Ethics of war should be entitled to its proportionate response but the activity of nuclear attack, mass massacre and gross violation of war ethics changes war into disproportionate dimensions. For example, attack on Ukraine nuclear reactor by Russia can amount to grave consequences to the world.\n\nAbout war, Nobel Laureat John Steinbeck famously quoted that “all war is symptom of man's failure as a thinking animal. Humankind should understand the fact that war can never fix the problem. Aim of prosperous and peaceful society can be achieve through dialogue, diplomacy, decency.\n\n**(b):**\n\n**(i) Constitutional Morality-**In an important case, **NCT of Delhi vs Union of India,** Hon'ble justice of supreme court **Shri Deepak Mishra** wrote that “constitutional morality in its strictest sense implies a strict and complete adherence to constitutional principles as enshrined in the various segments of the document. It is required that all constitutional functionaries to **‘cultivate and develop a spirit of constitutionalism’.** where every action taken by them is governed by and is in strict conformity with the basic tenets of the constitution”. For example, judgement of supreme court on Sabarimala and Hadiya case, abolition of sec377 etc.\n\n**(ii) Conflict of Interest-** This situation arise when public duty interest conflicts with personal interest. This is the case where conscience being caught up in between the personal and professional ends. For example, former ICICI chairman Chanda Kochhar’s resignation, former NSE CEO Chitra Ramkrishna case.\n\n**(iii) Probity in public life -** Probity is one of the virtues in public life. Person with higher **probity quotient** has higher grade of inegrity,honesty, decency and morality. Impartiality and non-partisanship are key instruments of aptitude of probity in public life. For example, life example of Abdul kalam and former PM Lal Bahadur Shastri.\n\n**(iv)Challenges of digitalization-**Digitalization is the process of transformation of possible information into digital data format.  Challenges-\n\n* Digital illiteracy and issue of digital divide among people.\n* Cyber frauds and digital economic fraud.\n* Cyber warfare.\n* Mass surveillance and digital phishing attacks.\n* Issues of poor network and connectivity.\n* High energy consuming devices.\n\n**(V) Devotion to duty-** It express the strong emotion, integrity, loyalty, determination and admiration towards duty. Swami Vivekananda famously quoted that **\"Devotion to duty is the highest form of worship of God”.** For example, Nishkama karma concept of Bhagwat Geeta, way of life of Mother Teresa.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2023_PAPER_3_Q20",
      "serial_no": "20",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2023",
      "exam_session": "3",
      "paper_number": 3
    },
    "content": {
      "question_text": "**20. Give out the major sources of terror funding in India and the efforts being made to curtail these sources. In the light of this, also discuss the aim and objective of the No Money for Terror (NMFT) Conference recently held at New Delhi in November 2022.**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "Ever since its birth in 1947, India has been a witness to various kinds of terrorist and insurgent activities. Over the years India has learned from its mistake and evolved numerous ways to tackle terror funding and other related activities.\n\n**Major sources of terror funding**\n\n* **State Sponsorship:** The use of terror to further diplomatic interests is a known practice. States sponsor crimes and support terrorist to be able to use them when needed for their purpose.\n* **Counterfeit Currency:** It involves directly printing and circulating fake currency in the market. Alternatively, this is a tool used by neighbouring states to destabilize the Indian economy.\n* **Organised Crime:** Criminal organizations generally work in nexus and are often connected to bigger terrorist groups. The flow of resources is two-ways between these two.\n* **Extortion:** This remains the biggest source of funding of terrorism in India especially in the North-East.\n* **Hawala System:** This is an illegal method of transferring money, generally through international borders that is used by criminal networks.\n\n**Efforts to curtail sources**\n\n* **National Investigation Agency (NIA):** It is the premier agency in India for combating terror across states without special permission from the states.\n* **Unlawful Activities Prevention Act:** This anti-terror legislation seeks to designate an individual as a “terrorist”.\n* **National Intelligence Grid (NATGRID):** It is a centralised data library of terror and crime related information.\n* **SAMADHAN Doctrine:** Developed specifically for the Left-Wing Extremism problems, it also aims to curb the access of terror organizations to funds.\n\nRecently, the third No Money for Terror (NMFT) Ministerial Conference on Counter-Terrorism Financing was held in New Delhi, India. It sought to:\n\n* Collaborate with countries around the world to curtail terror and extremist funding.\n* To set up a secretariat regarding the same in the country, which won't be an investigative body but operate on the concept of collaboration and cooperation.\n* To investigate new and emerging threats and methods of propagating terrorism.\n\nBeing surrounded by two hostile neighbours does not allow India any leeway for complacent behaviour on the question of internal security. Through several measures, India continues to fight the battle against terrorism.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_2_Q9",
      "serial_no": "9",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**Q.9 “The West is fostering India as an alternative to reduce dependence on China’s supply chain and as a strategic ally to counter China’s political and economic dominance.” Explain this statement with examples. (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "### Approach:\n\n* Briefly introduce China's increasing global influence.\n* Mention how the strategic shift is taking place in the current multipolar world, substantiate with examples.\n* Conclude with a forward-looking approach.\n\n### Introduction\n\nAs China's economic dominance and assertive expansionist policies rise, the West is adopting a ‘**China+1’** strategy, looking for alternatives with India as a key option.\n\n### Body\n\nThis strategic shift unfolds in following areas:\n\n* **Reducing Dependence on China’s Supply Chain:**\n  + US-India **Initiative on Critical and Emerging Technologies** aims to boost collaboration in fields like semiconductor ecosystem, AI, defence cooperation etc. to reduce reliance on Chinese technology.\n  + The **EU's free trade agreement talks with India** aim to strengthen economic ties and reduce tariffs.\n  + By expanding their base in India, companies like Apple and Samsung are reducing reliance on Chinese supply chains and leverage India's consumer market.\n* **India as a Strategic Ally Against China’s Dominance:**\n  + The proposed **India-Middle East-Europe Economic Corridor (IMEC)** is viewed as a potential counter to China's BRI in Eurasia, helping balance China's expanding economic and political influence.\n  + The **Quadrilateral Security Dialogue (Quad)** enhances Indo-Pacific stability through security, economic, and environmental collaboration.\n  + India’s **2+2 Dialogues** with the US, Japan & Australia and joint exercises like **Malabar and RIMPAC** enhance interoperability and collective security.\n  + The **US-led Indo-Pacific Economic Framework (IPEF)** collaborates with India to tackle economic challenges and counter China's influence through trade cooperation.\n\n### Conclusion\n\nLooking forward, India has the potential to emerge as a key player in global supply chains, provided **it addresses internal challenges like infrastructure and regulatory frameworks.** By capitalising on this partnership, India can not only bolster its economy but also contribute to a **more balanced global order.**",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_2_Q10",
      "serial_no": "10",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "2",
      "paper_number": 2
    },
    "content": {
      "question_text": "**Q10. Critically analyse India's evolving diplomatic, economic and strategic relations with Central Asian Republics highlighting their increasing significance in regional global geopolitics. (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "### Approach:\n\n* Write a brief introduction on the evolution of diplomatic, economic and strategic relations between India and Central Asian Republics (CARs).\n* Discuss various initiatives in the field of diplomatic, economic and strategic relations.\n* Show how despite various initiatives, India has reaped limited benefits.\n\n### Introduction\n\nIndia has significantly increased its diplomatic, economic and strategic relations with **Central Asian Republics (CARs)** for serving **its interest in central Asia.**\n\n### Body\n\n**Evolution of India-CARs Relations:**\n\n* **Diplomatic Engagements:**\n  + **\"Connect Central Asia\" Initiative (2012)** was launched to strengthen ties and re-energize India's efforts in Central Asia.\n  + **India-Central Asia Summit and Shanghai Cooperation Organization (SCO)** highlights India’s enhanced ties with CARs.\n* **Economic Relations:**\n  + **TAPI pipeline** and **Ashgabat Agreement** shows India’s enhanced access to CARs.\n  + **Chabahar Port** allows India to facilitate trade through Iran to the South Caucasus, Central Asia, and wider Eurasia.\n* **Strategic Relations:**\n  + CARs share borders with **Afghanistan,** a major source of religious extremism.\n  + India maintains military bases in **Tajikistan** and conducts joint exercises with **Uzbekistan.**\n\n![](TEST_IMAGES/UPSC_MAIN_CSE_GS_2024_PAPER_2_Q10_IMG_1.png)\n\n**Critical Analysis:**\n\n* An **unstable Afghanistan** and difficult **India-Pakistan relations** obstruct direct connectivity.\n* India's trade with Central Asia is approximately **USD 2 billion** (China-Central Asia: USD 100 billion).\n* India's strategy has been **influenced** by its policies toward **Afghanistan, China, and Pakistan**, as well as by Russian and US designs.\n\n### Conclusion\n\nIndia should maintain **proactive diplomatic engagements** with Central Asian nations to ensure political, economic, and security cooperation through the **India–Central Asia Dialogue.** As a full **SCO member,** India should enhance its role in regional security and economic dialogues.",
      "explanation_format": "markdown"
    }
  },
  {
    "exam_type": "UPSC_MAIN_CSE",
    "metadata": {
      "question_id": "UPSC_MAIN_CSE_GS_2024_PAPER_4_Q2",
      "serial_no": "2",
      "subject": "GS",
      "topic": "",
      "subtopic": "",
      "year": "2024",
      "exam_session": "4",
      "paper_number": 4
    },
    "content": {
      "question_text": "**Q.2 (a) \"It is not enough to talk about peace, one must believe in it; and it is not enough to believe in it, one must act upon it \". In the present context, the major weapon industries of the developed nations are adversely Influencing continuation of a number of wars for their own self-interest, all around the world. What are the ethical considerations of the powerful nations in today’s international arena to stop continuation of ongoing conflicts? (Answer in 150 words)**  **Q.2 (b) Global warming and climate change are the outcomes of human greed in the name of development, indicating the direction in which extinction of organisms including human beings is heading towards loss of life on Earth. How do you put an end to this to protect life and bring equilibrium between the society and the environment? (Answer in 150 words)**",
      "question_format": "markdown",
      "language": "en",
      "category": "InternationalRelations"
    },
    "solution": {
      "explanation": "**(a):**\n\n### Approach:\n\n* Introduce with the mentioning the meaning of the quote in brief\n* Outline the ethical considerations of the powerful nations with examples\n* Conclude suitably\n\n### Introduction:\n\nThe quote stresses that **peace is not achieved through words or belief alone**; it requires concrete actions and commitment to bring it into reality.\n\n* This highlights the **ethical responsibility of nations to act on their commitment** to peace, rather than allowing self-interest to fuel ongoing conflicts worldwide.\n\n### Body\n\n**Ethical Considerations of the Powerful Nations:**\n\n* **Responsibility for Global Peace:** Powerful nations must prioritise peace over profit, avoiding actions that fuel conflicts, such as arms sales to war-torn regions.\n  + **Example:** India supports a UN ceasefire for Gaza, advocates for a two-state solution, and condemns civilian casualties.\n* **Promoting Human Rights:** They must ensure that their foreign policies uphold human rights, avoiding support for oppressive regimes.\n  + **Example:** Operation Dost in Turkey and Syria is a prime example of India's rapid humanitarian assistance\n* **Diplomatic Solutions:** They should pursue peaceful resolutions through diplomacy rather than military intervention.\n  + **Example:** The US and EU's role in the 2015 Iran nuclear deal.\n* **Supporting Disarmament and Reducing Proliferation:** Major powers must adhere to international treaties, such as the Arms Trade Treaty (ATT), to curb the spread of weapons of mass destruction and prevent escalating global violence.\n* **Regulate Weapon Industries:** Nations must **enforce strict arms regulations,** including licensing, oversight of arms production, and mandatory sales reporting to ensure accountability and global stability.\n  + Countries **should collaborate internationally** to prevent weapon proliferation and promote responsible practices among arms manufacturers.\n\n### Conclusion\n\nIn an interconnected world, powerful nations have a critical role in shaping a more peaceful future. As the global landscape evolves, the effectiveness of these nations in fostering peace will ultimately determine the success of collective efforts to prevent future conflicts.\n\n**(b):**\n\n### Approach:\n\n* Provide a brief introduction outlining the concerns and the necessary steps moving forward\n* Outline the strategies to address global warming and restore environmental equilibrium\n* Conclude suitably\n\n### Introduction:\n\nThe crisis of global warming and climate change, **driven by human greed disguised as development,** leads to severe environmental degradation and threatens the survival of many species, including humankind.\n\n* This necessitates a reassessment of humanity's relationship with the planet.\n\n### Body:\n\n**Addressing Global Warming and Restoring Environmental Balance:**\n\n* **Boosting Solar Energy Capacity:** Promoting clean energy and reducing carbon emissions through large-scale solar power initiatives.\n  + **Example:** India’s National Solar Mission.\n* **Sustainable Agriculture:** Encouraging efficient water use and eco-friendly farming methods to minimise agriculture’s environmental footprint.\n  + **Example:** Pradhan Mantri Krishi Sinchai Yojana.\n* **Environmental Policies and Global Cooperation:** Promoting stricter emission targets and enhancing international collaboration for effective climate action.\n  + **Example:** Countries declaring their net zero emissions.\n* **Fostering a Circular Economy:** Promoting recycling, upcycling, and sustainable production and consumption to reduce waste.\n  + **Example:** Swachh Bharat Mission.\n* **Implementing Carbon Pricing and Green Technologies:** Using cap-and-trade systems and investing in innovations like Carbon Capture and Storage (CSS) to reduce emissions and promote sustainability.\n* **Personal Responsibility and Lifestyle Changes:** Encouraging individuals to reduce energy use, use public transport, and adopt sustainable practices to lower carbon footprints.\n  + **Example:** Shifting towards Electric Vehicles (EVs).\n* **Climate Literacy and Awareness:** Promoting education and awareness on climate change to foster informed and proactive environmental choices.\n\n### Conclusion:\n\n\"**Earth provides enough to satisfy every man's need, but not every man's greed.\"**\n\n**-Mahatma Gandhi**\n\nThe pathway to protecting life and restoring equilibrium between society and the environment lies in a comprehensive shift toward sustainable development, responsible energy use, ecosystem restoration, and global cooperation.",
      "explanation_format": "markdown"
    }
  }
]